[
  {
    "slug": "fifa-appoints-south-african-referee-tom-abongile-1762443989733",
    "headline": "FIFA Appoints South African referee, Tom Abongile",
    "kicker": "",
    "summary": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.",
    "bodyText": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.\n\nHis compatriots Zakhele Siwela and Akhona Makalima will serve as assistant referee and VAR official, with a Beninese assessor overseeing the match. The appointment has sparked outrage in Nigeria, where officials and fans questioned FIFA’s neutrality.\n\nFIFA said the selections were made by its Referees Committee, noting South Africans’ strong experience in major continental competitions.\n\n*The chief executive of Israeli club Maccabi Tel Aviv says it is \"incredibly sad\" away fans have been banned from his side's Europa League match at Aston Villa.\n\nJack Angelides  noted that Politics should never be drawn into football.\n\nLast month, the local Safety Advisory Group - the body responsible for issuing safety certificates for matches - informed Villa that no travelling fans would be allowed to attend the fixture in Birmingham on Thursday after police raised concerns, sparking a major backlash.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e82fdb64-b9f1-42c2-af30-291eaffc0894.webp",
    "timestamp": "2025-11-06T15:46:29.733Z"
  },
  {
    "slug": "bandits-kill-pastor-abduct-20-worshippers-in-kaduna-community-1761995025934",
    "headline": "BANDITS KILL PASTOR, ABDUCT 20 WORSHIPPERS IN KADUNA COMMUNITY",
    "kicker": "BREAKING",
    "summary": "Armed bandits attacked the Farin Dutse community in Kauru Local Government Area of Kaduna State, killed Rev. Yahaya Kambasiya of the United Church of Christ in Nigeria (HEKAN), and kidnapped more than 20 worshippers. Church leaders are calling for urgent security intervention.",
    "bodyText": "Armed bandits raided the Farin Dutse community in Kauru Local Government Area of Kaduna State and killed a local pastor, Rev. Yahaya Kambasiya, during a night attack that also left more than 20 residents abducted.\n\nRev. Kambasiya was a minister with the United Church of Christ in Nigeria (HEKAN). According to witnesses, the attackers moved into the village shooting, forcing families out of their homes, and targeting members of the church community. He was shot and killed at the scene.\n\nAfter killing the pastor, the gunmen went house to house and took several people, including women and youths, before escaping with them into nearby bush areas.\n\nThe President of HEKAN, Rev. Dr. Amos Kiri, condemned the attack and described it as “an attack on a peaceful worship community.” He called the killing of Rev. Kambasiya “painful and unacceptable,” and demanded immediate action from security agencies to rescue the abducted members and stop repeated raids on Christian communities in that part of Kaduna.\n\nHe also urged authorities at both state and federal level to stop treating these incidents as routine and to treat them as an ongoing emergency affecting worship centres, pastors, and entire families.\n\nResidents of the area say this is not the first time armed groups have entered at night, taken hostages, and left without resistance. Locals say they feel abandoned and unprotected, and that kidnappings for ransom have become a way of life in rural Kaduna.\n\nAs of now, the abducted worshippers are still missing.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/89079af3-addc-4005-9625-c4353d1688e1.jpeg",
    "timestamp": "2025-11-01T11:03:45.934Z"
  },
  {
    "slug": "adekunle-gold-reveals-ongoing-battle-with-sickle-cell-disease-1761994916694",
    "headline": "ADEKUNLE GOLD REVEALS ONGOING BATTLE WITH SICKLE CELL DISEASE",
    "kicker": "HEALTH • MUSIC",
    "summary": "Nigerian singer Adekunle Gold says he is still living with sickle cell disease and still goes through painful “crises,” a condition he’s managed since he was five years old. He urged Nigerians to know their genotype before marriage so they don’t pass the disorder to their children, saying “a lot of people still don’t understand the risk",
    "bodyText": "Adekunle Gold has opened up about his ongoing battle with sickle cell disease, saying he still experiences painful health crises even as an adult.\n\nAccording to him, his first major crisis happened when he was about five years old. He said his mum had to carry him on her back to the hospital in the middle of the night while his dad wasn’t home. He’s been on medication ever since.\n\n“I still have crises,” he said. “When we talk about a crisis, it’s pain in your joints, your legs, and sometimes your stomach. It’s really crazy.” He added that while the attacks are now less frequent than when he was younger, they haven’t fully gone away. He credits better self-care and access to treatment for keeping things under control.The 38-year-old artist also addressed rumours that he did a bone marrow transplant to ‘cure’ it. He denied that and said people on the internet talk “with so much confidence about what they don’t know.”\n\nBeyond talking about his own story, Adekunle Gold used the moment to push awareness. He told Nigerians to take genotype seriously before getting married, because two people with incompatible genotypes can pass sickle cell to their child and lock that child into a lifetime of pain. “Knowing your genotype is very important,” he said. “A lot of people still don’t understand the risks.”\n\n\nHe said he wants to “make more noise” about it, not just as a celebrity moment, but so fewer kids are born into a situation where every fever could become an emergency and every joint pain might mean another night in the hospital.\n\nFor him, this is personal — not PR. He’s lived it.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/9027b890-d293-453c-accf-334652e0c617.jpeg",
    "timestamp": "2025-11-01T11:01:56.694Z"
  }
]