[
  {
    "slug": "chaos-in-katsina-player-injured-during-katsina-united-vs-barua-fc-clash-1762794105157",
    "headline": "Chaos in Katsina: Player Injured During Katsina United vs Barua FC Clash",
    "kicker": "",
    "summary": "",
    "bodyText": "Fresh concerns have emerged over player safety in the Nigeria Premier Football League (NPFL) after Barau FC midfielder, Nana Abraham, was allegedly stabbed in the neck by a pitch invader during his team’s away match against Katsina United at the Muhammadu Dikko Stadium on Saturday. \n\nOn a closer look in a video circulated on social media, it was a stone been thrown at the player causing a cut in the neck area, and it was attended to swiftly by the medical team on ground, as play was stopped to that effect. \n\nThe shocking incident occurred moments after Barau FC scored a 69th-minute equaliser in the tense encounter.\n\nImages circulating on social media showed Abraham bleeding heavily from the neck while receiving emergency medical attention on the pitch.\n\nHe was later substituted and taken to a nearby hospital, where he is said to be responding to treatment.\n\nIt follows several similar episodes that have marred the 2025/26 NPFL season, raising serious concerns about the effectiveness of crowd control and stadium safety.\n\nIn October, the NPFL handed down heavy sanctions to Kano Pillars after fans invaded the Sani Abacha Stadium pitch during a Matchday 8 clash against Shooting Stars Sports Club (3SC).\n\nThe violent scenes erupted moments after 3SC scored a dramatic 94th-minute equaliser.\n\nSeveral match officials and away team players were assaulted in the chaos, prompting the league to impose a ₦9.5 million fine, deduct three points and three goals from Pillars’ record, while also banning the team from their Sani Abacha Stadium home ground for at least 10 home matches.\n\nIn an October decision signed by NPFL’s Chief Operating Officer Davidson Owumi, the league management vowed to maintain “a zero-tolerance policy for violence,” warning that any future infractions would attract even stiffer penalties.\n\n“We will invoke the rules wherever and whenever required to keep bad behaviour of fans, players and officials out of the league,” Mr Owumi said in the statement released on October 13.\n\nThat statement, now more relevant than ever, underscores the NPFL’s ongoing struggle to translate disciplinary pronouncements into consistent deterrence. Despite multiple sanctions, violence has persisted at alarming levels.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/424ed144-9bd5-4eca-8ae3-7699de89c653.jpeg",
    "timestamp": "2025-11-10T17:01:45.157Z"
  },
  {
    "slug": "super-eagles-begin-camp-as-full-squad-list-drops-ahead-of-qualifiers-1762793911359",
    "headline": "Super Eagles Begin Camp as Full Squad List Drops Ahead of Qualifiers",
    "kicker": "",
    "summary": "Nigeria’s Head Coach, Eric Chelle, has named a 24-man squad for the decisive 2026 FIFA World Cup African Play-off Tournament in Rabat, Morocco, recalling goalkeeper Maduka Okoye, Spain-based forward Chidera Ejuke, and midfielder Raphael Onyedika for the crucial encounter.",
    "bodyText": "Nigeria’s Head Coach, Eric Chelle, has named a 24-man squad for the decisive 2026 FIFA World Cup African Play-off Tournament in Rabat, Morocco, recalling goalkeeper Maduka Okoye, Spain-based forward Chidera Ejuke, and midfielder Raphael Onyedika for the crucial encounter.\n\nBright Osayi-Samuel who was injured in the last qualifying window is also in the roster made public on Saturday.\n\nThe Super Eagles will face Gabon in the first semi-final at the 22,000-capacity Complexe Sportif Prince Héritier Moulay El Hassan on Thursday, while Cameroon take on DR Congo in the other semi-final at the El-Barid Stadium.\n\nChelle’s list features the core of Nigeria’s experienced internationals alongside a few returning and emerging names as the Super Eagles seek redemption after their underwhelming group campaign.\n\nCaptain William Troost-Ekong, striker Victor Osimhen, and first-choice goalkeeper Stanley Nwabali headline the squad, which also includes defender Calvin Bassey and young prospect Benjamin Fredericks.\n\nIn midfield, the experienced duo of Alex Iwobi and Wilfred Ndidi return, alongside Frank Onyeka and Alhassan Yusuf, while Onyedika’s inclusion adds depth and structure to Chelle’s transitional plans.\n\nIn attack, Chelle has gone for a balance of flair and form, with Ademola Lookman, Samuel Chukwueze, Moses Simon, and Osimhen joined by Ejuke, Tolu Arokodare, Jerome Akor Adams, and Olusegun Olakunle — all players capable of offering pace, width, and goal threat in a game of high stakes.\n\nDefender Semi Ajayi is suspended for the semi-final after picking up two yellow cards during the 10-match qualifying series.\n\nThe Hull City man will be available only if Nigeria advances to the final round.\n\nThe players are expected to arrive in Rabat from their respective club bases on Monday, 10 November, ahead of a four-day closed training camp.\n\nThe winner of the Nigeria–Gabon tie will face either Cameroon or DR Congo for a place in the final qualifying phase, where Africa’s representatives for the global tournament will be decided.\n\n24 Super Eagles for 2026 FIFA World Cup Africa Play-Off Tournament\n\nGoalkeepers: Stanley Nwabali (Chippa United, South Africa); Amas Obasogie (Singida Blackstars, Tanzania); Maduka Okoye (Udinese FC, Italy)\n\nDefenders: William Ekong (Al-Kholood, Saudi Arabia); Calvin Bassey (Fulham FC, England); Oluwasemilogo Ajayi (Hull City, England); Bright Osayi-Samuel (Birmingham City, England); Bruno Onyemaechi (Olympiakos, Greece); Chidozie Awaziem (Nantes FC, France); Zaidu Sanusi (FC Porto, Portugal); Benjamin Fredericks (Dender FC, Belgium)\n\nMidfielders: Alex Iwobi (Fulham FC, England); Frank Onyeka (Brentford FC, England); Alhassan Yusuf Abdullahi (New England Revolution, USA); Wilfred Ndidi (Besiktas FC, Turkey); Raphael Onyedika (Club Brugge, Belgium)\n\nForwards: Ademola Lookman (Atalanta BC, Italy); Samuel Chukwueze (Fulham FC, England); Victor Osimhen (Galatasaray FC, Turkey); Moses Simon (Paris FC, France); Chidera Ejuke (Sevilla FC, Spain); Tolu Arokodare (Wolverhampton Wanderers, England); Akor Adams (Sevilla FC, Spain); Olakunle Olusegun (Pari Nizhny Novgorod, Russia).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cd368b75-2e2b-4161-b29d-f4eb14968da3.jpg",
    "timestamp": "2025-11-10T16:58:31.359Z"
  },
  {
    "slug": "soludo-extends-olive-branch-1762789847343",
    "headline": "SOLUDO EXTENDS OLIVE BRANCH",
    "kicker": "",
    "summary": "",
    "bodyText": "Governor Chukwuma Charles Soludo has extended an olive branch to his fellow contestants following his sweeping victory in the November 8 Anambra governorship election.\n\nIn a statement, Soludo expressed appreciation to all those who participated in the race, including Nicholas Ukachukwu, Paul Chukwuma, George Moghalu, and others, acknowledging their shared commitment to the development of Anambra State.\n\nHe urged his opponents and their supporters to put political differences aside and join hands in advancing the state’s common goals — improved infrastructure, job creation, and enhanced community security.\n\nSoludo reaffirmed his pledge to run an inclusive and transparent government that listens to all voices, including dissenting ones.\n\nHe called on the people of Anambra to unite behind a collective vision of progress, saying his renewed mandate is an opportunity to build a stronger, more prosperous state for all.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/902d1345-1b1f-4094-90b9-35c2841ad466.webp",
    "timestamp": "2025-11-10T15:50:47.343Z"
  },
  {
    "slug": "soludo-re-elected-sweeps-all-21-lgas-in-anambra-poll-1762784068633",
    "headline": "SOLUDO RE-ELECTED, SWEEPS ALL 21 LGAS IN ANAMBRA POLL",
    "kicker": "",
    "summary": "",
    "bodyText": "Governor Charles Soludo of APGA has been reelected for a second term, winning all 21 local government areas with 422,664 votes.\n\nAPC's Nicholas Ukachukwu came second with 99,445 votes.\n\nTinubu and Nige congratulated Soludo, while LP's Moghalu and ADC's Nwosu rejected the results, alleging vote-buying. \n\nVoter turnout was 21.45%.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/374a433f-ac2b-444a-802d-98c77414a4c0.jpeg",
    "timestamp": "2025-11-10T14:14:28.633Z"
  },
  {
    "slug": "fayose-meets-obasanjo-in-ogun-1762783856804",
    "headline": "Fayose Meets Obasanjo in Ogun",
    "kicker": "",
    "summary": "",
    "bodyText": "A former Governor of Ekiti State, Ayodele Fayose, paid a visit to ex-President Olusegun Obasanjo at his residence in Abeokuta, Ogun State, yesterday, ahead of Fayose’s upcoming 65th birthday on November 15.\n\nPhotos shared on X by the Senior Special Assistant on Public Communication and Social Media to the FCT Minister, Nyesome Wike, Lere Olayinka, captured the two leaders in warm moments, signalling an end to years of public animosity.\n\nThe meeting also comes amid a series of high-profile visits to Fayose in the lead-up to his birthday, including one from former Vice President Yemi Osinbajo on Tuesday.\n\nOsinbajo said he decided to visit Fayose ahead of the celebration because he would not be available on the day of the event.\n\nDuring the visit, both leaders exchanged warm pleasantries and reflected on national issues, with Osinbajo commending Fayose’s courage and consistency in public life.\n\nFayose, in turn, expressed appreciation for the visit, describing it as a mark of respect and friendship across political lines",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d787fe80-3861-4149-82dc-2919a2a6b7be.jpg",
    "timestamp": "2025-11-10T14:10:56.804Z"
  },
  {
    "slug": "man-dies-after-attempting-to-flee-efcc-raid-in-lekki-1762783647096",
    "headline": "Man Dies After Attempting to Flee EFCC Raid in Lekki",
    "kicker": "",
    "summary": "",
    "bodyText": "A man identified as Endurance Udeke has died after jumping from a four-storey building during a raid conducted by operatives of Nigeria’s Economic and Financial Crimes Commission (EFCC) in the Lekki area of Lagos.\n\nThe EFCC confirmed the incident in a statement issued on Saturday, saying the operation, which took place on 4 November, targeted suspected internet fraudsters residing at Periwinkle Estate, Lekki Phase 1.\n\nAccording to the agency, four suspects were arrested during the sting operation, while Udeke and another resident attempted to escape after learning of the EFCC’s presence.\n\nThe second individual survived after receiving treatment and has since been stabilised, according to EFCC officials.\n\nThe anti-graft agency stressed that its operatives had no physical contact with Udeke before the incident, describing his action as tragic and unnecessary.\n\nThe agency added that the case has been handed over to the police for further investigation into the circumstances surrounding Udeke’s death.\n\nThe EFCC urged the public to remain calm and cooperate during its lawful operations, insisting that its raids are conducted in accordance with due process.\n\nThe incident comes amid growing scrutiny of EFCC operations following several controversial raids in recent months.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b6d2f418-2a7f-4aa1-940f-73065f6e5d65.webp",
    "timestamp": "2025-11-10T14:07:27.096Z"
  },
  {
    "slug": "at17-conversation-regina-daniels-ned-nwoko-1762774448776",
    "headline": "#At17 Conversation: Regina Daniels & Ned Nwoko",
    "kicker": "",
    "summary": "",
    "bodyText": "Following up with the trending #At17 discussion, Regina Daniels has stated that she was married at 17 and challenged Ned Nwoko to address allegations about her past, including claims around drug use.\n\nNed has responded, describing the viral video involving Regina’s family, where thugs\nwere allegedly sent to intimidate her — as a “Nollywood script.”\n\nBeyond the headlines, this story touched on deeper issues such as:\n- Age and consent in relationships\n- Power dynamics in marriages\n- How social media fuels narratives and shapes public opinion\n\nIt’s a reminder that celebrity stories often reflect broader societal conversations about\ninfluence, vulnerability, and accountability.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/51634bef-707d-47d8-990c-c85a8987cecb.jpeg",
    "timestamp": "2025-11-10T11:34:08.776Z"
  },
  {
    "slug": "uk-flags-21-nigerian-states-as-high-risk-1762774166090",
    "headline": "UK Flags 21 Nigerian States as High-Risk",
    "kicker": "",
    "summary": "",
    "bodyText": "The UK has updated it's travel advisory, warning citizens against traveling to 21 Nigerian states due to rising insecurity.\n\nThe advisory pointed to kidnapping, violent crime, and intercommunal clashes across regions — from the Northeast and Northwest to parts of the Southeast, the capital territory, and even concerns around crime levels in Lagos.\n\nFor many Nigerians, this is not shocking news — it simply underscores the security realities people face daily. It also raises important questions about governance, stability, and how international perception affects travel, business, and global\nengagement with Nigeria.\n\nThe core message is clear: staying informed and safety-conscious is essential.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6fa1f400-8ed2-44cc-b4be-98226716506f.jpg",
    "timestamp": "2025-11-10T11:29:26.090Z"
  },
  {
    "slug": "special-adviser-to-the-lagos-state-governor-on-tourism-arts-culture-mr-idris-aregbe-celebrates-birthday-in-lagos-1762700254252",
    "headline": "Special Adviser to the Lagos State Governor on Tourism, Arts & Culture, Mr. Idris Aregbe Celebrates Birthday in Lagos",
    "kicker": "",
    "summary": "",
    "bodyText": "A very happy birthday to Mr. Idris Aregbe the Special Adviser to the Lagos State Governor on Tourism, Arts & Culture, Lagos State.\n\nIn attendance to his birthday celebration yesterday were Nollywood actresses, Ini Edo & Juliet Ibrahim among other dignitaries and personalities.\n\nThe Base Fm team wishes him many more fruitful years.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a43471e9-0e34-46ab-a6a4-274b2d7f39d6.jpeg",
    "timestamp": "2025-11-09T14:57:34.252Z"
  },
  {
    "slug": "anambra-election-soludo-wins-own-polling-unit-1762633436918",
    "headline": "Anambra Election: Soludo Wins Own Polling Unit",
    "kicker": "",
    "summary": "",
    "bodyText": "Despite BVAS malfunction Governor Charles Soludo of APGA has won his polling unit in the Anambra governorship election, polling 417 votes at Ofiyi Square, Isuofia Ward, Aguata LGA. APC's Nicholas Ukachukwu got 4 votes, and ACCORD's candidate scored 1. Out of 933 registered voters, 430 were accredited, with 422 valid votes.\nVoting was briefly disrupted by a BVAS malfunction, but Soludo's strong local showing reflects solid grassroots support as results collation continues statewide.\nSource: Punch News",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/735ea883-f49f-4ffe-9a9f-3f8a7dde5959.jpeg",
    "timestamp": "2025-11-08T20:23:56.918Z"
  },
  {
    "slug": "burna-boy-davido-ayra-starr-wizkid-make-2026-grammy-nominations-list-1762556467709",
    "headline": "Burna Boy, Davido, Ayra Starr, Wizkid make 2026 Grammy Nominations List",
    "kicker": "",
    "summary": "The 2026 Grammy nominations revealed last night, with artists, albums, and songs competing for honours at the 68th annual ceremony.",
    "bodyText": "Burna Boy received two nominations, Best African Music Performance for “Love” and Best Global Music Album for “No Sign of Weakness,” making him the highest-nominated African artist this year.\n\nOther Nigerian stars on the list include Davido, Omah Lay, Ayra Starr, and Wizkid, alongside continental heavyweights such as Angélique Kidjo (Benin), Eddy Kenzo (Uganda), Tyla (South Africa), and Youssou N’Dour (Senegal).\n\nSee the full list of nominees below:\nAlbum of the Year\nBad Bunny – DeBÍ TiRAR MáS FOToS\nJustin Bieber – Swag\nSabrina Carpenter – Man’s Best Friend\nClipse – Let God Sort Em Out\nLady Gaga – Mayhem\nKendrick Lamar – GNX\nLeon Thomas – Mutt\nTyler, the Creator – Chromakopia\n\nRecord of the Year\nBad Bunny – “DtMF”\nSabrina Carpenter – “Manchild”\nDoechii – “Anxiety”\nBillie Eilish – “Wildflower”\nLady Gaga – “Abracadabra”\nKendrick Lamar with SZA – “Luther”\nChappell Roan – “The Subway”\nRosé and Bruno Mars – “APT.”\n\nSong of the Year\nLady Gaga – “Abracadabra”\nDoechii – “Anxiety”\nRosé and Bruno Mars – “APT.”\n“DtMF” – Bad Bunny\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden” (from KPop Demon Hunters)\nKendrick Lamar with SZA – “Luther”\nSabrina Carpenter – “Manchild”\nBillie Eilish – “Wildflower”\n\nBest African Music Performance\nBurna Boy – “Love”\nDavido Featuring Omah Lay – “With You”\nEddy Kenzo & Mehran Matin – “Hope & Love”\nAyra Starr featuring Wizkid – “Gimme Dat”\nTyla – “Push 2 Start”\n\nBest Global Music Performance\nBad Bunny – “EoO”\nCiro Hurtado – “Cantando en el Camino”\nAngélique Kidjo – “Jerusalema”\nYeisy Rojas – “Inmigrante Y Que?”\nShakti – “Shrini’s Dream” (Live)\nAnoushka Shankar featuring Alam Khan & Sarathy Korwar – “Daybreak”\n\nBest New Artist\nOlivia Dean\nKATSEYE\nThe Marias\nAddison Rae\nSombr\nLeon Thomas\nAlex Warren\nLola Young\n\nSongwriter of the Year, Non-Classical\nAmy Allen\nEdgar Barrera\nJessie Jo Dillon\nTobias Jesso Jr.\nLaura Veltz\n\nProducer of the Year, Non-Classical\nDan Auerbach\nCirkut\nDijon\nBlake Mills\nSounwave\n\nBest Pop Solo Performance\nJustin Bieber – “Daisies”\nSabrina Carpenter – “Manchild”\nLady Gaga – “Disease”\nChappell Roan – “The Subway”\nLola Young – “Messy”\n\nBest Pop Vocal Album\nJustin Bieber – Swag\nSabrina Carpenter – Man’s Best Friend\nMiley Cyrus – Something Beautiful\nLady Gaga – Mayhem\nTeddy Swims – I’ve Tried Everything But Therapy (Part 2)\n\nBest Pop Duo/Group Performance\nCynthia Erivo & Ariana Grande – “Defying Gravity”\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden”\nKATSEYE – “Gabriela”\nRosé and Bruno Mars – “APT.”\nSZA with Kendrick Lamar – “30 for 30”\n\nBest Dance Pop Recording\nSelena Gomez & benny blanco – “Bluest Flame”\nLady Gaga – “Abracadabra”\nZara Larsson – “Midnight Sun”\nTate McRae – “Just Keep Watching”\nPinkPantheress – “Illegal”\n\nBest Traditional Pop Vocal Album\nLaila Biali – Wintersongs\nJennifer Hudson – The Gift Of Love\nElton John & Brandi Carlile – Who Believes In Angels?\nLady Gaga – Harlequin\nLaufey – A Matter Of Time\nBarbra Streisand – The Secret Of Life: Partners, Volume 2\n\nBest Dance Electronic Album\nFKA twigs – Eusexua\nFred again.. – Ten Days\nPinkPantheress – Fancy That\nRüfüs Du Sol – Inhale / Exhale\nSkrillex – Fuck U Skrillex You Think Ur Andy Warhol But Ur Not!! <3\n\nBest Dance/Electronic Recording\nDisclosure & Anderson .Paak – “No Cap”\nFred again.., Skepta, & PlaqueBoyMax – “Victory Lap”\nKaytranada – “Space Invader”\nSkrillex – “Voltage”\nTame Impala – “End of Summer”\n\nBest Rock Album\nDeftones – Private Music\nHaim – I Quit\nLinkin Park – From Zero\nTurnstile – Never Enough\nYungblud – Idols\n\nBest Rock Song\nNine Inch Nails – “As Alive As You Need Me To Be”\nSleep Token – “Caramel\nHayley Williams – “Glum”\nTurnstile – “Never Enough”\nYungblud – “Zombie”\n\nBest Metal Performance\nDream Theater – “Night Terror”\nGhost – “Lachryma”\nSleep Token – “Emergence”\nSpiritbox – “Soft Spine”\nTurnstile – “Birds”\n\nBest Rock Performance\nAmyl and The Sniffers – “U Should Not Be Doing That”\nLinkin Park – “The Emptiness Machine”\nTurnstile – “Never Enough”\nHayley Williams – “Mirtazapine”\nYungblud featuring Nuno Bettencourt, Frank Bello, Adam Wakeman, II – “Changes” (Live From Villa Park, Back To The Beginning)\n\nBest Alternative Music Performance\nBon Iver – “Everything Is Peaceful Love”\nThe Cure – “Alone”\nTurnstile – “Seein’ Stars”\nWet Leg – “Mangetout”\nHayley Williams – “Parachute”\n\nBest Alternative Music Album\nBon Iver – SABLE, fABLE\nThe Cure – Songs Of A Lost World\nTyler, The Creator – Don’t Tap the Glass\nWet Leg – Moisturizer\nHayley Williams – Ego Death At A Bachelorette Party\n\nBest R&B Album\nGivēon – Beloved\nCoco Jones – Why Not More?\nLedisi – The Crown\nTeyana Taylor – Escape Room\nLeon Thomas – Mutt\n\nBest R&B Song\nKehlani – “Folded”\nSummer Walker – “Heart Of A Woman”\nChris Brown Featuring Bryson Tiller – “It Depends”\nDurand Bernarr – “Overqualified”\nLeon Thomas – “Yes It Is”\n\nBest R&B Performance\nJustin Bieber – “Yukon”\nChris Brown Featuring Bryson Tiller – “It Depends”\nKehlani – “Folded”\nLeon Thomas – “Mutt” (Live From NPR’s Tiny Desk)\nSummer Walker – “Heart Of A Woman”\n\nBest Traditional R&B Performance\nDurand Bernarr – “Here We Are”\nLalah Hathaway – “Uptown”\nLedisi – “Love You Too”\nSZA – “Crybaby”\nLeon Thomas – “Vibes Don’t Lie”\n\nBest Progressive R&B Album\nDurand Bernarr – Bloom\nBilal – Adjust Brightness\nDestin Conrad – Love on Digital\nFlo – Access All Areas\nTerrace Martin & Kenyon Dixon – Come As You Are\n\nBest Spoken Word Poetry Album\nQueen Sheba – A Hurricane in Heels: healed people don’t act like that (partially recorded live @City Winery & other places)\nMarc Marcel – Black Shaman\nOmari Hardwick & Anthony Hamilton – Pages\nSaul Williams, Carlos Niño & Friends – Saul Williams meets Carlos Niño & Friends At Treepeople\nMad Skillz – Words For Days Vol. 1\n\nBest Rap Album\nClipse – Let God Sort Em Out\nGloRilla – Glorious\nJID – God Does Like Ugly\nKendrick Lamar – GNX\nTyler, The Creator – Chromakopia\n\nBest Rap Song\nDoechii – “Anxiety”\nClipse featuring John Legend and Voices of Fire – “The Birds Don’t Sing”\nTyler, The Creator featuring GloRilla, Sexyy Red, and Lil Wayne – “Sticky”\nGloRilla – “TGIF”\nKendrick Lamar featuring Lefty Gunplay – “TV Off”\n\nBest Melodic Rap Performance\nFridayy featuring Meek Mill – “Proud Of Me”\nJID featuring Ty Dolla $ign & 6Lack – “Wholeheartedly”\nKendrick Lamar with SZA – “Luther”\nTerrace Martin and Kenyon Dixon featuring Rapsody – “WeMaj”\nPartyNextDoor and Drake – “Somebody Loves Me”\n\nBest Rap Performance\nCardi B – “Outside”\nClipse featuring Kendrick Lamar and Pharrell Williams – “Chains & Whips”\nDoechii – “Anxiety”\nKendrick Lamar featuring Lefty Gunplay – “TV Off”\nTyler, The Creator featuring Teezo Touchdown – “Darling, I”\n\nBest Música Urbana Album\nBad Bunny – DeBÍ TiRAR MáS FOToS\nJ Balvin – Mixteip\nFeid – Ferxxo Vol X: Sagrado\nNicki Nicole – Naiki\nTrueno – Eub Deluxe\nYandel – Sinfónico (En Vivo)\n\nBest Música Mexicana Album (Including Tejano)\nFuerza Regida, Grupo Frontera – Mala Mía\nGrupo Frontera – Y Lo Que Viene\nPaola Jara – Sin Rodeos\nCarín León – Palabra De To’s (Seca)\nBobby Pulido and Friends Una Tuya Y Una Mía – Por La Puerta Grande (En Vivo)\n\nBest Latin Pop Album\nRauw Alejandro – Cosa Nuestra\nAndrés Cepeda – Bogotá (Deluxe)\nKarol G – Tropicoqueta\nNatalia Lafourcade – Cancionera\nAlejandro Sanz – ¿Y ahora qué?\n\nBest Latin Rock or Alternative Album\nAterciopelados – Genes Rebeldes\nAstropical – Astropical\nCa7riel and Paco Amoroso – Papota\nLos Wizzards – Algorhythm\nFito Paez – Novela\n\nBest Tropical Latin Album\nRubén Blades, Roberto Delgado & Orquesta – Fotografías\nGloria Estefan – Raíces\nGrupo Niche – Clásicos 1.0\nAlain Pérez – Bingo\nGilberto Santa Rosa – Debut y Segunda Tanda, Vol. 2\n\nBest Traditional Country Album\nCharley Crockett – Dollar A Day\nLukas Nelson – American Romance\nWillie Nelson – Oh What A Beautiful World\nMargo Price – Hard Headed Woman\nZach Top – Ain’t In It For My Health\n\nBest Contemporary Country Album\nKelsea Ballerini – Patterns\nTyler Childers – Snipe Hunter\nEric Church – Evangeline Vs. The Machine\nJelly Roll – Beautifully Broken\nMiranda Lambert – Postcards From Texas\n\nBest Country Solo Performance\nTyler Childers – “Nose On The Grindstone”\nShaboozey – “Good News”\nChris Stapleton – “Bad As I Used To Be”\nZach Top – “I Never Lie”\nLainey Wilson – “Somewhere Over Laredo”\n\nBest Country Duo/Group Performance\nMiranda Lambert and Chris Stapleton – “A Song To Sing”\nReba McEntire, Miranda Lambert, Lainey Wilson – “Trailblazer”\nMargo Price and Tyler Childers – “Love Me Like You Used To Do”\nShaboozey and Jelly Roll – “Amen”\nGeorge Strait and Chris Stapleton – “Honky Tonk Hall Of Fame”\n\nBest Country Song\nTyler Childers – “Bitin’ List”\nShaboozey – “Good News”\nZach Top – “I Never Lie”\nLainey Wilson – “Somewhere Over Laredo”\nMiranda Lambert and Chris Stapleton – “A Song To Sing”\n\nBest American Roots Performance\nJon Batiste featuring Randy Newman – “Lonely Avenue”\nI’m With Her – “Ancient Light”\nJason Isbell – “Crimson And Clay”\nAlison Krauss and Union Station – “Richmond On The James”\nMavis Staples – “Beautiful Strangers”\n\nBest Americana Performance\nSierra Hull – “Boom”\nMaggie Rose & Grace Potter – “Poison In My Well”\nMavis Staples – “Godspeed”\nMolly Tuttle – “That’s Gonna Leave A Mark”\nJesse Welles – “Horses”\n\n\nBest American Roots Song\nI’m With Her – “Ancient Light”\nJon Batiste – “Big Money”\nJason Isbell – “Foxes In The Snow”\nJesse Welles – “Middle”\nSierra Hull – “Spitfire”\n\nBest Americana Album\nJon Batiste – Big Money\nLarkin Poe – Bloom\nWillie Nelson – Last Leaf On The Tree\nMolly Tuttle – So Long Little Miss Sunshine\nJesse Welles – Middle\n\nBest Bluegrass Album\nMichael Cleveland & Jason Carter – Carter & Cleveland\nSierra Hull – A Tip Toe High Wire\nAlison Krauss & Union Station – Arcadia\nThe Steeldrivers – Outrun\nBilly Strings – Highway Prayers\n\nBest Traditional Blues Album\nBuddy Guy – Ain’t Done With The Blues\nTaj Mahal & Keb’ Mo’ – Room On The Porch\nMaria Muldaur – One Hour Mama: The Blues Of Victoria Spivey\nCharlie Musselwhite – Look Out Highway\nKenny Wayne Shepherd and Bobby Rush – Young Fashioned Ways\n\nBest Contemporary Blues Album\nJoe Bonamassa – Breakthrough\nSamantha Fish – Paper Doll\nEric Gales – A Tribute To LJK\nRobert Randolph – Preacher Kids\nSouthern Avenue – Family\n\nBest Folk Album\nRhiannon Giddens and Justin Robinson – What Did The Blackbird Say To The Crow\nPatty Griffin – Crown Of Roses\nI’m With Her – Wild And Clear And Blue\nJason Isbell – Foxes In The Snow\nJesse Welles – Under The Powerlines (April 24 – September 24)\n\nBest Gospel Performance/Song\nKirk Franklin – “Do It Again”\nTasha Cobbs Leonard, John Legend – “Church”\nJonathan McReynolds & Jamal Roberts – “Still” (Live)\nPastor Mike Jr – “Amen”\nCece Winans featuring Shirley Caesar – “Come Jesus Come”\n\nBest Global Music Album\nSiddhant Bhatia – Sounds Of Kumbha\nBurna Boy – No Sign of Weakness\nYoussou N’Dour – Eclairer le monde – Light the World\nShakti – Mind Explosion (50th Anniversary Tour Live)\nAnoushka Shankar Featuring Alam Khan & Sarathy Korwar – Chapter III: We Return To Light\nCaetano Veloso And Maria Bethânia – Caetano e Bethânia Ao Vivo\n\nBest Musical Theater Album\nBuena Vista Social Club\nDeath Becomes Her\nGypsy\nJust In Time\nMaybe Happy Ending\n\nBest Reggae Album\nLila Iké – Treasure Self Love\nVybz Kartel – Heart & Soul\nKeznamdi – Blxxd & Fyah\nMortimer – From Within\nJesse Royal – No Place Like Home\n\nBest Comedy Album\nBill Burr – Drop Dead Years\nSarah Silverman – PostMortem\nAli Wong – Single Lady\nJamie Foxx – What Had Happened Was…\nNate Bargatze –Your Friend, Nate Bargatze\n\nBest Audio Book, Narration, and Storytelling Recording\nKathy Garver – Elvis, Rocky & Me: The Carol Connors Story\nTrevor Noah – Into The Uncut Grass\nKetanji Brown Jackson – Lovely One: A Memoir\nDalai Lama – Meditations: The Reflections Of His Holiness The Dalai Lama\nFab Morvan – You Know It’s True: The Real Story Of Milli Vanilli\n\nBest Compilation Soundtrack For Visual Media\nTimothée Chalamet – A Complete Unknown\nVarious Artists – F1® The Album\nVarious Artists – KPop Demon Hunters\nVarious Artists – Sinners\nVarious Artists – Wicked\n\nBest Song Written For Visual Media\nNine Inch Nails – “As Alive As You Need Me To Be” (from Tron: Ares)\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden” (from KPop Demon Hunters)\nMiles Caton – “I Lied to You” (from Sinners)\nElton John and Brandi Carlile – “Never Too Late” (from Elton John: Never Too Late)\nJayme Lawson – “Pale, Pale Moon” (from Sinners)\nRod Wave – “Sinners” (from Sinners)\n\nBest Score Soundtrack For Visual Media (Includes Film and Television)\nJohn Powell – How to Train Your Dragon\nTheodore Shapiro – Severance: Season 2\nLudwig Göransson – Sinners\nJohn Powell & Stephen Schwartz – Wicked\nKris Bowers – The Wild Robot\n\nBest Music Video\nSade – “Young Lion”\nSabrina Carpenter – “Manchild”\nClipse – “So Be It”\nDoechii – “Anxiety”\nOK Go – “Love”\n\nBest Music Film\nDevo – Devo\nRaye – Live at the Royal Albert Hall\nDiane Warren – Relentless\nJohn Williams – Music by John Williams\nPharrell Williams – Piece by Piece\n\nBest Album Cover\nTyler, The Creator – Chromakopia (Shaun Llewellyn & Luis “Panch” Perez)\nDjo – The Crux (William Wesley II)\nBad Bunny – Debí Tirar Más Fotos (Benito Antonio Martinez Ocasio)\nPerfume Genius – Glory (Cody Critcheloe & Andrew J.S.)\nWet Leg – Moisturizer (Hester Chambers, Ellis Durand, Henry Holmes, Matt de Jong, Jamie-James Medina, Joshua Mobaraki & Rhian Teasdale)",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/7c3ff234-dfff-4d1f-8c6e-f33c3551bddb.jpg",
    "timestamp": "2025-11-07T23:01:07.709Z"
  },
  {
    "slug": "base-fm-new-music-friday-1762555566290",
    "headline": "BASE FM NEW MUSIC FRIDAY",
    "kicker": "",
    "summary": "Your latest hits out today!",
    "bodyText": "Take a look at all the new music out for the first week in November:\n\n- L.A.X Ft Olamide- Belinda\n\n- Johnny Drille - I'm Available\n\n- Poco Lee Ft Mavo, Diamond boy - Enjoyment\n\n- Shine TTW - Loco\n\n- Korede Bello - Numba 1\n\n- Alpha P x Yo x - Location\n\n- Olivetheboy- Spifomita\n\n- Raybekah - Kolobi\n\n- Smur Lee Ft Dj Maphorisa x Focalistic x Chico - Deliver\n\n- Falz - Bounce\n\n- Joshua Baraka Dr Jae5 - Still Young\n\n- Mavins Ft Don Jazzy - Waka",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3f154708-4411-426b-b2b2-9fb5723a1713.jpeg",
    "timestamp": "2025-11-07T22:46:06.290Z"
  },
  {
    "slug": "meghan-markle-returns-to-acting-1762511610514",
    "headline": "Meghan Markle Returns to Acting",
    "kicker": "",
    "summary": "The Duchess of Sussex, Meghan Markle is returning to acting  as she takes  a small role in an upcoming movie titled \"Close Personal Friends.",
    "bodyText": "The Duchess of Sussex, Meghan Markle is returning to acting  as she takes  a small role in an upcoming movie titled \"Close Personal Friends.\n\nMarkle is reportedly set to play herself in the Amazon MGM Studios project starring Brie Larson, Lily Collins, Jack Quaid and Henry Golding.\n\nShe and her husband Harry  had in   2022 partnered with Netflix to star in the 2022 docuseries \"Meghan & Harry\" .",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/50b8ba0d-90f2-4af1-9ff4-d27e7739332f.jpeg",
    "timestamp": "2025-11-07T10:33:30.514Z"
  },
  {
    "slug": "nafdac-bans-alcoholic-drinks-in-sachets-startig-december-1762511484835",
    "headline": "NAFDAC Bans Alcoholic Drinks in Sachets Startig December",
    "kicker": "",
    "summary": "The Senate has directed  the National Agency for Food and Drug Administration and Control,NAFDAC, to begin the enforcement of  the ban on the production and sale of alcoholic drinks in sachets and small plastic bottles by December 2025.",
    "bodyText": "The Senate has directed  the National Agency for Food and Drug Administration and Control,NAFDAC, to begin the enforcement of  the ban on the production and sale of alcoholic drinks in sachets and small plastic bottles by December 2025.\n\nThe directive followed a motion sponsored by Senator Asuquo Ekpenyong,Cross River South, who expressed concerns over the repeated postponement of the ban despite the rising health and social problems linked to the consumption of cheap alcohol.\n\nEkpenyong argued that NAFDAC had shifted the phase-out date several times, from 2023 to 2024 and later to 2025, due to pressure from manufacturers, waring that indefinite delays  would amount to “a betrayal of public trust and a violation of Nigeria’s commitment to global health standards.”",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2d896920-95e4-4d06-8f33-c2fe77d1f7a7.jpg",
    "timestamp": "2025-11-07T10:31:24.835Z"
  },
  {
    "slug": "nancy-pelosi-announces-she-will-not-seek-re-election-1762511353957",
    "headline": "Nancy Pelosi Announces She Will Not Seek Re-election",
    "kicker": "",
    "summary": "",
    "bodyText": "Former U.S. House Speaker Nancy Pelosi has announced she will not seek re-election at the end of her current tenure.\n\nThe 85-year-old Democrat, who made history as the first woman to serve as Speaker of the House, announced  her decision in a video to her San Francisco constituents, saying she would serve her final term “with a grateful heart.”\n\nPelosi, now in her 19th term, has represented San Francisco for 38 years and led her party in Congress for two decades.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4689222a-b4c8-4b05-a54c-dddc2012794f.jpeg",
    "timestamp": "2025-11-07T10:29:13.957Z"
  },
  {
    "slug": "president-bola-tinubu-has-sworn-in-two-newly-appointed-ministers-bernard-doro-and-kingsley-ude-1762511221650",
    "headline": "President Bola Tinubu has Sworn in Two Newly Appointed Ministers, Bernard Doro and Kingsley Ude.",
    "kicker": "",
    "summary": "",
    "bodyText": "Doro, from Plateau State, replaces former Minister of Humanitarian Affairs and Poverty Reduction, Nentawe Yilwatda, who recently assumed office as National Chairman of the All Progressives Congress (APC).\n\nWhile Ude, a Senior Advocate of Nigeria (SAN) from Enugu State, replaces  former Minister of Science, Innovation and Technology, Uche Nnaji, who resigned following certificate forgery allegations.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/fb9df721-1318-41a5-a2bd-f21bd67e96fd.jpeg",
    "timestamp": "2025-11-07T10:27:01.650Z"
  },
  {
    "slug": "lagos-fashion-week-wins-earthshot-prize-2025-to-build-a-waste-free-world-1762511112032",
    "headline": "LAGOS FASHION WEEK WINS EARTHSHOT PRIZE 2025 - TO BUILD A WASTE FREE WORLD",
    "kicker": "",
    "summary": "",
    "bodyText": "Lagos Fashion Week has been named the Winner of the 2025 Earthshot Prize to Build a Waste-Free World.\nReceiving the award, founder Omoyemi Akerele shared:\n\"By 2030, with the support of the Earthshot Prize, we will establish the first fully functional Circular Fashion Hub in Lagos. This hub will travel to other African cities powered by culture and craftsmanship transforming textile waste into new materials, new businesses, and sustainable livelihoods.\"\nShe added:\n\"We call on fashion weeks across the Global South to join us in adopting this model to champion local craftsmanship and build a regenerative fashion future that restores both people and the planet.\"",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/118cdb04-8ba5-4774-bec2-b29e8cd68b08.jpeg",
    "timestamp": "2025-11-07T10:25:12.032Z"
  },
  {
    "slug": "the-fisherman-cast-opens-up-on-the-lunchroom-from-deep-sea-dreams-to-deep-personal-grief-1762508194192",
    "headline": "The Fisherman Cast Opens Up on The Lunchroom: From Deep Sea Dreams to Deep Personal Grief",
    "kicker": "",
    "summary": "",
    "bodyText": "It was an emotional and engaging episode of The Lunchroom this week as host GrandPrince Ita sat down with the creative team behind the highly anticipated film, The Fisherman.\nFilmmaker Director Zoe was joined by actors Endurance Grand, Rick Ade Layitar, and William Lamptey for a conversation that delved into the film’s message, the emotional toll of storytelling, and the cultural bond that unites the cast, ending, of course, with the lighthearted Nigeria vs. Ghana Jollof rice debate.\nDirector Zoe clarified that despite its title, The Fisherman is not a story about the sea but about dreams, resilience, and the pursuit of purpose against all odds.\n“Forget the hook and line,” she said. “This film is pure heart, a testament to resilience, the power of a dream, and the enduring human spirit. Every character is fighting for something bigger than themselves.”\nFor Endurance Grand, taking on her first major leading role was both challenging and transformative. She described the process as “intensely demanding but deeply rewarding,” crediting the film for pushing her to discover new emotional depths as an actor.\nHer co-star Rick Ade Layitar shared a deeply personal story that touched everyone in the studio. The actor revealed he was dealing with the loss of his brother when he joined the project, and that the experience became a crucial part of his healing journey.\n“Acting in The Fisherman was therapy for me,” he admitted. “It allowed me to channel my grief into something meaningful and find peace through the character.”\nThe discussion also took a lighter turn when William Lamptey, who is visiting Nigeria for the first time, praised the country’s “overwhelming energy, infectious creativity, and incredible warmth.”\nNaturally, the conversation soon drifted to the long-standing culinary rivalry between Nigeria and Ghana. With Endurance Grand being of both Nigerian and Ghanaian heritage, she found herself hilariously stuck in the middle as her co-stars playfully defended their countries’ versions of Jollof rice.\nWrapping up the conversation, Director Zoe encouraged audiences to experience the story for themselves, describing The Fisherman as a film that will inspire viewers to never give up on their dreams.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/0eab6085-1003-4b57-aad3-ee44c6fd245c.jpeg",
    "timestamp": "2025-11-07T09:36:34.192Z"
  },
  {
    "slug": "omawumi-explores-new-sounds-with-fuji-house-fusion-on-base-sunrise-1762502043410",
    "headline": "Omawumi Explores New Sounds with Fuji-House Fusion on Base Sunrise",
    "kicker": "",
    "summary": "",
    "bodyText": "It was an exciting morning on Base Sunrise with Chacha as award-winning Nigerian singer and songwriter Omawumi joined the show to talk about her latest single, “Temperature,” and the bold, experimental direction her music is taking.\nDuring the lively conversation, Omawumi revealed that “Temperature” is a daring blend of Fuji and House music — a combination rarely heard in the Nigerian soundscape.\nAccording to the singer, the inspiration for the song came from a fan who challenged her to step completely outside her comfort zone and experiment with something unexpected.\n“The creative process was genuinely refreshing and unpredictable,” Omawumi shared. “It felt like I was back in the lab  taking elements I love and seeing how they could fight, dance, and finally blend. The result is something that respects our roots but is impossible to sit still to.”\nThe track, she explained, merges the layered percussion of traditional Fuji music with the vibrant, rhythmic pulse of House creating a sound that’s as energetic as it is culturally grounded.\nBeyond the music, Omawumi used her time on Base FM to speak passionately about unity among female artists in the Nigerian music industry.\n“Growth in this industry, especially for women, depends on us,” she said. “We need to intentionally uplift one another — share knowledge, share stages, and share the spotlight. That genuine support is what drives collective success.”\nWrapping up the conversation, Omawumi teased that “Temperature” marks the beginning of an exciting new chapter in her career. She confirmed that more releases are on the way in January, promising to keep exploring fresh sounds and creative risks.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/78f2452b-a146-4f46-a808-475e8a7da763.jpeg",
    "timestamp": "2025-11-07T07:54:03.410Z"
  },
  {
    "slug": "journalism-under-siege-base-sunrise-marks-international-day-to-end-impunity-for-crimes-against-journalists-1762456125151",
    "headline": "Journalism Under Siege: Base Sunrise Marks International Day to End Impunity for Crimes Against Journalists",
    "kicker": "",
    "summary": "On Base Sunrise with Chacha, veteran journalist Segun James joined the conversation to reflect on the harsh realities of practicing journalism in Nigeria, a country where, as he put it, “the lives of journalists are not valued.”",
    "bodyText": "As the world marked the International Day to End Impunity for Crimes Against Journalists, Segun shared deeply personal experiences that shed light on the dangers, lack of protection, and emotional toll faced by those in the media profession.\nSegun emphasized that the root of the crisis lies in impunity, the consistent failure to hold perpetrators accountable for violence against journalists.\n“The major reason these attacks persist,” he noted, “is because those responsible are never investigated or punished.”\nBoth international and local media watchdogs have long confirmed this disturbing trend: in nearly all cases of journalist killings, harassment, or intimidation in Nigeria, justice is never served. This entrenched culture of impunity, Segun warned, emboldens aggressors and silences truth-tellers.\nBeyond the physical threats, the journalist spoke about the psychological burden of working under constant danger. He described how this climate of fear has created a “chilling effect” where journalists are forced into self-censorship to avoid detention, harm, or even death.\n“When your personal safety is at stake,” he explained, “you begin to question whether reporting the truth is worth the risk. And when that happens, the public suffers—because a less-informed public means a weaker democracy.”\nSegun James also recounted harrowing personal experiences from the field—including witnessing a colleague’s assassination while on duty and facing physical violence after publishing a story about a state governor.\n“The governor called me a ‘terrorist journalist’ just because I wrote the truth,” he recalled. “He didn’t even bother to report me to my organization because he knew the facts were correct.”\nHe went on to reveal that such confrontations have forced him to tone down his reporting and avoid certain assignments, not out of fear of exposure, but simply to stay alive.\nSegun further highlighted the economic struggles many Nigerian journalists face, stressing that poor pay and lack of insurance or institutional protection make an already risky job even more dangerous.\nHost Chacha echoed his sentiments, reminding listeners that journalism is more than a profession; it is a public service.\n“Journalism isn’t just a job,” she said. “It’s a social service that holds power accountable and keeps society informed.” Segun agreed, adding that while the tools of journalism have evolved from fax machines to laptops and mobile phones, the most urgent transformation must happen in education.\n“Not everyone sharing information online is a journalist,” he cautioned. “There’s a thin line between citizen reporting and professional journalism, and that line is fading fast. We need education and regulation to preserve the credibility of the profession.”\nAs the conversation closed, both Segun and Chacha called for stronger laws to protect journalists and hold attackers accountable. Their discussion served as a sobering reminder that without safety, fairness, and freedom for the press, democracy itself remains under threat.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2f3ff076-1331-4a11-a8f9-954ed3aa04c3.jpg",
    "timestamp": "2025-11-06T19:08:45.151Z"
  },
  {
    "slug": "14-yr-old-british-boy-who-sued-ghanaian-parents-for-sending-him-to-boarding-school-in-ghana-loses-1762445909607",
    "headline": "14-yr-old British Boy Who Sued Ghanaian Parents for Sending Him to Boarding School in Ghana, Loses",
    "kicker": "",
    "summary": "A British court has ruled that a 14-year-old boy who sued his parents after being sent to boarding school in Ghana must remain there until he completes the equivalent of his GCSEs.",
    "bodyText": "A British court has ruled that a 14-year-old boy who sued his parents after being sent to boarding school in Ghana must remain there until he completes the equivalent of his GCSEs.\n\nThe teenager, who cannot be identified for legal reasons, was taken to Ghana in March 2024 under the pretext of visiting a sick relative. However, court documents reveal his parents had planned the move over concerns about his behaviour in London, citing frequent absences from school, unexplained money, and possession of a knife. The boy denies carrying a weapon or being involved in gang activity.\n\nIn a judgment delivered on Tuesday, Mrs Justice Theis of the High Court ruled that the boy should continue his studies in Ghana, despite his wish to return to the United Kingdom. She said: “I am acutely aware that the conclusion I have reached does not accord with [his] wishes and how that will feel for him. [He] has the talent, ability and intelligence to make this work together with his family. It will be difficult but they all have the common aim for [him] to return to live with his family.”\n\nThe decision marks the latest development in a case that began when the boy, feeling “unhappy and homesick”, contacted publicly funded lawyers and filed a case against his parents in February 2025. He initially lost the case after the High Court ruled that returning to the UK would expose him to “greater harm”. However, the Court of Appeal ordered a rehearing in June after Sir Andrew McFarlane, President of the Family Division, found that the earlier ruling contained procedural confusion.\n\nThe boy, who holds both British and Ghanaian citizenship, told the court he felt “like an alien” in Ghana and described his experience as “living in hell”. He said he had struggled to make friends, did not speak Twi, and suffered from social anxiety.\n\nHis solicitor, James Netto of the International Family Law Group, said his client “welcomes” the judge’s decision to provide a “road map” for his eventual return but maintained that “his position remains unchanged: he wants to return home”. Mr Netto added that the case had been “extremely difficult on every level” and that the boy had not wanted to take legal action against his parents but had “no meaningful alternative”.\n\nThe boy’s mother told the court she still feared for her son’s safety if he were to return to the UK prematurely. “It is really hard to be away from him,” she said. “I feared and continue to fear if he were to come back now, that he could end up dead. I know he does not see it like that.”\n\nMrs Justice Theis ordered that the teenager “remain living in Ghana with the aim of setting out a road map and taking the necessary steps for [him] to return here after completing his GCSEs”, adding that his situation “will need to be reviewed nearer the time”.\n\nThe roadmap includes ongoing family therapy funded by the local authority, intended to support the boy’s eventual reintegration into life in the United Kingdom.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/020233b9-1c0d-4d28-bcd1-6af570841471.jpeg",
    "timestamp": "2025-11-06T16:18:29.607Z"
  },
  {
    "slug": "anambra-poll-obi-calls-for-peaceful-election-1762445709535",
    "headline": "Anambra Poll: Obi Calls for Peaceful Election",
    "kicker": "",
    "summary": "The presidential candidate of the Labour Party in the 2023 general elections, Mr Peter Obi, has called on Anambra residents and political candidates to ensure a peaceful and transparent electoral process in the November 8, 2025, governorship election in the state.",
    "bodyText": "Addressing journalists at his residence in Agulu, Anaocha Local Government Area of the state, on Wednesday, Obi urged the residents to turn out in mass and exercise their democratic and civil rights.\n\nThe former Anambra governor urged political actors to respect the rule of law and prioritise the state’s peace and security, stressing that politicians must pursue their interests within the confines of the law.\n\nHe said, “My interest in this Anambra 2025 governorship election is a peaceful process before, during, and after the exercise. I want a peaceful, free and fair election. This election is for Ndi-Anambra, and anyone who wins, wins for the development of the state.\n\n“All the contestants, including the incumbent governor, Prof. Chukwuma Soludo of the All Progressives Grand Alliance, Prince Nicholas Ukachukwu of the All Progressives Congress and my party’s candidate, Chief George Moughalu of the Labour Party, are my friends.\n\n“But I will vote for the candidate of my party, and I urged every other voter-card-carrying resident in Anambra State to go out and vote for the candidate of their choice.”\n\nObi, however, called on the Independent National Electoral Commission and security agencies to uphold their constitutional responsibilities by ensuring neutrality and professionalism during the electoral exercise.\n\nPunch Online had reported that the INEC had declared full readiness for the governorship election slated for Saturday, November 8, 2025, across the 5,718 wards across the state.\n\nThe Chairman of the commission, Prof. Joash Amupitan, during a stakeholders meeting in Awka, said about 24,000 ad hoc staff will be deployed, while about 540 journalists have been accredited to cover the election, adding that the commission is fully committed to the governorship poll in line with its commitment to credible and inclusive elections.\n\nHe said the Commission has been implementing a comprehensive plan of activities covering logistics, technology, training, stakeholder engagement, and security coordination, including the conduct of a mock accreditation exercise, which was conducted across selected polling units in three senatorial districts of the state on Saturday.\n\nAccording to INEC, 16 candidates from 16 political parties are contesting the governorship election to wrest power from the incumbent, Prof. Chukwuma Soludo, who is also seeking reelection under the platform of APGA.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/093a9708-0bbd-4400-9c47-1709b01781f0.webp",
    "timestamp": "2025-11-06T16:15:09.535Z"
  },
  {
    "slug": "fifa-appoints-south-african-referee-tom-abongile-1762443989733",
    "headline": "FIFA Appoints South African referee, Tom Abongile",
    "kicker": "",
    "summary": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.",
    "bodyText": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.\n\nHis compatriots Zakhele Siwela and Akhona Makalima will serve as assistant referee and VAR official, with a Beninese assessor overseeing the match. The appointment has sparked outrage in Nigeria, where officials and fans questioned FIFA’s neutrality.\n\nFIFA said the selections were made by its Referees Committee, noting South Africans’ strong experience in major continental competitions.\n\n*The chief executive of Israeli club Maccabi Tel Aviv says it is \"incredibly sad\" away fans have been banned from his side's Europa League match at Aston Villa.\n\nJack Angelides  noted that Politics should never be drawn into football.\n\nLast month, the local Safety Advisory Group - the body responsible for issuing safety certificates for matches - informed Villa that no travelling fans would be allowed to attend the fixture in Birmingham on Thursday after police raised concerns, sparking a major backlash.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e82fdb64-b9f1-42c2-af30-291eaffc0894.webp",
    "timestamp": "2025-11-06T15:46:29.733Z"
  },
  {
    "slug": "bandits-kill-pastor-abduct-20-worshippers-in-kaduna-community-1761995025934",
    "headline": "BANDITS KILL PASTOR, ABDUCT 20 WORSHIPPERS IN KADUNA COMMUNITY",
    "kicker": "BREAKING",
    "summary": "Armed bandits attacked the Farin Dutse community in Kauru Local Government Area of Kaduna State, killed Rev. Yahaya Kambasiya of the United Church of Christ in Nigeria (HEKAN), and kidnapped more than 20 worshippers. Church leaders are calling for urgent security intervention.",
    "bodyText": "Armed bandits raided the Farin Dutse community in Kauru Local Government Area of Kaduna State and killed a local pastor, Rev. Yahaya Kambasiya, during a night attack that also left more than 20 residents abducted.\n\nRev. Kambasiya was a minister with the United Church of Christ in Nigeria (HEKAN). According to witnesses, the attackers moved into the village shooting, forcing families out of their homes, and targeting members of the church community. He was shot and killed at the scene.\n\nAfter killing the pastor, the gunmen went house to house and took several people, including women and youths, before escaping with them into nearby bush areas.\n\nThe President of HEKAN, Rev. Dr. Amos Kiri, condemned the attack and described it as “an attack on a peaceful worship community.” He called the killing of Rev. Kambasiya “painful and unacceptable,” and demanded immediate action from security agencies to rescue the abducted members and stop repeated raids on Christian communities in that part of Kaduna.\n\nHe also urged authorities at both state and federal level to stop treating these incidents as routine and to treat them as an ongoing emergency affecting worship centres, pastors, and entire families.\n\nResidents of the area say this is not the first time armed groups have entered at night, taken hostages, and left without resistance. Locals say they feel abandoned and unprotected, and that kidnappings for ransom have become a way of life in rural Kaduna.\n\nAs of now, the abducted worshippers are still missing.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/89079af3-addc-4005-9625-c4353d1688e1.jpeg",
    "timestamp": "2025-11-01T11:03:45.934Z"
  },
  {
    "slug": "adekunle-gold-reveals-ongoing-battle-with-sickle-cell-disease-1761994916694",
    "headline": "ADEKUNLE GOLD REVEALS ONGOING BATTLE WITH SICKLE CELL DISEASE",
    "kicker": "HEALTH • MUSIC",
    "summary": "Nigerian singer Adekunle Gold says he is still living with sickle cell disease and still goes through painful “crises,” a condition he’s managed since he was five years old. He urged Nigerians to know their genotype before marriage so they don’t pass the disorder to their children, saying “a lot of people still don’t understand the risk",
    "bodyText": "Adekunle Gold has opened up about his ongoing battle with sickle cell disease, saying he still experiences painful health crises even as an adult.\n\nAccording to him, his first major crisis happened when he was about five years old. He said his mum had to carry him on her back to the hospital in the middle of the night while his dad wasn’t home. He’s been on medication ever since.\n\n“I still have crises,” he said. “When we talk about a crisis, it’s pain in your joints, your legs, and sometimes your stomach. It’s really crazy.” He added that while the attacks are now less frequent than when he was younger, they haven’t fully gone away. He credits better self-care and access to treatment for keeping things under control.The 38-year-old artist also addressed rumours that he did a bone marrow transplant to ‘cure’ it. He denied that and said people on the internet talk “with so much confidence about what they don’t know.”\n\nBeyond talking about his own story, Adekunle Gold used the moment to push awareness. He told Nigerians to take genotype seriously before getting married, because two people with incompatible genotypes can pass sickle cell to their child and lock that child into a lifetime of pain. “Knowing your genotype is very important,” he said. “A lot of people still don’t understand the risks.”\n\n\nHe said he wants to “make more noise” about it, not just as a celebrity moment, but so fewer kids are born into a situation where every fever could become an emergency and every joint pain might mean another night in the hospital.\n\nFor him, this is personal — not PR. He’s lived it.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/9027b890-d293-453c-accf-334652e0c617.jpeg",
    "timestamp": "2025-11-01T11:01:56.694Z"
  }
]