[
  {
    "slug": "beyond-the-red-ribbon-why-the-conversation-on-hiv-aids-still-matters-in-2025-1764673654803",
    "headline": "Beyond the Red Ribbon: Why the Conversation on HIV/AIDS Still Matters in 2025",
    "kicker": "By Grandprince Ita",
    "summary": "",
    "bodyText": "Every year, December 1st comes with its familiar symbol — a simple red ribbon pinned to chests, timelines, and billboards across the world. But beyond the colour and the campaigns, World AIDS Day remains a reminder of something far deeper: the work is not done.\n\nThe truth is this: despite the progress, HIV is not gone. According to UNAIDS, millions still live with the virus worldwide — including over a million Nigerians. But it is also true that HIV today is not what it used to be. People living with the virus, when placed on treatment, can live long, healthy, full lives. Treatment makes the virus undetectable — and undetectable means untransmittable. Science has given us hope, but society must catch up.\nAnd that’s where the real problem lies.\nWe have created so much fear around HIV that many people would rather die in silence than walk into a testing center. Young people are still having sex but pretending not to. Couples are living together without ever getting tested. Families whisper instead of support. Employers discriminate quietly. And people living with HIV — mothers, creatives, drivers, CEOs, students — are still treated as if their diagnosis defines the entirety of their identity.\nHIV is not a moral failure.\nIt is not a death sentence.\nIt is not a curse.\nIt is a medical condition — one that can be managed with treatment, responsibility, and support.\nWe must evolve past the shame-based conversations that have trapped us for decades. The new era of HIV awareness demands honesty, empathy, and education.\n\nHere’s what I believe must change:\n1. Testing must become normal.\nNot something done only when we’re scared. Not something tied to judgment. Just another part of taking care of our bodies, the same way we check our blood pressure or sugar levels.\n2. Young people need real sexual education.\nNot harsh lectures. Not abstinence-only speeches. Actual information. Tools. Guidance. Safety.\n3. People living with HIV deserve dignity.\nTheir privacy. Their opportunities. Their relationships. Their careers. Stigma kills faster than any virus, and it is time we put an end to it.\n4. Media must keep the conversation alive.\nWe cannot talk about HIV only on December 1st. The platforms we have should inform — not intimidate.\n\nWorld AIDS Day is not a memorial. It is a call to action — a reminder that we are responsible for the world we create and the communities we shape.\nSo here is my message:\nKnow your status. Protect yourself. Protect others. Show compassion. And let knowledge, not fear, guide you.\n\nBecause the fight against HIV/AIDS is not just medical — it is cultural. It is emotional. It is societal. And until we remove shame from the conversation, we cannot remove the virus from our world.\nWe owe each other truth.\nWe owe each other safety.\nWe owe each other care.\nAnd we owe ourselves the courage to keep talking — today, tomorrow, and long after the ribbons are removed.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/c19f365d-bee7-48c3-94b6-31c060034cbe.jpeg",
    "timestamp": "2025-12-02T11:07:34.803Z"
  },
  {
    "slug": "germany-set-to-return-polish-artefacts-1764607022381",
    "headline": "Germany Set to Return Polish Artefacts",
    "kicker": "",
    "summary": "",
    "bodyText": "Germany is set to return valuable artefacts looted during the Second World War to Poland, local media reported on Sunday.\n\nA meeting today to discuss Polish-German cooperation will include the “historic return of cultural goods looted during World War II.\n\nThe artefacts are said to include a sculpture of a saint’s head stolen from Malbork Castle, a royal residence in northern Poland, and documents from the Teutonic Order — a Catholic brotherhood of crusading knights active in the Middle Ages.\n\nDuring the Second World War, historical archives and works of art, were looted by Nazi Germany along with many documents.\n\nThe issue has long caused tensions between the two countries.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/f60c848d-e004-480f-b010-c6f0b1360b89.jpg",
    "timestamp": "2025-12-01T16:37:02.381Z"
  },
  {
    "slug": "indonesia-flood-death-toll-rises-1764606399324",
    "headline": "Indonesia Flood Death Toll Rises",
    "kicker": "",
    "summary": "",
    "bodyText": "The death toll in the floods that struck Indonesia last week has now climbed to more than 500, with rescue workers still battling to reach affected areas.\n\nThe floods, which were caused by a rare cyclone that had formed over the Malacca Strait, have hit three provinces and impacted some 1.4 million people, according to the government's disaster agency.\n\nAnother 500 people remain missing, while thousands more have been injured.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4d37e7b1-51f9-4cb4-91eb-88532046ccc8.webp",
    "timestamp": "2025-12-01T16:26:39.324Z"
  },
  {
    "slug": "edna-imade-rejects-nigeria-for-spain-1764606256345",
    "headline": "Edna Imade Rejects Nigeria for Spain",
    "kicker": "",
    "summary": "",
    "bodyText": "Bayern Munich loanee, of Nigerian and Moroccan Descent, Edna Imade, will no longer play for Nigeria or Morocco as she has switched allegiance to Spain.\n\nImade made a competitive debut for Spain in the first leg of the UEFA Women’s Nations League final on Friday.\n\nThe Nigeria Football Federation had tried to convince the striker to wear the colours of Nigeria.\n\nSpain coach Sonia Bermúdez handed the forward a maiden call-up for the two-legged Nations League final against Germany.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d9eeeabc-ae82-4f44-a30f-8d61f7af0c18.jpeg",
    "timestamp": "2025-12-01T16:24:16.345Z"
  },
  {
    "slug": "charlie-xcx-dave-raye-to-headline-reading-leeds-festival-1764605778353",
    "headline": "Charlie XCX, Dave & Raye to Headline Reading & Leeds Festival",
    "kicker": "",
    "summary": "",
    "bodyText": "British stars Charli XCX, Dave and Raye will headline Reading and Leeds Festival next summer.\n\nIrish rockers Fontaines DC, electronic duo Chase & Status and singer Florence + The Machine will also top the bill at both events over the August bank holiday weekend.\n\nIt is the first time in 25 years the headliners at the sister festivals are exclusively British and Irish acts, organisers say.\n\nFive-time Brit Award winner Charli XCX's appearances are her only UK festival shows currently scheduled for next year.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/477667de-563d-45aa-af3e-1d9f68641a3f.avif",
    "timestamp": "2025-12-01T16:16:18.353Z"
  },
  {
    "slug": "crude-oil-production-capped-at-1-5m-barrels-till-december-2026-1764605558596",
    "headline": "Crude Oil Production Capped at 1.5M Barrels till December 2026",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria’s crude oil production quota has been capped at 1.5 million barrels per day (bpd) until December 2026, by the Organisation of Petroleum Exporting Countries, OPEC.\n\nThis was the outcome of  the 40th OPEC and non-OPEC Ministerial Meeting held on Sunday.\n\nOPEC said eight countries within the wider OPEC+ alliance — Saudi Arabia, Russia, Iraq, the UAE, Kuwait, Kazakhstan, Algeria, and Oman — agreed to pause previously planned production increases for the first quarter of 2026, citing seasonal demand patterns.\n\nMeanwhile, Oil prices rose on Monday after OPEC+ members reaffirmed their plan to hold output steady. Brent crude futures advanced $1.01, or to $63.39 a barrel at 0501 WAT. U.S. West Texas Intermediate crude gained $1, or to $59.55.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/1cecb013-d9d9-4195-955a-c17870ea0703.jpg",
    "timestamp": "2025-12-01T16:12:38.596Z"
  },
  {
    "slug": "donald-trump-pauses-asylum-decisions-1764605111547",
    "headline": "Donald Trump Pauses Asylum Decisions",
    "kicker": "",
    "summary": "",
    "bodyText": "US President Donald Trump on Sunday announced that his administration will maintain an indefinite pause on asylum decisions \"for a long time,\" targeting nationals from 19 restricted countries including Afghanistan.\n\nThis decision follows the fatal shooting of National Guard member Sarah Beckstrom near the White House.\n\nTrump blamed Biden-era vetting failures, vowing to deport non-contributors and end federal benefits for noncitizens.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b50dcabe-998e-4c76-aebd-297be25e67cb.jpg",
    "timestamp": "2025-12-01T16:05:11.548Z"
  },
  {
    "slug": "ard-fcta-suspends-30-day-strike-1764604660941",
    "headline": " ARD-FCTA Suspends 30 Day Strike",
    "kicker": "",
    "summary": "",
    "bodyText": "The Association of Resident Doctors in the Federal Capital Territory ARD-FCTA has suspended its 30-day indefinite strike across FCT hospitals after FCT Minister Nyesom Wike approved their demands for better welfare, pay, and conditions.\n\nPresident Dr. George Ebong announced the four-week suspension on Monday, hoping for swift implementation in 14 facilities including public health departments.\n\nDoctors warned of resumption if approvals aren't met within the deadline. ",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e78fecdb-2b41-4ca1-93e3-0eaebb32934d.jpg",
    "timestamp": "2025-12-01T15:57:40.941Z"
  },
  {
    "slug": "first-lady-senator-oluremi-tinubu-urges-more-effort-to-eradicating-hiv-aids-1764604355257",
    "headline": "First Lady, Senator Oluremi Tinubu, Urges More Effort to Eradicating HIV/AIDS",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria's First Lady, Senator Oluremi Tinubu, on Monday urged renewed efforts to eradicate HIV/AIDS by 2030, marking World AIDS Day 2025 themed “Overcoming Disruptions; Transforming the AIDS Response”.\n\nIn a statement on X, she highlighted Nigeria's progress in prevention, treatment, and care, stressing every citizen deserves stigma-free access to services.\n\nTinubu called on the youth to get tested, seek treatment if positive, and on communities to show compassion against discrimination.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a0d807d1-ece9-424d-ae3f-9d6be8eda5e6.webp",
    "timestamp": "2025-12-01T15:52:35.257Z"
  },
  {
    "slug": "drugs-in-disguise-is-social-media-making-hard-drugs-too-easy-for-young-nigerians-1764598956344",
    "headline": "Drugs in Disguise: Is Social Media Making Hard Drugs Too Easy for Young Nigerians?",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "Nigeria is facing a new and worrying evolution in drug trafficking. Recent NDLEA raids in Lekki uncovered hard drugs disguised as everyday products, from Christmas cookies to teddy bears and even Vitamin C bottles. These items were being sold through WhatsApp groups, Instagram DMs, and other online channels, making dangerous substances look harmless.\n\nThis discovery raises serious concerns about youth exposure and parental awareness.\nToday’s drug dealer is no longer standing on street corners, he’s behind a screen, online, anonymous, and only a message away. Young people can now order drugs with the same ease as ordering food, while parents remain unaware of what arrives in those “innocent-looking” packages.\n\nNDLEA officers found Canadian Loud packaged like snacks, tramadol hidden inside supplement bottles, and cannabis edibles branded like imported treats. Delivery riders unknowingly transported these parcels, making detection even more difficult.\nAnd it forces new questions we can’t ignore:\n- Are social media platforms doing enough to curb illegal drug sales?\n- Should delivery companies scan suspicious packages?\n- Are parents, schools, and communities prepared for this new level of disguise?\n- Are young people being influenced by the online culture around “soft drugs”?\n\nExperts warn that many youths now see these substances as “casual,” but the truth is clear: drug misuse damages mental health, judgment, and long-term opportunities sometimes permanently.\nWe are entering a time when everyone must be more vigilant, more cautious, and more aware.\n\nDrugs no longer look dangerous. They look friendly, fun, and beautifully packaged. That is exactly why they’re so risky. Parents need to talk to their children. Communities need to be aware of unusual parcels. Schools must educate, not react. And young people must understand that “trying something once” can have lifelong consequences.\n\nA Call to Action\nThis challenge is bigger than NDLEA alone. It will take a united effort from:\n- Tech companies to monitor and block illegal accounts\n- Parents to stay involved in their children’s digital lives\n- Schools to teach drug awareness in modern terms\n- Communities to report suspicious activities\n- Government agencies to strengthen cyber regulations\n- Young people to protect themselves and their future\n- The era of nylon-wrapped substances is gone.\n\nToday’s drugs look like gifts, snacks, toys, and supplements.\nThat means awareness is now our strongest defense. We must stay alert, stay informed, and stay united because protecting our young people\nstarts with paying attention to the things that no longer look like threats.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/8d8550f4-17b2-4d08-9c9f-06059ab281fa.webp",
    "timestamp": "2025-12-01T14:22:36.344Z"
  },
  {
    "slug": "world-aids-day-2025-ending-stigma-encouraging-treatment-1764598627290",
    "headline": "World AIDS Day 2025: Ending Stigma, Encouraging Treatment",
    "kicker": "",
    "summary": "",
    "bodyText": "World AIDS Day 2025 is a reminder that while HIV is still part of our reality, it is no longer\na death sentence. With free testing, better access to Antiretroviral Therapy (ART), and\nstronger community education, more Nigerians are living healthy, fulfilling lives.\n\nYet stigma remains one of the biggest obstacles. Many people still avoid getting tested or delay treatment because they fear judgment more than the virus itself. Ending HIV stigma is now just as critical as providing medicine.\n\nHealth experts continue to stress that early testing and consistent treatment can suppress the virus, protect partners, and give individuals full control of their health. ART works, but people need to feel safe enough to use it.\nAs we mark World AIDS Day, the message is simple:\nBe informed. Get tested. Support others.\n\nWhen communities replace stigma with empathy, more people step forward for care\nand that brings us closer to a future where HIV is no longer a threat.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4b5ca3a3-635b-4788-82ed-572f8a232170.jpeg",
    "timestamp": "2025-12-01T14:17:07.290Z"
  },
  {
    "slug": "gen-z-s-corner-lagos-weekend-vibes-1764535398784",
    "headline": "GEN Z’s CORNER — Lagos Weekend Vibes",
    "kicker": "",
    "summary": "What’s Happening in Lagos This Weekend",
    "bodyText": "Lagos never runs out of enjoyment, and today we spotlighted two major stops depending on your mood:\n\n1. Lekki Phase 1 Rooftop Acoustic Lounge\nPerfect if you want soft breeze, dim lights, live music and cold drinks. That “pretend you’re not looking at somebody but you’re actually looking” kind of vibe.\n\n2. Yaba Cinema Complex\nIf you prefer AC-heavy peace, popcorn, a big screen, and two hours where your real life stays at the door — this is your best friend.\nWhether it’s soft life outside or cinema escape inside, Lagos has something for everyone this weekend.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4487252f-a3a8-4763-869e-f3677a1aa849.jpeg",
    "timestamp": "2025-11-30T20:43:18.784Z"
  },
  {
    "slug": "kelly-clarkson-s-2004-hit-since-u-been-gone-garners-1-billion-streams-on-spotify-1764534669010",
    "headline": "Kelly Clarkson's 2004 hit 'Since U  Been Gone'  Garners 1 Billion Streams on Spotify",
    "kicker": "",
    "summary": "",
    "bodyText": "The song is  her first track to exceed  one billion streams on the platform.\n\nWritten and produced by Max Martin and Dr. Luke, ‘Since U Been Gone’ was released as the second single from Clarkson’s 2004 album, ‘Breakaway’.\n\nIt’s one of Clarkson’s most famous songs, reaching Number Two on the Billboard Hot 100 chart in 2005 and winning a Grammy Award the following year for best female pop vocal performance.\n\nClarkson now the billion streams class comprising:   Alicia Keys’ ‘No One’, Arctic Monkeys’ ‘Fluorescent Adolescent’, Kate Bush’s ‘Running Up That Hill’ and Rage Against The Machine’s ‘Killing In The Name’.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/979453eb-53d7-4e0f-a8eb-3313057ceb87.jpeg",
    "timestamp": "2025-11-30T20:31:09.010Z"
  },
  {
    "slug": "president-tinubu-enlists-32-ambassador-designate-nominees-1764534422669",
    "headline": "President Tinubu Enlists 32 Ambassador-Designate Nominees",
    "kicker": "",
    "summary": "",
    "bodyText": "President Bola Tinubu has sent a list of 32 ambassador-designate nominees to the Senate for screening and confirmation for postings to diplomatic missions abroad.\n\nAccording to a statement issued by Special Adviser to the President on Information and Strategy, Bayo Onanuga, the nominees comprise 17 non-career diplomats and 15 career officers.\n\nThe President had last week forwarded a three-man ambassadorial list for confirmation.\nAmongst those on the list are:\n- Barrister Ogbonnaya Kalu (Abia)\n\n- Reno Omokri (Delta) – Former aide to ex-President Goodluck Jonathan\n\n- Prof. Mahmood Yakubu (Bauchi) – Former INEC Chairman\n\n- Erelu Bisi Angela Adebayo (Ekiti) – Former Ekiti First Lady\n\n- Ifeanyi Ugwuanyi (Enugu) – Former Governor of Enugu State",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/f69e5fd4-5cee-46b4-8ebd-a75bb8e06106.jpeg",
    "timestamp": "2025-11-30T20:27:02.669Z"
  },
  {
    "slug": "burna-boy-s-sister-clears-up-rumours-of-mothers-dismissal-1764445892793",
    "headline": "Burna Boy's Sister Clears Up Rumours of Mothers Dismissal",
    "kicker": "",
    "summary": "",
    "bodyText": "Burna Boy’s sister, Nissi Ogulu, has dismissed social media claims that the singer has sacked his mother, Bose Ogulu, from her role as his manager.\n\nThe clarification came amid  date cancellation in  his ongoing No Sign of Weakness tour in the United States as fans have continued boycotting the shows.\n\nChaftsAfrica posted an alleged Instagram Story said to have come from the 'Common Person' hitmaker, suggesting that his mother would no longer act as his manager.\n\nHowever, Nissi responded, tagging the news as fake news.\n\nBurna Boy's show slated for Friday was cancelled and December 1 has been officially scrapped.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4c728795-01a5-49b4-aede-1d7465b0eb9f.png",
    "timestamp": "2025-11-29T19:51:32.793Z"
  },
  {
    "slug": "google-pledges-3-billion-naira-to-nigeria-1764445563809",
    "headline": "Google Pledges 3 Billion Naira to Nigeria",
    "kicker": "",
    "summary": "",
    "bodyText": "Google, through its charity department, Google.org, has pledged three billion naira to Nigeria to boost  the country's digital transformation, with a focus on artificial-intelligence training and measures to make its thriving online environment safer.\n\nDirector for West Africa at Google, Olumide Balogun, who disclosed this in Lagos, said Google has been a foundational partner in Nigeria’s digital journey, and the funding is the next chapter of its commitment to scale up  Nigeria’s digital space.\n\nThe fund will be disbursed through five local organisations with significant track records in human development. These organisations include the FATE Foundation, the African Institute for Mathematical Sciences, the African Technology Forum, Junior Achievement Africa, and the CyberSafe Foundation.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3e20415d-9e20-4195-9e8b-909bbd3e9926.webp",
    "timestamp": "2025-11-29T19:46:03.809Z"
  },
  {
    "slug": "controversy-burna-boy-s-us-concert-fallout-1764445404957",
    "headline": "Controversy: Burna Boy’s US Concert Fallout",
    "kicker": "by Chichi Eliogu",
    "summary": "",
    "bodyText": "The music world was shaken when news broke that at a recent US concert, Grammy-winning artist Burna Boy asked a woman in the front row to leave simply because she was sleeping. The moment, caught on video and widely shared, ignited a heated debate about respect, showmanship and the boundaries between an artist and their audience.\n\nShortly after, Burna Boy issued an apology, acknowledging his reaction may have been harsh and expressing regret for how he handled the situation. But the initial act was soon followed by allegedly leaked footage showing him making remarks about his fans in a derogatory manner. For many, this betrayed the sincerity of his apology and reopened wounds of disappointment and mistrust.\n\nOutrage grew rapidly on social media, with long-time supporters and new followers voicing their hurt and disappointment. Many expressed that as a public figure and cultural icon, Burna Boy held a responsibility to show respect and sensitivity especially to fans who support him personally and financially. The uproar eventually led to the cancellation of the remaining dates on his American tour, a move widely interpreted as a consequence of eroded public trust and damaged reputation.\n\nFor Burna Boy, what started as a moment of frustration turned into a major public relations crisis. Concert promoters, fans and music industry watchers are now re-assessing his brand, his values, and the relationship between artist and audience. The cancellation of his tour underscores that artist actions on stage or off carry weight beyond music.\n\nThis controversy is more than an isolated incident. It is a wake-up call about accountability in the entertainment industry, the power of social media in amplifying voice, and the cost when fame and respect clash. For artists and fans alike, it prompts reflection on dignity, responsibility and the trust that binds performers to their audience.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cfb1c522-0ac4-4c27-8d31-7329cfa854bc.jpg",
    "timestamp": "2025-11-29T19:43:24.957Z"
  },
  {
    "slug": "the-base-tour-discovering-south-africa-1764445135259",
    "headline": "The Base Tour – Discovering South Africa",
    "kicker": "By Chichi Eliogu",
    "summary": "The Base Tour takes us on a journey into the vibrant and diverse land of South Africa.",
    "bodyText": "The Base Tour takes us on a journey into the vibrant and diverse land of South Africa, a country defined by stunning landscapes, rich cultural mosaic, and dynamic cities. From the dramatic slopes of Table Mountain to the golden savannahs of the Highveld, South Africa’s geography ranges from coastal beauty through lush valleys to rugged inland plateaus.\n\nSouth Africa is home to a multitude of ethnicities and languages, making it one of the most diverse nations on the continent. People of Zulu, Xhosa, Sotho, Tswana, Afrikaans, and many other backgrounds live side by side, speaking languages such as Zulu, Xhosa, Afrikaans and English. This diversity is also seen in everyday life from local markets to neighbourhood festivals, creating a tapestry of traditions and perspectives.\n\nFood in South Africa tells stories of history and cultural fusion. The smell of a braai the popular barbecue, drifts through neighbourhoods as families grill meat and mingle. Dishes such as bobotie, a spiced baked egg-topped meat dish, and chakalaka, a spicy vegetable relish, highlight a blending of African, Dutch, and Asian influences. Snacks like biltong offer a savoury taste of local culinary tradition.\n\nMajor cities bring these elements together in vibrant urban life. Cape Town enchants with its seaside beauty and cultural richness; Johannesburg pulsates as a hub of business and arts; Durban offers a warm coastal vibe; and Pretoria resonates with history and governance. Each city showcases different facets of South Africa’s identity from creative energy to political significance, from lively nightlife to calm coastal retreats.\n\nWhen we compare with Nigeria’s economy, South Africa stands out for its developed infrastructure, natural resources, and tourism potential. Yet both countries share youthful populations, cultural variety, and ambition for growth. For Nigerians, exploring South Africa whether for travel, business or cultural exchange opens doors to experiences and opportunities beyond borders, reminding us that African unity and collaboration can bring growth, understanding and shared prosperity.\n\nSouth Africa continues to show that a country’s identity is more than geography, it is shaped by people, languages, food, cities and shared stories. The Base Tour invites us to discover that richness, and to appreciate the immense value of diversity in building nations and communities.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4773419a-9d6e-441d-8fd5-66236a4f6130.jpeg",
    "timestamp": "2025-11-29T19:38:55.259Z"
  },
  {
    "slug": "the-climb-the-rise-and-fall-of-r-kelly-1764444932438",
    "headline": "The Climb – The Rise and Fall of R. Kelly",
    "kicker": "By Chichi Eliogu",
    "summary": "",
    "bodyText": "The Climb: The Rise and Fall of R. Kelly reflects one of the most dramatic descents in modern music history. At his peak, R. Kelly was celebrated as one of the greatest voices in R&B, known for his smooth vocals, chart-topping hits, and anthems that dominated radio waves and clubs alike. Albums like “12 Play,” “R.,” and “TP-2.com” cemented his reputation; his influence stretched beyond music to shaping a generation’s sound.\n\nBut behind the fame and glamour lay decades of troubling allegations. Over the years, multiple women accused him of sexual misconduct, exploitation, and abuse, accusations that ranged from inappropriate relationships to far more serious crimes. For years, the allegations hovered over his career, shadowing his success and stirring public outrage.\n\nIn 2019, the tide turned decisively when he was indicted on federal charges. The indictment marked the start of a legal reckoning that would severely damage his career and public standing. A federal court ultimately sentenced R. Kelly to 30 years in prison for racketeering, sex trafficking and related crimes. On top of that, a subsequent conviction on child pornography and child-sex abuse charges added a 20-year sentence though most of that term runs concurrently with the earlier 30-year sentence. As a result, he faces a total maximum sentence of about 31 years behind bars. \n\nToday, R. Kelly stands as a cautionary tale. What once was a meteoric climb built on talent, charisma and chart-topping success has unraveled under the weight of legal consequences, public outrage, and moral judgment. The music remains part of history, but the legacy is irrevocably tainted.\n\nThe story of R. Kelly is a reminder that when it comes to fame and artistry, ethical accountability is non-negotiable. Talent alone does not excuse exploitation. His downfall asks us to reflect on power, responsibility, and the voices of those harmed along the way.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d94152e4-5b91-4865-a295-d4b0e91261ba.jpg",
    "timestamp": "2025-11-29T19:35:32.438Z"
  },
  {
    "slug": "donald-trump-to-pardon-juan-orlando-hern-ndez-1764444159692",
    "headline": "Donald Trump to Pardon Juan Orlando Hernández",
    "kicker": "",
    "summary": "",
    "bodyText": "US President Donald Trump has said that he will pardon the former president of Honduras, Juan Orlando Hernández, who was convicted of drug trafficking charges in a US court last year.\n\nTrump said Hernández had been \"treated very harshly and unfairly\" in a social media post  on Friday.\n\nHernández was found guilty in March 2024 of conspiring to import cocaine into the US, and of possessing machine guns.\n\nHe was sentenced to 45 years in prison.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/672e5fbf-4777-49c8-a3e4-98e28e2e0717.jpeg",
    "timestamp": "2025-11-29T19:22:39.692Z"
  },
  {
    "slug": "kano-state-executive-council-calls-for-former-governors-arrest-1764444017859",
    "headline": "Kano State Executive Council Calls for Former Governors Arrest",
    "kicker": "",
    "summary": "The Kano State Executive Council has called for the immediate investigation and arrest of former governor Abdullahi Umar Ganduje for inciting and reckless comments about the security situation in the state.",
    "bodyText": "The Kano State Executive Council has called for the immediate investigation and arrest of former governor, Abdullahi Umar Ganduje,  for inciting and reckless comments about the security situation in the state.\n\nThe demand was made at the Council’s 34th Executive Meeting held  at the Government House, Kano, where members reviewed recent remarks credited to Ganduje and Deputy Senate President Barau Jibrin.\n\nGanduje and Jibrin, on the other hand, have criticized the state government's call, calling it as dangerous and unjustified.\n\nHe said, “The call for my arrest is reckless, baseless, and a clear reflection of the Kano state governor’s desperation and incompetent.”\n\nGanduje's Chief Press Secretary, Edwin Olofu, stated that the petition for his arrest was unjustified.\nGanduje claimed the administration of Governor Abba Kabir Yusuf was abdicating its obligations.\n\nHe added, “It is deeply unfortunate that rather than addressing the escalating insecurity ravaging the state, Governor Yusuf has chosen to chase shadows while searching for scapegoats to conceal his glaring failures.”\n\nHe claimed the governor lacked empathy for the impacted populations.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/786ae36f-c6c2-4244-9230-e047c943eced.jpg",
    "timestamp": "2025-11-29T19:20:17.859Z"
  },
  {
    "slug": "goodluck-jonathan-calls-for-guinea-bissau-election-results-1764443409202",
    "headline": "Goodluck Jonathan Calls for Guinea-Bissau Election Results",
    "kicker": "",
    "summary": "Former President Goodluck Jonathan has called for the immediate release of the Guinea-Bissau presidential election results",
    "bodyText": "Former President Goodluck Jonathan has called for the immediate release of the Guinea-Bissau presidential election results.\n\nJonathan, who was in Guinea-Bissau to observe the presidential election, made the call in Abuja while speaking with the media after returning from the country, noting that announcing the result would demonstrate integrity.\n\nHe described  the coup which occurred in the country before election were declared as sadder than when he conceded defeat to president Buhari in 2015.\n\nHe insisted that the African Union (AU) and ECOWAS have access to the authentic results and must publish them.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/7e451aed-cd70-42a1-a362-81010f183072.jpeg",
    "timestamp": "2025-11-29T19:10:09.202Z"
  },
  {
    "slug": "new-music-friday-1764365728809",
    "headline": "NEW MUSIC FRIDAY",
    "kicker": "",
    "summary": "Take a look at all the latest hits from some of your favourite artists in the country and around the world.",
    "bodyText": "Chike - Wetin Dey\n\nYoung Jonn - Blue Disco Album\n\nFlavour - Afroculture Album\n\nFave Ft Urban Chords - Intentions\n\nDavido Ft Mavo x Ecool x Morravey x Scott\n\nMaphuma x Iphxne Dj - Calorizzy\n\nTic Ft Mavo x Shoday - Welele\n\nZoro SwagBag - Active and Love O'Clock (Clock It)\n\nKrizbeatz - Ifeanyichukwu Album\n\nKcee - Okonkwi & Sons Unlimited Album\n\nMusa Keys Ft Drega - Akana Future\n\nKojo black Ft Lasmid - Balance\n\nShafts Wale - Who Send You",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/c6a57a78-6be1-4350-9339-add6182c566e.jpeg",
    "timestamp": "2025-11-28T21:35:28.809Z"
  },
  {
    "slug": "former-south-african-presidents-daughter-resigns-due-to-russian-ties-1764365441706",
    "headline": "Former South African Presidents Daughter Resigns Due to Russian Ties",
    "kicker": "",
    "summary": "",
    "bodyText": "A daughter of South Africa’s former president Jacob Zuma has resigned from parliament after claims she was involved in recruiting men to join Russian mercenaries in the Ukraine war.\n\nHer resignation was confirmed by the chairperson of the MK party, Nkosinathi Nhleko at a media  briefing in the coastal city of Durban.\n\nPolice last week said they were investigating allegations that Duduzile Zuma-Sambudla had lured 17 South African men to Russia “to fight in the Ukrainian war without their knowledge or consent”.\n\nThe presidency said in early November it had been asked to bring home the 17 men who were allegedly “trapped” in Donbas after being lured there “under the pretext of lucrative employment contracts”.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/46b8f264-9a82-435a-a865-c7a52076f9f0.jpg",
    "timestamp": "2025-11-28T21:30:41.706Z"
  },
  {
    "slug": "former-super-falcons-coach-calls-out-nff-1764365285875",
    "headline": "Former Super Falcons Coach Calls Out NFF",
    "kicker": "",
    "summary": "",
    "bodyText": "Former Super Falcons head coach Randy Waldrum has called out the Nigeria Football Federation’s (NFF) management for the monies received from the world football governing body, FIFA, for the team’s preparation for the 2023 Women’s World Cup in Australia and New Zealand.\n\nWaldrum alleged that the NFF received $960,000 from FIFA in October 2022 to support the Super Falcons’ preparations for the tournament.\n\nAccording to him, “I have a real close contact here in the US that is very connected with some of the board at FIFA. This person told me that in October, every country was given $960k from FIFA to prepare for the World, where is that money.\n\nThe American gaffer is now asking,  “So, all these questions I have is where is this money?’’\n\n He revealed that he found out from sources in  FIFA that if countries don’t have the money to buy business class tickets for everybody, FIFA will fund the money and buy those tickets and just deduct it from the monies you get from FIFA after the World Cup.\n\nThe Super Falcons were dumped  from the championship in the second round by England through a penalty shootout.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/c6c28bf7-b900-4332-9f36-935e8eb10c2a.jpeg",
    "timestamp": "2025-11-28T21:28:05.875Z"
  },
  {
    "slug": "olivia-dean-describes-concert-ticketing-business-as-exploitative-1764365193954",
    "headline": "Olivia Dean Describes Concert Ticketing Business as Exploitative",
    "kicker": "",
    "summary": "",
    "bodyText": "British Singer Olivia Dean has described the concert ticketing business as \"exploitative\" and rife with \"inequality\" after securing her fans a partial refund from Ticketmaster and AXS.\n\nDean’s  comments came after some resale tickets for her North American tour were listed at more than 14 times their original face value, with prices rising above $1,000 .\n\nLast week, the ‘Baby Steps’  singer wrote an open letter to ticketing companies calling the practice \"disgusting\" and \"vile\", and urged the company to \"do better\".\n\nOn Wednesday, Ticketmaster announced it would cap future resale rates for Dean's tour and was in the process of \"refunding fans for any markup they already paid to resellers on Ticketmaster\".",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/68b45d8a-d98f-4c98-a5bb-999d8eb13d2e.jpeg",
    "timestamp": "2025-11-28T21:26:33.954Z"
  },
  {
    "slug": "no-ransom-was-paid-senate-1764365072584",
    "headline": "\"No Ransom was Paid\" - Senate",
    "kicker": "",
    "summary": "",
    "bodyText": "The Nigerian Senate has said no ransom was paid  to secure the release of the recently kidnapped persons in Kebbi and Niger state.\n\nSenate spokesman, Yemi Adaramodu, disclosed this on Friday while speaking on Channels Television’s The Morning Brief.\n\nAccording to him, “From our side at the National Assembly, we believe the Federal Government did not pay any ransom to anybody,” he said on the breakfast show.\n\nHe maintained that the military engagement could have secured the release of the hostages by force or persuasion.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/54e39363-8fa9-41dd-b312-b9738536e55b.jpeg",
    "timestamp": "2025-11-28T21:24:32.584Z"
  },
  {
    "slug": "seinde-signature-shines-as-electimuss-london-marks-10th-anniversary-in-nigeria-powered-by-opay-1764343371385",
    "headline": "Seinde Signature Shines as Electimuss London Marks 10th Anniversary in Nigeria-Powered by OPay",
    "kicker": "Article by ChiChi Eliogu",
    "summary": "",
    "bodyText": "Nigeria’s luxury landscape took center stage this week as Electimuss London; one of the world’s most distinguished niche perfume houses chose Lagos as the starting point of its 10th anniversary celebration. But the true star of this historic event is Nigeria’s own Seinde Signature, the fast-rising fragrance empire led by visionary founder Olufemi Olaseinde Olusola.\n\nThe celebration is proudly powered by OPay, whose seamless payment innovation continues to elevate luxury retail experiences across the country.\nBase 101.1 FM was live at the Lagos event, with presenter Chichi Eliogu securing an exclusive interview with the man behind Nigeria’s fragrance revolution.\n\nFrom Lockdown Hobby to Luxury Empire: The Seinde Signature Story\nIn his interview with Base FM, Mr. Olaseinde shared the remarkable story behind Seinde Signature’s rise.\nA private collector with over 1,300 bottles of luxury perfumes, he admitted that he’d long kept his passion hidden.\n“As Nigerians, we’re not always encouraged to show off our hobbies especially one’s as expensive as mine,” he said.\nBut everything changed during the lockdown when he began posting videos of his collection. The response was overwhelming. People wanted to smell, explore, and experience the world he had created.\nWhat started as casual home visits soon inspired something bigger: a perfume bar at Oriental Hotel, where guests could smell-test fragrances, enjoy drinks and canapés, and immerse themselves in scent culture for a small entrance fee. \n\nThat simple idea has now grown into over twelve Seinde Signature stores across Nigeria, making the brand the nation’s leading curator of niche fragrances. Today, Mr. Olaseinde is internationally recognized and regularly invited to fragrance shows in Milan, the UK, and across Europe, solidifying his status as Africa’s fragrance ambassador.\n\nElectimuss × Seinde Signature × OPay: A Luxury Partnership\nThe 10th anniversary celebration spans three Nigerian cities; Lagos, Port Harcourt, and Abuja with Seinde Signature at the center of the festivities. The grand finale will take place at the new Seinde Signature Perfume Bar in Jabi Lake Mall, Nigeria’s first and most opulent perfume bar, redefining the fragrance retail experience.\nMeanwhile, OPay’s role as event sponsor highlights its commitment to powering premium customer experiences.\nMr. Olaseinde praised OPay for its reliability:\n“Payments must be smooth, especially at our scale. OPay ensures our customers enjoy seamless transactions every time.”\n\nCELEBRATING NIGERIAS NEW ERA OF\nFrom exclusive cocktails and anniversary gifts to immersive scent journeys, the Electimuss London celebration is more than an event. it is a declaration of Nigeria’s rising influence in the global luxury space.\nFor Seinde Signature, this moment represents the continuation of a journey that began with one man’s private passion and has grown into a national symbol of excellence.\nAnd Base 101.1 FM is proud to have witnessed and covered it, spotlighting the brilliance of Olufemi Olaseinde Olusola, the innovation of OPay, and the global recognition now anchored firmly on Nigerian soil.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e7256666-127a-4d95-8e75-cefef4483285.jpeg",
    "timestamp": "2025-11-28T15:22:51.385Z"
  },
  {
    "slug": "hospitality-is-a-calling-tribe-lagos-shamsiyah-kadir-okoro-on-service-celebration-and-lagos-detty-december-economy-1764332465324",
    "headline": "Hospitality Is a Calling: Tribe Lagos’ Shamsiyah Kadir Okoro on Service, Celebration, and Lagos’ Detty December Economy",
    "kicker": "",
    "summary": "",
    "bodyText": "As Lagos prepares for another vibrant Detty December season, the hospitality industry is once again stepping into the spotlight. For Shamsiyah Kadir Okoro, the Managing Partner at Tribe Lagos, hospitality is far more than dining and nightlife it is a calling, a career path, and a critical part of the city’s economic engine.\nSpeaking on the Base sunrise morning show, Shamsiyah explained that service roles in restaurants are often misunderstood and undervalued, despite offering some of the strongest growth pathways in the industry.\n“Serving is a service — and a career to be embraced.”\nAccording to her, hospitality should not be seen as a temporary job but as a professional field where waiters, waitresses, bartenders, and frontline staff can build long-term careers.\n“People think serving is just a job, but it’s a service that opens doors,” she said.\n“If you approach it as a career, you can rise into management, operations, events, marketing, or even run your own establishment later.”\nShe emphasized that those who excel in hospitality are the ones who take the work seriously, learning customer behaviour, developing interpersonal skills, and mastering the art of listening.\n\nLISTENING: THE HEART OF GOOD SERVICE\nFor Shamsiyah, good hospitality starts with paying attention.\nIn a city where dining competition is fierce and customers have endless options, listening becomes the most important tool.\n“Customers always tell you what they want through their words, their reactions, or their habits. When staff listen, businesses grow.”\nShe added that customer feedback, whether direct or subtle, is what shapes the best restaurants in Lagos.\n\nWHY BIRTHDAYS MATTER AND WHY TRIB3 LAGOS CELEBRATES THEM BOLDLY\nTribe Lagos has become known for its immersive birthday experiences, a partnership with Base FM that extends to on-air celebrations and giveaways.\nShamsiyah believes birthdays deserve this kind of attention.\n“Birthdays are the only celebration that is truly personal,” she said.\n“You didn’t choose anything else about your life but your birthday marks your beginning. It’s your day. It’s worth celebrating loudly.”\nFor her, celebrating people, whether through food, ambience, or personalised experiences is one of the purest forms of hospitality.\n \nLAGOS PREPARES FOR DETTY DECEMBER\nLagos’ hospitality and nightlife sector is entering its busiest period of the year. With visitors arriving from within and outside the country, restaurants and entertainment hubs become central to the city’s holiday energy.\nShamsiyah says Tribe Lagos is already preparing for the rush, the events, and the high demand that define the festive season.\n“December is our peak period. Lagos becomes electric,” she noted.\n\n“People want to dine, celebrate, go out, and enjoy the city. Hospitality and nightlife carry that season.”\n\nA CALL FOR GOVERNMENT SUPPORT\nShamsiyah stressed the need for stronger government involvement in supporting Lagos’ hospitality businesses from infrastructure to policy support and ease of operations.\n“This industry carries a large part of Lagos’ December economy. More support from the government will help businesses grow, create jobs, and give visitors a better experience of the city.”\nShe highlighted that hospitality is one of the fastest-growing employment sectors, especially for young people, and deserves recognition and investment.\n\nTHRIVING IN A DEMANDING SOCIETY\nReflecting on her own journey, Shamsiyah noted that hospitality demands resilience, creativity, and constant reinvention. She acknowledged that the field has its low moments, especially with economic pressures, but emphasised that the rewards  service, leadership, and community make the journey worthwhile.\n\nAs Lagos counts down to Detty December, her message is clear: hospitality is not merely a business, it is a service-driven profession that fuels celebration, employment, and connection.\nAnd for Tribe Lagos, the mission remains the same: serve, celebrate, and give Lagos the experiences it loves.\n ",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cbd111d1-b373-4400-a6cd-d8c3b263a72c.jpeg",
    "timestamp": "2025-11-28T12:21:05.324Z"
  },
  {
    "slug": "security-for-all-rethinking-vip-withdrawals-amid-rising-threats-1764332025777",
    "headline": "Security for All: Rethinking VIP Withdrawals Amid Rising Threats",
    "kicker": "",
    "summary": "",
    "bodyText": "Pulling Officers Back from VIPs\nNigeria is taking a fresh look at security. President Bola Tinubu recently approved the withdrawal of 11,566 police officers from VIP duties to frontline policing. The goal is simple: move officers from guarding convoys and high-profile officials to protecting everyday people and critical areas across the country.\nInspector-General of Police Kayode Egbetokun says the redeployment will improve visibility, boost response to crime, and strengthen national security. Past attempts stalled due to political pressure, but this time, the directive has full presidential backing.\n\nNumbers That Show Impact\nRecent data highlights the benefits of focusing on frontline policing:\n• Arrested 822 suspects\n• Recovered 249 firearms and nearly 21,000 rounds of ammunition\n• Rescued 232 kidnapped victims\n• Seized 38 vehicles\nWith the festive season approaching, highway patrols have been reinforced, drones are being used for surveillance, and joint operations are running along major routes and borders. The School Protection Squad remains active, keeping students safe from potential attacks.\n\n\nThe Wake-Up Call: Anambra Attack\nShortly after the withdrawals, a violent ambush hit the convoy of former Anambra governor Dr. Chris Ngige. Gunmen disguised as police and military officers killed a policeman and a woman recording the attack, while others were injured.\nSome VIPs have called for a review of the withdrawal, fearing reduced protection. But the bigger picture matters: focusing officers on frontline duties could prevent attacks before they happen, protecting far more people than just convoys.\n\nSecurity for Everyone, Not Just the Few\nHere is the core of the issue: security should not feel like a luxury. VIPs will always need protection, and rightly so. But the common man, traders, commuters, students, rural communities also deserves to feel safe. Every Nigerian has blood running through their veins, every life matters, and fear should not be a daily companion for the majority while a few are insulated behind walls and convoys.\n\nThere’s a question that cannot be ignored: if VIPs never feel the pressure of insecurity themselves, will they ever act decisively to create a system that protects everyone? Perhaps feeling the heat is necessary. When danger is real and close, it forces urgency. It pushes action. It forces policies and strategies that are practical, not just symbolic. Security measures shouldn’t just exist for appearances they need to touch the lives of the ordinary citizen.\n\nFrontline policing can make a real difference, but only if it is implemented in a way that reaches communities and people on the ground. Safety must be universal. It cannot be reserved for those with convoys, bodyguards, or political influence. Every citizen deserves to know they can go about daily life without fear, and that should be the standard, not the exception.\n\n\nThe Takeaway\nRedirecting officers from VIP protection to frontline security is a bold step toward equity in national safety. VIPs may still need protection, but the focus is finally shifting to where it matters most: ordinary Nigerians who face the brunt of insecurity every day.\nThis approach has the potential to change how security is experienced in Nigeria. It reminds leaders that safety is not optional and that all lives, not just those in convoys, deserve protection. Perhaps, in feeling the heat themselves, VIPs will push for stronger, more effective systems that ensure security is real, tangible, and universal.\n\n\nQuick Facts: VIP Withdrawals & Frontline Security\n• Officers moved from VIP duties: 11,566\n• Recent arrests nationwide: 822\n• Firearms recovered: 249\n• Rounds of ammunition recovered: 20,989\n• Kidnapped victims rescued: 232\n• Festive season measures: Highway patrols, drone surveillance, joint operations\n• School Protection Squad: Active\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cf6cf0ec-75e0-4ab6-bb52-9ec39d9f9f0e.jpeg",
    "timestamp": "2025-11-28T12:13:45.778Z"
  },
  {
    "slug": "base-digital-10-1764309760489",
    "headline": "BASE DIGITAL 10",
    "kicker": "",
    "summary": "Base Fm brings to you to top 10 hits taking the airwaves by storm and bringing the vibe to every occassion",
    "bodyText": "Digital Top 10\n\n1.Ckay Ft Mavo - Body (Danz).\n\n2. Mavo - Shakabulizzy\n\n3. ⁠Ayra Starr  Ft Rema - Who’s That Girl\n\n4.  Fola - You\n\n5. Dj Maphorisa x Dj Tunez x Wizkid Ft Mavo - Money Constant.\n\n6.  Blaqbonez  Ft Fola - Despacito\n\n7. Rema - Fun\n \n8. Omah Lay - Waist\n\n9.Odumodublvc Ft Wizkid - Big Time\n\n10. Seyi Vibez - AMA",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/0efca2f6-d1f7-492d-8ed2-6e208e9f5192.jpeg",
    "timestamp": "2025-11-28T06:02:40.489Z"
  },
  {
    "slug": "keep-your-smile-safe-why-your-teeth-aren-t-bottle-openers-1764245929750",
    "headline": "Keep Your Smile Safe – Why Your Teeth Aren’t Bottle Openers",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "Your teeth are strong, but they’re not invincible. One habit many people don’t think twice about using teeth to open bottles can cause serious damage. Even if it seems harmless, it can lead to chipped teeth, enamel damage, gum injuries, and jaw problems.\n\nWhy it’s Risky\nSome people believe opening a bottle with your teeth once in a while won’t hurt. Others think a chipped tooth is just cosmetic. But even minor damage can lead to:\n•\tPainful sensitivity\n•\tCostly dental repairs\n•\tLong-term problems if untreated\nAdd biting pens, nails, or hard objects, and the risk increases. Our teeth are meant for chewing food, not bottles or other tools.\n\n\nHow to Protect Your Teeth\nThe good news is that prevention is simple:\n•\tAlways use a bottle opener.\n•\tAvoid biting hard objects.\n•\tKeep up with regular dental check-ups.\nIf damage has already occurred, dentists can fix teeth with crowns, veneers, or bonding, but prevention is always better than repair.\n\nYour Teeth, Your Responsibility\nSmall daily habits make a big difference. Protecting your teeth isn’t just about looking good it’s about avoiding pain, preventing expensive repairs, and keeping your smile healthy for life.\nJust like staying alert helps protect your community, taking care of your teeth protects your personal wellbeing. Both require awareness, simple action, and consistency.\n\n\nTake Action Today\nEveryone can take small steps to stay safe and healthy:\n•\tUse proper tools, not teeth, for tough tasks.\n•\tAvoid habits that put teeth at risk.\n•\tSeek professional dental care when needed.\nIt’s easier to prevent problems than to fix them later. Treat your teeth well—they’ll thank you for life.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3a212af9-1cea-4e0c-a8a8-f2f69211129e.jpeg",
    "timestamp": "2025-11-27T12:18:49.751Z"
  },
  {
    "slug": "keeping-nigeria-safe-why-security-is-everyone-s-job-1764245493394",
    "headline": "Keeping Nigeria Safe – Why Security is Everyone’s Job",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "Nigeria has been facing rising security challenges lately. From attacks on schools and worship centres to kidnappings in communities, it’s clear that safety cannot be taken for granted. While the government is taking steps to respond, citizens also play a huge role in keeping our country safe.\n\n\nWhat the Government is Doing\nThe government has declared a nationwide security emergency. More police officers are being recruited, forest guards are being deployed, and states that set up local security teams are getting support. Intelligence operations are being strengthened, highways are being repaired, and Joint Task Forces have been set up in the most affected areas.\n\nThe Senate has also taken strong measures. Kidnapping is now officially classified as terrorism, carrying a mandatory death penalty, while security agencies are instructed to intensify joint operations and collaborate across state lines.\n\nThese steps send a clear message: crimes that threaten citizens will not be tolerated. But laws and orders are only part of the solution. Security starts with everyone being aware, alert, and proactive.\n\n\nNo Pardon, No Amnesty\nAmnesty programs for bandits have sparked debate, but they are not the solution. Forgiving armed criminals or giving them weapons to reintegrate into society sends the wrong message and risks more violence, not less.\n\nIn my view, bandits who commit violent crimes should not receive pardons or amnesty. True security comes from holding offenders accountable, ensuring justice for victims, and using structured rehabilitation programs only for those who genuinely reform under strict supervision. Peace cannot be achieved by ignoring responsibility or offering shortcuts.\n\n\nHow Citizens Can Help\nSecurity isn’t just the government’s responsibility. Citizens have a role to play too:\n•\tStay alert and report suspicious activities.\n•\tSupport local community safety initiatives.\n•\tEncourage accountability and proper justice for offenders.\nEven small actions like keeping an eye on your neighbourhood or sharing information about potential threats can make a big difference. Awareness and participation are key.\n\n\nWhy It Matters\nProtecting Nigeria is a shared responsibility. While government action is important, citizens are the frontline of safety. By staying informed, involved, and proactive, we can help reduce crime and make our towns, schools, and communities safer.\n\nThe goal is clear: collective effort, vigilance, and accountability, without giving pardons or amnesty, is essential to keep our nation safe.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/15e3da47-283c-46d9-b9ff-efe6262ba68f.webp",
    "timestamp": "2025-11-27T12:11:33.394Z"
  },
  {
    "slug": "arsenal-dominates-with-3-goals-to-1-against-bayern-munich-1764242604594",
    "headline": "Arsenal Dominates With 3 Goals to 1 Against Bayern Munich",
    "kicker": "",
    "summary": "",
    "bodyText": "Arsenal continued their fine run in the UEFA Champions League on Wednesday beating  Bayern Munich 3-1 to keep them at the top of the group with 15-points.\n\n\nThe Gunners took the lead in the 22nd minute when Jurien Timber headed in a Bukayo Saka corner cross.\n\n\nThe Bavarians drew level in the 32nd  minute of a Karl  strike. Noni Madueke made it two for  the North London visitors in the 69th minute  before  Gabriel Martinelli sealed the win in the 77th  minute to serve Bayern Munich their first defeat in all competitions this season.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ff021968-3d2f-4f0f-99ce-6042a20211c7.webp",
    "timestamp": "2025-11-27T11:23:24.594Z"
  },
  {
    "slug": "french-rapper-mae-s-sentenced-to-7-years-imprisonment-in-morocco-1764241920358",
    "headline": "French Rapper, Mae’s, Sentenced to 7 Years Imprisonment in Morocco",
    "kicker": "",
    "summary": "",
    "bodyText": "A Moroccan court has sentenced French rapper Maes, real name Walid Georgey, to seven years in prison for charges including forming a criminal gang and attempted kidnapping.\n\n\nMaes, once a top-streamed French rapper, was reportedly arrested in Morocco in January after fleeing the UAE and faced allegations of orchestrating a failed plot involving hitmen to harm a rival.\n\n\nHe denied all charges, with his lawyers calling the case baseless and lacking evidence.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3e0c5b86-8dae-482b-830c-2a04c81afcf6.jpeg",
    "timestamp": "2025-11-27T11:12:00.358Z"
  },
  {
    "slug": "oscar-winner-kevin-stacey-faces-sexual-assault-charges-1764241655032",
    "headline": "Oscar Winner, Kevin Stacey, Faces Sexual Assault Charges",
    "kicker": "",
    "summary": "",
    "bodyText": "American Oscar winning actor Kevin Spacey is set to face civil claims of sexual assault from three men at the High Court in London next October.\n\n\nThe men have sued the star, alleging that he assaulted them between 2000 and 2013.\n\n\nAt a hearing on Wednesday, a judge suggested a provisional trial date of 12 October 2026. The claims could be heard in a single trial, or in three consecutive trials to hear each case.\n\n\nSpacey denies all allegations of wrongdoing.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6278a3cf-e83c-470e-ac6b-259dbaac0f51.webp",
    "timestamp": "2025-11-27T11:07:35.032Z"
  },
  {
    "slug": "france-s-highest-court-upholds-sentence-against-former-president-nicolas-sarkozy-1764241349600",
    "headline": "France's Highest Court Upholds Sentence Against Former  President Nicolas Sarkozy",
    "kicker": "",
    "summary": "",
    "bodyText": "France's highest court has upheld a sentence against former French President Nicolas Sarkozy over the illegal financing of his 2012 re-election campaign.\n\n\nHe was found guilty of overspending on his campaign, then hiring a PR firm named Bygmalion to cover it up.\n\n\nSarkozy, 70, was handed the one-year sentence in 2024 of which six months were suspended, meaning they could be served by wearing an electronic tag instead of going to jail.\n\n\nHe has always denied all allegations.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/111b17d7-4115-4f8a-803d-83e9e6fd1a24.jpeg",
    "timestamp": "2025-11-27T11:02:29.600Z"
  },
  {
    "slug": "washington-dc-shooting-leaves-two-guards-injured-1764241178706",
    "headline": "Washington DC Shooting Leaves Two Guards Injured",
    "kicker": "",
    "summary": "",
    "bodyText": "Two National Guard soldiers are critically injured after being gunned down in Washington DC, less than two blocks from the White House, in what the city's mayor called a \"targeted shooting\".\n\n\nPolice said a lone suspect opened fire on two National Guard members from West Virginia on Wednesday afternoon, before being subdued by other National Guard nearby who had heard the gunfire.\n\n\nPresident Donald Trump, on Wednesday said the alleged gunman was an Afghan national who entered the US in September 2021.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/8d620cc4-f071-402b-8abb-210685d0185d.jpeg",
    "timestamp": "2025-11-27T10:59:38.706Z"
  },
  {
    "slug": "military-officers-seize-control-of-guinea-bissau-1764240343708",
    "headline": "Military Officers Seize Control of Guinea-Bissau",
    "kicker": "",
    "summary": "",
    "bodyText": "A group of military officers say they have seized control of Guinea-Bissau amid reports that the president, Umaro Sissoco Embaló, has been arrested.\n\n\nMilitary spokesperson Dinis N'Tchama said in a statement that the military had decided to \"immediately depose the president of the republic\" and suspend all government institutions.\n\n\nThe election results were expected on Thursday - both Embaló and his closest rival Fernando Dias had claimed victory.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/c6b7bb77-6dc0-4dc6-b00e-2fc177c26050.jpeg",
    "timestamp": "2025-11-27T10:45:43.708Z"
  },
  {
    "slug": "president-bola-tinubu-forwards-names-of-ambassadorial-nominees-1764239104868",
    "headline": "President Bola Tinubu Forwards names of Ambassadorial Nominees",
    "kicker": "",
    "summary": "",
    "bodyText": "President Bola Tinubu has forwarded the names of three non-career ambassadorial nominees to the Senate for confirmation.\n\n\nThe nominees are Kayode Aare (Ogun State), Aminu Dalhatu (Jigawa State), and Ayodele Oke (Oyo State).\n\n\nThe letter was read during plenary by the Senate President, Godswill Akpabio.\n\n\nThe  Senate Committee on Foreign Affairs have been directed to  review the nominations and report back to the chamber within one week.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/71a5bd74-95bc-49c2-b6b9-458617082d5c.jpeg",
    "timestamp": "2025-11-27T10:25:04.868Z"
  },
  {
    "slug": "troops-crush-bandits-rescue-kidnap-victim-in-kogi-1764180462506",
    "headline": "Troops Crush Bandits, Rescue Kidnap Victim in Kogi.",
    "kicker": "",
    "summary": "Troops of the Nigerian Army’s 12 Brigade have repelled bandits in the Oshokoshoko–Obajana area of Kogi State, killing one, rescuing a kidnapped victim, and recovering an AK-47 rifle. The Army says pursuit of the fleeing criminals is ongoing and urges residents to support security operations.",
    "bodyText": "In a statement posted on X, the army said:\n\n“Following credible information on the movement of bandits crossing the Oshokoshoko Obajana corridor with abducted persons, troops deployed at the Kabba Patrol Base working jointly with Other Hybrid Forces conducted a special ambush operation to intercept the criminals,” the statement reads.\n\n“The troops laid in wait and made contact with the armed criminals who were moving with an unconfirmed number of fighters.”\n\nThe military stated that one kidnapped victim was rescued while “one bandit was neutralised” after a gun battle.\n\n“The victim, who was found weak and distressed, was immediately evacuated to a medical facility for further medical attention,” \n\n“Further exploitation and pursuit operations are ongoing to track fleeing members of the criminal group.\n\n“The Nigerian Army remains steadfast in sustaining pressure on criminal groups and ensuring that communities across Kogi State are safe and secure.\n\n“Residents are encouraged to maintain trust in the ongoing operations and to support security agencies with useful information that can enhance prompt response and strengthen the collective fight against crime.”\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/24b91594-fd41-4060-a745-ab054c546112.jpeg",
    "timestamp": "2025-11-26T18:07:42.506Z"
  },
  {
    "slug": "oyo-apc-youths-to-makinde-get-ready-to-handover-in-2027-1764180120322",
    "headline": "Oyo APC Youths to Makinde: Get Ready to Handover in 2027.",
    "kicker": "",
    "summary": "",
    "bodyText": "Oyo APC youths say they are gearing up to reclaim the state from the PDP government, with Youth Leader John Aremu highlighting renewed party unity ahead of 2027.\n\nHe said the upcoming APC Youth Summit will roll out a youth-led plan for mobilisation, digital advocacy and community engagement to drive the party’s comeback.\n\nThe declaration was made during a press briefing at the APC Secretariat in Oke-Ado, Ibadan, where Aremu, stated that youthful party members are organizing to retake the state from the current Peoples Democratic Party (PDP) administration.\n\nAremu accused the current government of enslaving Oyo State and emphasized that APC youths are dedicated to bringing the political transformation the state demands.\n\nHe said that the ruling party should prepare for its inevitable demise, with progressive young leaders ready to take charge.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/50d1fae5-2cf7-470b-8035-ba443b4eb706.jpeg",
    "timestamp": "2025-11-26T18:02:00.322Z"
  },
  {
    "slug": "wike-orders-increased-security-deploys-joint-taskforce-across-abuja-1764179351608",
    "headline": "Wike Orders Increased Security, Deploys Joint Taskforce Across Abuja.",
    "kicker": "",
    "summary": "",
    "bodyText": "Friday's kidnapping in Niger State has been hailed as one of the deadliest mass abductions in Nigerian history. However, some officials believe the number of missing youngsters has been exaggerated.\n\nAddressing the earlier kidnapping in Kebbi State, Bayo Onanuga, the president's special adviser, said on Tuesday that all of the kidnapped schoolgirls had been found.\n\nAccording to Onanuga's statement, the attack resulted in copycat kidnappings.\n\nPresident Tinubu stated that more personnel will be deployed to \"vulnerable areas to avert further incidents of kidnapping\".",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/5da0350e-47aa-4a7e-99c3-90aec70b2d5c.jpg",
    "timestamp": "2025-11-26T17:49:11.608Z"
  },
  {
    "slug": "24-kebbi-schoolgirls-released-safely-through-peaceful-government-intervention-1764179202012",
    "headline": "24 Kebbi Schoolgirls Released Safely Through Peaceful Government Intervention.",
    "kicker": "",
    "summary": "",
    "bodyText": "A group of 24 Nigerian girls kidnapped from their boarding school more than a week ago have been released, according to President Tinubu.\n\nOn November 17, armed gunmen raided the school in Nigeria's Kebbi State, killing two staff members and abducting 25 children. One was able to flee shortly after.\n\nNigerian President Bola Tinubu applauded security forces for their \"swift response\" to the kidnapping, though the girls' release details remained unknown.\n\nAfrica's most populous country had a wave of abductions last week, with more than 250 pupils snatched from a Catholic school on Friday still missing, according to school officials.\n\nFriday's kidnapping in Niger State has been hailed as one of the deadliest mass abductions in Nigerian history. However, some officials believe the number of missing youngsters has been exaggerated.\n\nAddressing the earlier kidnapping in Kebbi State, Bayo Onanuga, the president's special adviser, said on Tuesday that all of the kidnapped schoolgirls had been found.\n\nAccording to Onanuga's statement, the attack resulted in copycat kidnappings.\n\nPresident Tinubu stated that more personnel will be deployed to \"vulnerable areas to avert further incidents of kidnapping\".",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/8a5ca3ef-c74c-446f-a4f8-e38d5eaafc4e.jpeg",
    "timestamp": "2025-11-26T17:46:42.012Z"
  },
  {
    "slug": "tinubu-orders-24-hour-aerial-surveillance-military-offensive-against-bandits-1764178133714",
    "headline": "Tinubu Orders 24-Hour Aerial Surveillance, Military Offensive Against Bandits.",
    "kicker": "",
    "summary": "",
    "bodyText": "President Tinubu has ordered 24-hour aerial surveillance and a full-scale military operation in forests across Kwara, Kebbi, and parts of Niger State to combat insurgency and banditry in the Northcentral and Northeast regions. Soldiers have been tasked with dislodging terrorists and stopping ongoing abductions and violence.\n\nThe order follows a recent surge in kidnappings and attacks in the Northcentral and Northwest regions, including the abduction of schoolgirls in Kebbi (who have since been rescued) and church worshippers and other residents in Kwara State. ",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/5b129d9a-6251-4540-84d6-10a0a11eec28.jpeg",
    "timestamp": "2025-11-26T17:28:53.714Z"
  },
  {
    "slug": "base-sunrise-with-charity-owoh-1764155523772",
    "headline": "BASE SUNRISE WITH CHARITY OWOH",
    "kicker": "",
    "summary": "",
    "bodyText": "SECURITY & LIVESTOCK REFORM TAKE CENTER STAGE AS GOVERNMENT RESPONDS TO RISING TENSIONS\nOn today’s edition of Base Sunrise, Chacha examined two major developments shaping Nigeria’s national conversation on security, agriculture, and rural stability. Both stories, though unfolding at different levels of government, highlight the same urgent concern: the country’s fragile rural landscape and the need for decisive, coordinated policy action.\n\nNiger State Assembly Raises Alarm Over Worsening Insecurity\nThe Niger State House of Assembly has issued a strong warning to the Federal Government following the abduction of students from St. Mary’s Catholic Missionary School in Papiri, Agwara Local Government Area. Lawmakers declared that the state is effectively “under siege,” citing widespread displacement, abandoned farmlands, stalled road projects, and communities living in fear.\n\nSpeaker Rt. Hon. Abdulmalik Sarkindaji painted a bleak picture of the situation, noting that more than 50 communities including his own constituency of Mariga have been emptied due to persistent attacks. Farmers have fled their lands, many now dependent on aid for survival, and economic activity has slowed drastically.\n\nThe Assembly passed a four-point resolution calling for immediate deployment of troops to known bandit routes, urgent rescue operations for abducted students, and collaboration with Niger’s representatives at the National Assembly to escalate the matter. Lawmakers warned they would suspend legislative business within two weeks if no concrete response is received.\n\nFEDERAL GOVERNMENT BANS OPEN GRAZING, LAUNCHES NATIONAL COUNCIL ON LIVESTOCK DEVELOPMENT\nIn a separate but closely connected development, the Federal Government has officially banned open grazing nationwide. The announcement was made by the Minister of Livestock Development, Alhaji Mukhtar Maiha, during the inauguration of the first National Council on Livestock Development in Yola, Adamawa State.\n\nThe minister emphasized that open grazing has contributed significantly to years of violent clashes, loss of lives, and displacement of thousands across the country. He described the ban as a necessary step toward ending the cycle of conflict between farmers and herders, while promoting ranching as the modern, safer, and more profitable alternative. Nigeria’s livestock sector is projected to generate $74 billion in the next five years, with $14 billion already realized from ongoing initiatives.\n\nAdamawa State, long recognized as a stronghold for livestock production will serve as the operational hub for the new council, which includes directors of livestock from all 36 states and the FCT. The council is tasked with modernizing and regulating the livestock sector, ensuring that states adopt uniform practices that reduce conflict and enhance productivity.\n\n\nA Bigger Picture: Security and Agriculture Are Now One Conversation\nBoth stories reflect how deeply intertwined Nigeria’s security and agricultural challenges have become.\nThe crisis in Niger State underscores the dangers faced by rural communities, where insecurity disrupts farming, education, and economic development.\n\nMeanwhile, the nationwide ban on open grazing attempts to address one of the structural drivers of rural conflict, offering a long-term pathway toward stability.\n\nThe Federal Government has clarified that the ban is not an immediate prohibition on all open grazing activities. Officials stressed that the transition to ranching will be gradual, allowing herders time to adjust and providing the necessary infrastructure to support the new system. Enforcement, the government assured, will consider the realities on the ground, ensuring a practical and phased implementation rather than abrupt disruption.\n\nTogether, these developments signal a critical moment for the nation. Whether through strengthened security responses or bold policy shifts, Nigeria is being pushed toward long-term solutions that protect communities, secure farmlands, and modernize rural life. As these policies unfold, Base Sunrise will continue to track the impact, the implementation, and the real stories of the people at the heart of these issues.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/641e6d0f-1b28-42a4-b552-2830bdf255f4.jpeg",
    "timestamp": "2025-11-26T11:12:03.772Z"
  },
  {
    "slug": "peller-s-rise-controversies-and-the-question-of-accountability-1764154854637",
    "headline": "Peller’s Rise, Controversies, and the Question of Accountability",
    "kicker": "Article by Grandprince Ita",
    "summary": "Habeeb Hamzat, better known as Peller, is one of Nigeria’s fastest-rising TikTok stars. But his ascent has been anything but smooth. From bold content to public clashes with religious leaders, Peller’s journey raises a larger question: to what extent do we “make” these internet personalities—and how much responsibility do they carry?",
    "bodyText": "WHO IS PELLER?\nPeller burst onto the scene through comedy skits and live content. Over time, he’s grown a\nsignificant following, fueled by his unapologetic personality, humor, and willingness to wade into\nsensitive topics. But as his influence grows, so does the scrutiny.\n\nCONTROVERSIES PILING UP\n1. The “Tummy” Comment Incident\nOne of Peller’s most recent viral moments occurred backstage at an Olamide concert. In a\ncasual conversation, he asked a woman if she had been pregnant before, telling her her stomach “looked big.” The woman, visibly uncomfortable, simply walked away. Social media erupted: many called the comment “uncouth” and accused Peller of body-shaming.\nThis incident hits at a delicate nerve. It wasn’t just rude — it was deeply personal, violating unspoken boundaries around a woman’s body. For public figures, such lapses carry amplified weight.\n\n2. Clash with the Clergy\nPeller’s relationship with Christianity and public faith has been contentious. In one viral video, he joined gospel singer Ebuka Songs, speaking in tongues and making prophetic declarations.\nSome religious leaders, notably Pastor Kesiena Esiri of the Remnant Christian Network, did not take it lightly. The pastor accused Peller of mocking spiritual practices and called his content Satanic.\nPeller responded emotionally, holding a Bible and quoting John 7:24, arguing that people\nshouldn’t judge him based on appearances or misconceived judgments. He also threatened to\nsue Pastor Esiri, accusing him of using Peller’s name to solicit offerings from his congregation.\n\n3. Allegations of Body-Shaming and Tribal Insults\nIn a separate incident, a woman named Nkese accused Peller of insulting her during a job\ninterview. She claimed he mocked her body and made derogatory remarks about her tribe.\nPeller defended himself: according to him, the comments were misinterpreted, and he said he\nwas joking when he referenced needing someone educated for the role.\n\nWHY WE SHOULDN'T LAUGH IT OFF\nPeller’s antics are often dismissed as “just content,” but there's more at stake:\n● Influence on Youth: With millions following him, his words don’t just entertain — they shape perceptions. When he mocks or questions personal boundaries, it normalizes that behavior for his audience.\n● Power + Responsibility: Public figures don’t operate in a vacuum. Their privilege comes with influence. When they cross lines, it’s fair to ask: are they aware of the impact?\n● Accountability Mechanisms: The digital world often lacks real consequences. There’s no HR, no moderator, no fine — but that doesn’t mean actions don’t matter. When public figures cause harm, the fallout is real — both socially and emotionally for those affected.\n\nAre We the Problem Too?\nOne of the most uncomfortable but important angles is this: did we, as viewers, “make” Peller?\nWe gave him a platform. We liked, shared, streamed. So while he’s responsible for what he says, we are also complicit in elevating his voice.\nWhen controversies arise, instead of merely canceling, maybe the conversation should include:\nHow do we demand better? What kind of creators do we want to support?\n\nA Turning Point or Just Noise?\nPeller stands at a crossroads. He’s young, influential, and clearly aware of the backlash — yet\nhe continues to push. There are opportunities for growth:\n● He could use his platform to apologize and learn, showing that even influencers can\nevolve.\n● He could engage in more thoughtful content, setting an example for how to be bold and\nrespectful.\n● Or he could dismiss the criticisms and double down, keeping the controversy machine\nrunning.\n\nEither way, his story is symptomatic of a larger moment in Nigerian digital culture — one where\ncreators are powerful, audiences are growing, and the lines between entertainment, morality,\nand accountability are increasingly blurred.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/77d993db-7f9a-49df-a6c0-1169c193b0a4.webp",
    "timestamp": "2025-11-26T11:00:54.637Z"
  },
  {
    "slug": "the-rise-of-young-nigerian-women-choosing-motherhood-outside-marriage-1764154399489",
    "headline": "The Rise of Young Nigerian Women Choosing Motherhood Outside Marriage",
    "kicker": "Article by Grandprince Ita",
    "summary": "In recent years, there has been a perceptible shift in how young Nigerian women talk about motherhood. Where it was once socially taboo to have children outside of wedlock, more women today are openly embracing the idea of becoming mothers without first tying the knot.",
    "bodyText": "In recent years, there has been a perceptible shift in how young Nigerian women talk about motherhood. Where it was once socially taboo to have children outside of wedlock, more women today are openly embracing the idea of becoming mothers without first tying the knot.\n\n\nBREAKING THE MOLD\nTraditionally in Nigeria, having children was almost always framed within marriage — a “legitimate” family often meant two married parents. But modern narratives are evolving.\nFinancial independence, shifting cultural norms, and changing personal priorities are giving more women the confidence to make non-traditional choices about family planning.\nReality TV personalities and influencers have become some of the most visible faces of this change. Their openness and willingness to speak candidly about their personal lives challenge deeply held societal beliefs.\n\nCELEBRITY VOICES LEADING THE CONVERSATION\nOne of the most talked-about voices is Mercy Eke, former Big Brother Naija winner. In a recent interview, she declared: “I’m ready to have a child outside marriage.”\nShe went on to explain that she’s worked hard, believes in her capacity to raise children independently, and wouldn’t see having a child without a father in the picture as a sign of failure.\nShe even talked about being prepared to raise up to three children on her own.\nBut the conversation isn’t limited to Mercy. Her remarks signal a broader generational rethinking\nof what “family” means. It’s not just about survival or financial support — for many, motherhood\nis now deeply tied to personal fulfillment and self-definition.\n\nFINANCIAL INDEPENDENCE + EMOYIONAL AUTONOMY\nPart of why this trend is resonating is that more women now have the financial resources to\nsupport children on their own. They’re not relying solely on a partner to build a family; they see\nthemselves as fully capable mothers. Mercy’s point is powerful: for her, the stigma around children without a father is largely tied to assumptions about instability or lack of success —assumptions she feels don’t apply to her.\n\nBut it's not just about money. There’s also a shift in emotional and social ideals. Many women now prioritize their own readiness, not just in terms of a relationship, but also in self-actualization. They ask: Why wait to have a child if you're ready emotionally, spiritually, and financially?\n\nCULTURAL TENSIONS AND CRITICISM\nOf course, not everyone is on board. In a society where traditional values still hold enormous weight, many still view motherhood outside of marriage as morally or socially problematic.\nCritics argue that this shift undermines family structures or promotes irresponsibility.\nYet, for many young women, these critiques feel outdated. They see their decision as an act of empowerment, not rebellion — a way to define life on their own terms rather than through societal expectations.\n\nTHE ROLE OF PUBLIC FIGURES\nPublic figures like Mercy help normalize these conversations. By speaking out so openly, she\nencourages others (especially young women) to consider what motherhood means for them personally, rather than deferring to cultural dictates.\nAs more women in the public eye share their stories, they help chip away at stigma. The narrative isn’t just “having a baby out of wedlock” — it’s “choosing when and how to have a baby,” and that can be a deeply personal, intentional, and liberated choice.\n\nLOOKING FORWARD\nThis trend raises important questions for Nigerian society: How do we support single mothers, both emotionally and practically? Do our social, legal, and religious institutions evolve to reflect these changing family models?\n\nUltimately, this isn’t just about celebrity bravado —it’s part of a larger cultural transformation.\nYoung Nigerian women are rethinking old paradigms, demanding autonomy over their bodies, and redefining what it means to build a family. And that could have far-reaching implications for how Nigeria understands marriage, responsibility, and parenthood in the decades to come.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e3ab0d73-26f3-4662-80ec-bbcd967ad272.webp",
    "timestamp": "2025-11-26T10:53:19.489Z"
  },
  {
    "slug": "fg-to-open-first-section-of-lagos-calabar-coastal-highway-in-december-1764068144327",
    "headline": "FG to Open First Section of Lagos–Calabar Coastal Highway in December",
    "kicker": "",
    "summary": "The Federal Government will open the first 47-kilometre section of the Lagos–Calabar coastal highway to traffic between December 12 and 17, 2025, Minister of Works David Umahi has announced.\n",
    "bodyText": "",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/68232b83-f1f0-434b-a624-1805bd712944.jpg",
    "timestamp": "2025-11-25T10:55:44.327Z"
  },
  {
    "slug": "army-destroys-seven-illegal-refineries-arrests-four-in-niger-delta-crackdown-1764068066358",
    "headline": "Army Destroys Seven Illegal Refineries, Arrests Four in Niger Delta Crackdown",
    "kicker": "",
    "summary": "",
    "bodyText": "Troops of the Nigerian Army’s 6 Division have destroyed seven illegal crude oil refining sites across Rivers, Akwa Ibom and Delta States, arresting four suspects. \n\nThe operations, conducted between 10 and 23 November 2025, led to the recovery of over 109,000 litres of stolen crude and illegally refined AGO worth more than ₦150 million. The Army says the crackdown is part of ongoing efforts to curb oil theft in the Niger Delta.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/fed79161-f2f8-4750-b089-28eb6c060242.jpeg",
    "timestamp": "2025-11-25T10:54:26.358Z"
  },
  {
    "slug": "base-sunrise-show-highlights-1764064797676",
    "headline": "BASE Sunrise – Show Highlights ",
    "kicker": "",
    "summary": "Today’s edition of BASE Sunrise delivered a rich blend of global observances, social responsibility, public safety updates, governance conversations, and international security developments. Chacha guided the audience through a thoughtful, layered morning that reflected both personal awareness and national realities.",
    "bodyText": "Morning Motivation:\nProtecting Women, Protecting Society\nChacha opened the show with a powerful reflection on the International Day for the Elimination of Violence Against Women. She spoke about how violence against women is not just a private tragedy but a societal failure that affects families, communities, and future generations.\nShe highlighted the increasing cases of domestic abuse, sexual violence, workplace intimidation, and public harassment, reminding listeners that prevention begins with everyday actions: how women are spoken to, how they are treated, and how seriously their safety concerns are taken.\nHer tone emphasized empathy, accountability, and the need for renewed commitment, especially as Nigeria moves into a busy and often chaotic December season.\n\nShopping Reminder Day: Financial Discipline Before December Rush\nStill on the theme of mindfulness, Chacha segued into Shopping Reminder Day, a light but necessary reminder as end-of-year spending peaks. She discussed how emotional buying, social pressure, and December excitements often lead to financial regret in January.\nShe encouraged listeners to move with intention, to prioritize essentials, to avoid performing for social media, and to take control of their personal budgets before the festive rush inflates prices and expectations. It was a grounding moment, tying mental discipline to financial stability.\n\nRoad Safety & Public Responsibility: The DJ Chicken Case\nChacha then moved into a major public safety conversation highlighting the ongoing outrage around TikTok creator Ademola “DJ Chicken” Abiodun, whose repeated reckless driving has triggered legal action.\nShe recapped the key incidents:\n•\tNovember 1 (Sagamu)—DJ Chicken crashed into two motorcyclists, injuring both riders, and allegedly tried to flee the scene.\n•\tNovember 23 (Lekki)—He was involved in another reckless driving incident, narrowly missing pedestrians and causing panic.\nThe Ogun State Ministry of Justice declared him a public safety threat and vowed to fast-track his prosecution. Attorney-General Oluwasina Ogungbade has directed immediate legal steps on the Sagamu case, working closely with the police to ensure a timely arraignment.\nChacha tied this into a wider December road safety reminder, emphasizing the importance of enforcing consequences, not just for influencers, but for everyone who handles a vehicle. She stressed that reckless driving remains one of the most preventable causes of injuries and deaths in Nigeria.\n\nInternational Focus: U.S.–Nigeria Joint Security Cooperation\nShifting to international affairs, Chacha examined the new security cooperation framework established between Nigeria and the United States. She explained that National Security Adviser Nuhu Ribadu led a Nigerian delegation to Washington to meet high-level U.S. officials, including Congress members, Pentagon representatives, and the State Department.\nKey commitments from the U.S. include:\n•\tEnhanced intelligence support\n•\tFaster processing of defense equipment\n•\tPotential access to excess U.S. defense articles\n•\tHumanitarian assistance for affected communities\n•\tSupport for improved early-warning systems\nNigeria, in turn, clarified domestic realities, pushing back against claims of “genocide” and emphasizing that violence in the country is multi-directional and affects all communities.\nChacha broke this down for listeners, explaining what this means in practical terms:\nStronger technical partnerships, improved security coordination, and increased responsiveness to emerging threats. She noted that these agreements reflect Nigeria’s recognition that insecurity requires both local reforms and global partnerships.\n\nWrap-Up: A Morning of Awareness, Accountability, and Action\nChacha closed the show by tying all themes together:\n•\tViolence against women remains a global and national crisis requiring collective responsibility.\n•\tFinancial discipline is essential as December approaches.\n•\tRoad safety must be taken seriously, especially with public examples like the DJ Chicken case.\n•\tGovernment responsiveness highlighted in both the Ogun prosecution and national security cooperation plays a crucial role in safeguarding citizens.\n•\tInternational partnerships, when managed well, can strengthen Nigeria’s fight against insecurity.\n\n\nToday’s BASE Sunrise offered a blend of motivation, awareness, civic education, and security updates, reminding everyone that building a safer, more conscious society starts with individual actions backed by institutional accountability.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/f4cc0459-6f62-4854-a3ce-4094489bb669.jpeg",
    "timestamp": "2025-11-25T09:59:57.676Z"
  },
  {
    "slug": "nwfl-confirms-castmog-ladies-relegation-over-registration-and-licensing-non-compliance-1764064534479",
    "headline": "NWFL Confirms Castmog Ladies’ Relegation Over Registration and Licensing Non-Compliance",
    "kicker": "",
    "summary": "",
    "bodyText": "The Nigeria Women Football League Secretariat has officially confirmed the relegation of Castmog Ladies from the 2025/2026 NWFL Premiership after the club failed to meet mandatory licensing and registration requirements for the new season.\n\nNWFL Media Director Samuel Ahmadu announced the decision on Monday, November 24, explaining that Castmog Ladies were one of three clubs earlier warned to comply, but the Abeokuta side missed the final deadline despite repeated reminders.\n\nNWFL Chief Operating Officer Modupe Shabi said the Secretariat has already begun adjusting competition logistics, stressing that protecting the integrity of the league means registration and licensing compliance is non-negotiable.\nShe added that updated fixtures and operational details will be released ahead of the season’s kickoff on Wednesday, November 26.\n\nAccording to the NWFL, all other affected clubs complied in time, leaving Castmog Ladies as the only Premiership team unable to meet the compulsory standards.\n\nWith their relegation now confirmed, the new Premiership campaign will proceed with 19 teams, and clubs scheduled to face Castmog Ladies, including Rivers Angels, will observe a bye on those matchdays.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/522f7052-3336-414d-a058-cb0caee70ff2.jpeg",
    "timestamp": "2025-11-25T09:55:34.479Z"
  },
  {
    "slug": "d-tigers-unveil-12-man-squad-for-w-cup-qualifiers-1764064459974",
    "headline": "D’Tigers unveil 12-man squad for W’Cup qualifiers",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria has named a 12-man roster for the first window of the 2027 FIBA Basketball World Cup African Qualifiers, with D’Tigers set to open their campaign on Thursday in Tunis.\n\nHead coach Abdulrahman Mohammed confirmed the squad as Nigeria prepares for Group C, where they face hosts Tunisia on Thursday, before meeting Rwanda on November 29 and Guinea on November 30.\n\nFormer Afrobasket captain Ike Nwamu leads the team, joined by guards Stan Okoye and Mike Nuga, while defensive specialist Christopher Obekpa anchors the frontcourt. The squad also features three home-based players, reflecting a blend of foreign experience and domestic talent.\n\nFull squad: Olisa Akonobi, Paul Dibal, Chingka Garba, Morris Udeze, Mike Nuga, Ike Nwamu, Christopher Obekpa, Jordan Ogundiran, Augustine Okafor, Stan Okoye, Ugo Simon and Talib Zanna.\n\nThe NBBF says the team is “locked and loaded” for the opening window as Nigeria looks to re-establish itself after recent inconsistent campaigns.\n\nThe qualifiers run from November 2025 to March 2027, with 16 Afrobasket teams competing for just five African spots at the World Cup in Doha.\n\nNigeria must finish in the top three of Group C to reach the second round, where 12 teams will be split into two pools of six. Results carry over, and only the top two in each group, plus the best third-place team, will qualify.\n\nD’Tigers are aiming for a strong start, having last appeared at the World Cup in 2019, and missing the 2023 edition co-hosted by the Philippines, Japan and Indonesia.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b0a8a9cd-059b-42a3-8dd9-c4fa7ae87060.jpeg",
    "timestamp": "2025-11-25T09:54:19.974Z"
  },
  {
    "slug": "gen-z-s-corner-recap-lagos-weekend-vibes-a-money-making-hustle-open-mic-magic-1763992321500",
    "headline": "Gen Z’s Corner (Recap): Lagos Weekend Vibes, A Money-Making Hustle & Open Mic Magic",
    "kicker": "By: QueenDivavee ",
    "summary": "",
    "bodyText": "Another vibrant Saturday unfolded on Gen Z’s Corner, as QueenDivavee, the Radio Royalty, brought Lagos a mix of laughter, weekend inspiration, trending updates, and pure Gen Z energy. Today’s show spotlighted three major segments—where to go in Lagos this weekend, a fresh side hustle that requires only your voice, and an Open Mic Hour that turned Base FM into Lagos’ loudest talent stage.\n\n⸻\nWhat’s Happening in Lagos: Where to Touch Grass This Weekend\nOne of the biggest highlights of today’s show was the weekend guide—QueenDivavee’s playful reminder that Lagosians must leave their house and breathe real air as December approaches.\n\nShe spotlighted two Lagos hotspots perfect for anyone stepping out this weekend:\n\n1️⃣ **Circa Lagos – Lekki**\nFor listeners looking for a soft-life brunch vibe, QDV recommended Circa. With clean aesthetics, warm lighting, and photo-friendly corners everywhere, she joked that “even if your life is scattered, their aesthetics will convince you you’re rich.”\n\n2️⃣ **Viva Cinema – Ikeja**\nMovie lovers got a nudge too, as QDV praised Viva Cinema’s “destiny-resetting AC” and popcorn that makes you forget your problems. A perfect escape for anyone who needs two hours of laughter, romance, or action this weekend.\n\nListeners called and texted in with their own plans—from weddings to concerts to simply taking a walk—proving once again that Lagos will always find a reason to go out.\n\n \nToday’s Hustle: Make Money With Just Your Voice\nThis week’s side hustle segment delivered one of QDV’s most creative suggestions yet: personalized voice notes & affirmation recordings.\n\nShe explained how Gen Z creators are now getting paid to record everything from:\n• birthday messages\n• soft “good morning” notes\n• sweet, encouraging affirmations\n• funny skits\n• emotional pep talks\n\nAccording to QDV, all you need is:\n• your phone,\n• your voice,\n• and small confidence.\n\nWith charges ranging from ₦1,000 to ₦5,000 per recording, this hustle gives young people a way to earn daily income with no capital required. “Some of you have sweet voices, but you’re using it to beg your ex,” she teased. “Why not monetize it?”\n\nListeners loved the idea—and some even hinted they would start that same evening.\n\n\nOpen Mic Hour: Lagos Talent Set the Airwaves on Fire\nThe standout segment of the day was the ever-entertaining Open Mic Hour, where QueenDivavee opened the station lines for singers, rappers, hype men, comedians, and spoken word artists.\n\nQDV made it clear:\n“If your shower voice is fine, bring it outside. Today, the mic is yours.”\n\nFrom unexpected rap freestyles to soulful vocals and dramatic poetry, Lagos poured talent into the phone lines. Some performances shocked, some impressed, and some had QDV laughing live on-air — but every moment added to the electric energy the show is known for.\n\nThe segment ended with the reminder that “your next fan might just be listening right now,” encouraging more young people to embrace their creativity.\n\n\nFinal Thoughts\nFrom weekend recommendations to money-making tips and a stage for raw Lagos talent, today’s Gen Z’s Corner was a full blend of vibes, culture, humor, and community. QueenDivavee wrapped the hour with warmth, reminding listeners that whether they’re going out, grinding, or chasing creative dreams, there is always room to grow, shine, and stay true to themselves.\n\nBase 101.1 FM — Your Base for the Biggest Hits and Culture.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/761019ff-057c-48c1-be8f-c8831a44ffed.png",
    "timestamp": "2025-11-24T13:52:01.500Z"
  },
  {
    "slug": "base-sunrise-highlights-1763991758990",
    "headline": "Base Sunrise Highlights",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "1. Celebrate Your Unique Talent Day:\nBase Sunrise opened the morning with a celebration of individuality and personal gifts, marking Celebrate Your Unique Talent Day. Chacha reflected on the importance of recognizing the qualities that make each person unique.\nShe emphasized that talent is not always something grand or public. it can be quiet and subtle, manifesting in small but powerful ways. Whether it’s the ability to bring calm into a chaotic space, to uplift others with words or actions, to organize effectively, to see solutions where others see problems, or simply to dream and hope bigger than one’s circumstances, every unique spark has value.\n“What makes me different is what makes me valuable,” Chacha stated, encouraging everyone to not only acknowledge their gifts but also to cultivate and share them.\nThe segment offered a moment of reflection on personal growth, creativity, and the impact of small acts of brilliance, framing the day as a reminder that every individual has a role to play in making the world richer through their distinct abilities. It was both uplifting and grounding, setting a tone of self-awareness and empowerment.\n\n2. In My Government & I, Chacha shifted to pressing national developments, analyzing their significance and connecting them to broader societal realities.\nVIP Police Escorts Withdrawn: President Bola Tinubu’s directive to withdraw police officers from VIP protection duties and redeploy them to core policing functions was discussed at length. Chacha explored how this move signals a shift toward prioritizing the safety of communities over the security of privilege. She highlighted that over the years, police resources have been stretched thin, leaving many towns and villages understaffed and vulnerable to crime. This reallocation, paired with plans to recruit 30,000 additional officers and upgrade training facilities, reflects a strategic approach to strengthening public security.\nNiger and Kwara Abduction Updates: Chacha reported the latest developments on the escape of 50 students from St. Mary’s Catholic School in Niger State and the release of 38 worshippers abducted at Christ Apostolic Church in Kwara State. She reflected on the resilience of affected communities and the importance of coordinated security efforts. \nBeyond the immediate relief, Chacha considered the wider societal implications: the persistent threats to safety, the pressure on security agencies, and the role of governance in ensuring that citizens feel protected.\nThrough these stories, Chacha wove a narrative of accountability, resilience, and the need for systemic solutions, stressing that public safety is not just a government obligation but a shared societal responsibility.\n\n3. BASE COURT:\nIn the Base Court segment, Chacha tackled the Miss Universe 2025 controversy, blending entertainment with ethical reflection.\nReports emerged that some judges pulled out of the pageant, claiming it was rigged, while allegations surfaced that certain contestants were in relationships with organizers. Chacha unpacked the implications of these claims, questioning fairness, meritocracy, and transparency. She connected this controversy to similar patterns in Nigerian reality shows, highlighting how favoritism and behind-the-scenes influences can undermine public trust and the credibility of competitions.\n\nChacha offered her perspective, considering the lessons beyond the glitz and glamour: the importance of integrity in any system, the value of merit over connections, and how public perception shapes the credibility of institutions. She challenged the audience, implicitly, to think critically about ethics, fairness, and accountability in everyday life, from workplaces to schools, competitions, and governance.\nThis segment bridged entertainment with societal reflection, showing that even celebrity and pageantry controversies have broader lessons about honesty, trust, and fairness.\n\nREFLECTIONS FROM TODAYS SHOW\nBase Sunrise today was a thoughtful blend of self-reflection, national insight, and ethical analysis. Charity Owoh explored the power of individuality and personal talent, the impact of government decisions on everyday security, and the importance of integrity in public competitions.\nThe show’s narrative encouraged contemplation: to embrace one’s unique spark, to remain aware of societal realities, and to critically assess structures of fairness and accountability.\nFrom personal growth to national governance to international pageants, the thread was clear: values, integrity, and authenticity matter in every sphere of life.\n\n“Celebrate your spark. Question systems that affect fairness. Value your integrity. And remember what makes you different makes you valuable.”\n\nBase Sunrise reminded everyone that empowerment, awareness, and reflection are not\nabstract ideas they are daily practices that shape both individual lives and society at large.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/eb2c3222-8306-44d9-8ce7-5e407ff2af6a.jpeg",
    "timestamp": "2025-11-24T13:42:38.990Z"
  },
  {
    "slug": "all-set-for-militant-camp-rave-a-high-energy-experience-driven-by-creatives-and-designed-for-true-party-lovers-1763991354525",
    "headline": "ALL SET FOR MILITANT CAMP RAVE — A HIGH-ENERGY EXPERIENCE DRIVEN BY CREATIVES AND DESIGNED FOR TRUE PARTY LOVERS",
    "kicker": "Article by Quincy Jonze",
    "summary": "",
    "bodyText": "The excitement is reaching fever pitch as the countdown intensifies for the highly anticipated Militant Camp Rave, a fast-rising force in Nigeria’s nightlife and entertainment culture. Widely regarded as one of the most awaited events of the season, this edition promises a sensory explosion—uniting music, art, energy, and youthful dynamism in one electrifying experience.\nPositioned at the intersection of rave culture, urban entertainment, and creative expression, Militant Camp Rave has carved out its own identity. It is not just another nightlife event—it is a movement. With a powerful lineup of superstar DJs, seasoned hype acts, energetic performers, and immersive staging, the rave aims to create a universe where attendees lose themselves in rhythm, connection, spontaneity, and unapologetic fun.\n\nKING LU’S VISIT TO BASE FM & BASE CENTRAL—A SIGN OF A GROWING CREATIVE WAVE\nAhead of the event, the Militant Camp Rave gained even more momentum when King Lu, the convener of the Militant Camp brand, made a special appearance at Base FM and Base Central. His visit created palpable excitement, setting the tone for what is expected to be one of the most explosive nightlife experiences of the year.\nDuring the session, industry personality Quincy Jonze described Militant Camp Rave as “a movement built by creatives, powered by passion, and designed for cultural impact.” He emphasized that this is not a one-off party—it is a creative wave uniting DJs, hype men, event architects, media personalities, and young innovators pushing Nigeria’s entertainment scene into a more global and expressive direction.\n\nKing Lu’s presence at Base FM further amplified the energy surrounding the event, with fans and listeners getting firsthand insights into the vision, spirit, and evolution of the Militant Camp brand. His conversations, coupled with Quincy Jonze’s commentary, highlighted that this rave stands for more than entertainment—it represents a community of creatives boldly shaping the culture.\n\n\nAN IMMERSIVE EXPERIENCE BEYOND THE ORDINARY\nMilitant Camp Rave has earned a reputation for breaking conventions, and this edition promises to surpass expectations. Every element—from the curated soundscapes and stage lighting to interactive installations and themed ambiance—has been carefully designed to elevate the rave experience to new heights.\nGuests can expect:\n•\tHigh-octane DJ sets blending Afrobeats, Amapiano, EDM, and street-pop\n•\tElectrifying hype performances that keep the crowd alive\n•\tAesthetic-driven stage design and atmospheric lighting\n•\tImmersive zones for photos, interactions, and creative expression\n•\tA vibrant community of young people ready to celebrate music and culture\n\nSAFETY, FLOW & PREMIUM ENTERTAINMENT GUARANTEED\nThe organizers have also prioritized security, crowd control, and overall event flow to ensure guests enjoy a seamless night. Everything—from entry procedures to on-ground coordination—has been strategically planned to maintain both safety and excitement without compromise.\n\nA PARTY, A CREW, A MOVEMENT\nWhether you are a nightlife enthusiast or simply seeking a bold new adventure, Militant Camp Rave is shaping up to be an unmissable cultural moment. More than a party, it is a gathering of creative minds, passionate performers, and spirited attendees—all united under one electrifying experience.\nAs anticipation continues to build, one thing is clear: Militant Camp Rave is not just coming—it is about to take over.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6fa81c07-fd59-4b00-ae53-d91310cc50b1.jpeg",
    "timestamp": "2025-11-24T13:35:54.525Z"
  },
  {
    "slug": "toby-shang-spotlights-the-evolution-and-essential-role-of-hypemen-in-today-s-events-nightlife-culture-1763991139920",
    "headline": "TOBY SHANG SPOTLIGHTS THE EVOLUTION AND ESSENTIAL ROLE OF HYPEMEN IN TODAY’S EVENTS & NIGHTLIFE CULTURE",
    "kicker": "Article by Quincy Jonze",
    "summary": "",
    "bodyText": "The conversation around the backbone of modern entertainment continues to gain momentum, and at the forefront of this dialogue is acclaimed hypeman Toby Shang. Widely regarded as one of Nigeria’s most dynamic and influential hype personalities, Toby Shang is championing a critical narrative: hype men are not just performers—they are the heartbeat of the contemporary events and nightlife ecosystem.\nSpeaking with authority and passion, Shang highlighted that the role of a hypeman has evolved far beyond the traditional expectation of energizing a crowd with chants and ad-libs. In today’s entertainment landscape, a hypeman is a mood architect, a conductor of emotions, and a vital bridge between entertainers and their audience. Their presence helps sustain engagement, guide audience reactions, build excitement, and ensure that every moment on stage feels alive and connected.\nToby Shang emphasized that a skilled hypeman does not merely amplify noise—they curate experiences. They understand crowd psychology, read energy shifts, and deliver the spontaneous creativity needed to elevate performances. Whether at high-capacity concerts, nightlife events, festivals, raves, lounges, brand activations, or corporate shows, hype men have become indispensable to creating atmosphere and maintaining momentum.\n\nHe also shed light on the evolution of the Nigerian nightlife system, noting how professional hype culture has grown from an overlooked craft into a respected pillar within entertainment. With millions engaging in nightlife and event culture weekly, the demand for structured, consistent, and professional hype talent has never been higher. According to Shang, the industry is witnessing a new era—one where hype men are recognized as entertainers in their own right, complete with unique brands, styles, and followings.\nShang further stressed that investing in hype talent is not optional for event organizers—it is strategic. A competent hypeman can transform an ordinary event into a premium experience, influence crowd perception, and significantly impact the overall execution of a show. Their synergy with DJs, artistes, and event producers often determines whether guests leave energized or underwhelmed.\n\nAs the entertainment and nightlife industry becomes increasingly competitive and experience-driven, Toby Shang’s advocacy serves as a powerful reminder: hype men are not background figures or mere accessories to a show. They are cultural drivers—integral to shaping atmosphere, enhancing performances, and elevating nightlife standards across Nigeria and beyond.\n\nThrough his continuous contributions and outspoken leadership, Toby Shang is not just amplifying music—he is amplifying the conversation around respect, structure, and recognition for one of the entertainment industry’s most vital roles.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/172c5ec5-18bd-47b0-8cb6-5e16d4a5b870.jpeg",
    "timestamp": "2025-11-24T13:32:19.920Z"
  },
  {
    "slug": "dj-neptune-returns-with-greatness-iv-a-defining-sonic-statement-for-african-music-s-next-era-1763990973578",
    "headline": "DJ NEPTUNE RETURNS WITH “GREATNESS IV” — A DEFINING SONIC STATEMENT FOR AFRICAN MUSIC’S NEXT ERA",
    "kicker": "Article by Quincy Jonze",
    "summary": "",
    "bodyText": "In an era where the African music landscape continues to expand beyond borders, few figures have been as consistent, influential, and culturally unifying as DJ Neptune. With the release of Greatness IV, the fourth chapter in his celebrated “Greatness” album series, Neptune firmly re-establishes himself as one of the continent’s most formidable music curators and sonic architects.\nBuilding on years of shaping mainstream sound—both in Nigeria and across Africa—Greatness IV arrives as a meticulously assembled body of work that reflects Neptune’s deep-rooted understanding of contemporary music and his forward-looking creative instincts. The album serves as both a celebration of the present and a projection of where African sound is headed next.\n\nAt its core, Greatness IV is a multi-genre tapestry. Neptune seamlessly merges Amapiano’s pulsating log drums with Afrobeats’ smooth progressions, infuses street-pop’s gritty bounce, and layers R&B’s emotive textures with hip-hop’s structural swagger. The result is a cohesive yet adventurous project that feels expansive without losing its identity. Every track reveals Neptune’s refined ear for arrangement—his ability to blend harmonies, textures, rhythms, and voices in ways that feel both instinctive and intentional.\n\nThe album’s collaborative edge is one of its most defining strengths. DJ Neptune has always excelled at pairing the right artistes with the right soundscape, and this project extends that legacy. Featuring a carefully selected roster of established superstars and next-generation talents, Greatness IV positions itself as a meeting point for various cultures, styles, and creative energies within the modern African soundscape. From electrifying club anthems to emotion-driven mid-tempo tunes, each feature amplifies Neptune’s overarching vision: to bring people together through sound.\n\nWhat sets Greatness IV apart is its duality—it is at once commercially irresistible and artistically intentional. The production is polished without being predictable, trendy without compromising depth, and globally appealing while remaining authentically African. Neptune shows a mastery of balance, delivering an album that resonates with listeners, DJs, music critics, and cultural tastemakers alike.\nBeyond just being a compilation of songs, Greatness IV embodies the evolution of African music in real time. It reflects a matured understanding of global sound fusion and highlights Neptune’s role as a connector—someone capable of bridging cultures, breaking geographical barriers, and pushing creative boundaries.\n\nAs the album continues to dominate playlists, radio rotations, nightlife circuits, and streaming platforms, one conclusion stands tall: Greatness IV is not merely another release—it is a cultural moment. It is a reaffirmation of DJ Neptune’s enduring relevance and an audible declaration that African music is in its most dynamic era yet.\n\nWith Greatness IV, DJ Neptune has once again delivered more than an album. He has delivered a legacy piece—one built to energize dance floors, inspire artistes, and echo across the continent for years to come.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4ed3b783-b030-478f-9d36-a23b3d96a642.jpeg",
    "timestamp": "2025-11-24T13:29:33.578Z"
  },
  {
    "slug": "arsenal-defender-gabriel-sustains-thigh-injury-1763744378458",
    "headline": "Arsenal Defender, Gabriel Sustains Thigh Injury",
    "kicker": "",
    "summary": "",
    "bodyText": "Arsenal defender Gabriel will be unavailable for \"weeks\" after sustaining a thigh injury on international duty, says head coach Mikel Arteta.\n\nGabriel,27,  limped off in visible discomfort during Brazil's friendly against Senegal at Emirates Stadium last weekend and was consequently ruled out of a draw against Tunisia three days later.\n\nHe has been in fantastic form for the Gunners this season, being a key part of a defence that has conceded just five league goals so far this season as they have opened a four-point lead at the top of the table.\n\nAccording to manager Mikel Arteta, \"Gabi is going to be out for weeks,\" adding  that the defender will have another scan next Wednesday, which should give a clearer timeframe of how long he will be out for.\n\nArsenal host rivals Tottenham on Sunday (16:30pm GMT).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/911ef9cf-dd51-41ff-92c8-e9d7e03db734.webp",
    "timestamp": "2025-11-21T16:59:38.458Z"
  },
  {
    "slug": "nnamdi-kanu-sentenced-to-life-imprisonment-1763743377185",
    "headline": "Nnamdi Kanu Sentenced to Life Imprisonment ",
    "kicker": "",
    "summary": "",
    "bodyText": "The Federal High Court in Abuja on Thursday, sentenced Nnamdi Kanu, the leader of the proscribed Indigenous People of Biafra (IPOB), to life imprisonment on multiple terrorism charges.\n\nJustice James Omotosho handed Kanu life sentences on counts one, four, five, and six, choosing mercy over the death penalty.\n\nAdditionally, Kanu received 20 years in prison for count two and five years for count seven, with all sentences running concurrently.\n\nThis judgment followed Kanu’s conviction on all seven counts related to terrorism offenses, concluding a high-profile trial that has drawn significant national attention.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2f55a46f-3c32-42b6-928f-fe7844a4b179.webp",
    "timestamp": "2025-11-21T16:42:57.185Z"
  },
  {
    "slug": "trish-o-couture-marks-18-years-with-classics-across-all-seasons-showcase-1763743272366",
    "headline": "Trish O Couture Marks 18 Years with “Classics Across All Seasons” Showcase",
    "kicker": "",
    "summary": "",
    "bodyText": "Trish O Couture is set to celebrate its 18th anniversary on 14th December 2025 with a special showcase themed “Classics Across All Seasons.” The event marks nearly two decades of creativity, elegance, and craftsmanship from one of Nigeria’s leading luxury fashion brands, known for its impeccable detailing and timeless designs.\n\nAs part of the celebration, the brand will also unveil Lady Trish Diamonds, a new jewellery line featuring an exquisite collection crafted to complement the couture house’s signature aesthetic. This launch marks an exciting expansion for the Trish O brand as it steps into the world of fine luxury accessories.\n\nGuests can expect a glamorous runway evening with over 60 stunning designs debuting on the catwalk. From classic silhouettes to modern statement pieces, the showcase promises a vibrant display of the versatility and artistic excellence that have defined Trish O Couture for 18 successful years.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2dd258f4-a39e-4f32-9afa-268f97e6d17c.jpeg",
    "timestamp": "2025-11-21T16:41:12.366Z"
  },
  {
    "slug": "base-101-1-fm-base-sunrise-today-s-highlights-1763737076243",
    "headline": "BASE 101.1 FM – Base Sunrise: Today’s Highlights",
    "kicker": "",
    "summary": "",
    "bodyText": "By: Charity Owoh, Host & Writer\n\nNigeria woke up to a morning of reflection and urgent conversation on Base Sunrise today as Charity Owoh guided listeners through pressing national issues on her segment “My Government & I.” The show, themed “Nigeria at a Breaking Point: Justice, Security & the Crisis of State Protection,” merged high-profile events with broader societal discussions, inviting listeners to think critically about justice, safety, and civic responsibility.\n\n \n\nInternational Stand Up to Bullying Day\n\nThe broadcast opened on a positive yet powerful note with International Stand Up to Bullying Day. People across the globe were encouraged to wear pink to take a stand against bullying in schools, workplaces, and online.\n\nChacha emphasized that kindness isn’t always quiet, it can mean speaking up for someone being mistreated, stepping in when you see injustice, or simply being present for someone who needs support. She connected this theme to the broader societal issues discussed later, highlighting how small acts of courage and empathy by ordinary citizens an ripple out to create meaningful change in communities.\n\n \n\nKanu Sentencing & National Reactions\n\nThe program then turned to one of the most talked-about legal stories in Nigeria: Nnamdi Kanu’s life imprisonment sentence. The courtroom drama, which lasted over seven hours, included Kanu’s interruptions, removal from the courtroom, and a ruling that left many in the South-East unsettled.\n\nChacha highlighted the reactions:\n\nSouth-East leaders pushing for political solutions.\n\nLawyers describing the verdict as a “travesty of justice.”\n\nYouth and regional groups warning that the ruling could destabilize the region.\n\nThe discussion invited reflection on key questions: Does the sentence calm tensions or worsen them? Should political solutions override court judgments? And what does justice mean when a region feels targeted?\n\n \n\nSecurity Crises: Kebbi & Kwara\n\nFrom legal and political debates, the show shifted to Nigeria’s ongoing security challenges. Chacha recapped two alarming events:\n\nAbduction of 24 schoolgirls in Kebbi State\n\nPresident Bola Tinubu asked the Minister of State for Defence to relocate to Kebbi until the girls are rescued. The discussion explored why schoolchildren remain targets despite past tragedies like Chibok and Dapchi.\n\nChurch attack in Kwara State\n\nArmed bandits attacked worshippers at Christ Apostolic Church in Eruku, killing 5 and abducting 38, demanding N100 million per person. Families were receiving ransom calls, and communities remained in shock.\n\nChacha and her guest news analyst Omatseye debated why these tragedies keep recurring, how to better secure schools, churches, and communities, and whether government responses should be preventive rather than reactive.\n\n \n\nBenue Massacre Survivor Testimony\n\nA deeply emotional segment focused on Msurshima Apeh, a survivor of the Yelwata massacre in Benue State. She recounted how she helplessly watched her five children being killed in an attack that left hundreds dead and thousands displaced.\n\nChacha stressed the gravity of Apeh’s testimony before the U.S. Congress, connecting it to Nigeria being placed back on the Country of Particular Concern list. The discussion raised questions about the protection of vulnerable citizens and whether the nation is doing enough.\n\n \n\nCivil Defence Officer Killed in Ondo\n\nThe broadcast also highlighted the tragic death of a civil defence officer in Ondo State, who was fatally stabbed while trying to restrain a mentally unstable man causing public disturbance.\n\nChacha emphasized the unpredictability of violence in Nigeria from terrorism and banditry to mental health crises and attacks on security personnel. The segment sparked discussion on training, preparedness, and mental health awareness in communities.\n\n \n\nThe Big Picture: Justice, Security & Action\n\nIn the closing segment, Chacha tied all the stories together under one critical question: Is Nigeria able to protect its citizens? From court rulings to mass abductions, massacres, and attacks on security personnel, the discussion highlighted the strain on trust in government and the urgent need for tangible solutions.\n\nChacha reminded listeners that while national crises are daunting, small, intentional acts, standing against bullying, protecting the vulnerable, and participating in civic action can help rebuild safety and trust.\n\n \n\nQuote of the Day:\n\n\"Kindness isn’t quiet. Whether in schools, workplaces, or our communities, standing up for what’s right, big or small, is how we create a safer, stronger Nigeria.\" — Charity Owoh, Host",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/64cb07b9-115a-4c7d-8533-f4ed31bceb53.jpeg",
    "timestamp": "2025-11-21T14:57:56.243Z"
  },
  {
    "slug": "world-toilet-day-nigeria-loses-n455-billion-annually-due-to-poor-sanitation-1763736899910",
    "headline": "WORLD TOILET DAY: NIGERIA LOSES N455 BILLION ANNUALLY DUE TO POOR SANITATION.",
    "kicker": "",
    "summary": "",
    "bodyText": "Vice President Kashim Shettima disclosed this while speaking at the National Sanitation Conference in Abuja. Shettima emphasized sanitation’s role in health, dignity, and productivity. This comes against the backdrop of the celebration of the World.\n\n\nThe theme of this year’s celebration is ‘Sanitation in a Changing World’ as the United Nations reminds everyone that no matter what the future holds, we all need a clean toilet. Now this year’s theme also resonates the ‘SDG Goal 6: Clean Water and Sanitation’ the race to end open defecation by 2030. Its objectives emphasize providing safe and affordable drinking water and sanitation to all, enhancing water quality by minimizing pollution, significantly boosting water-use efficiency, and adopting comprehensive water resource management strategies.\n\nSo far in Nigeria, 158 Local Government Areas including Katsina and Jigawa have achieved Open Defecation Free status.\n\nThe proper use of toilets highlights the need to use it properly and observe hygiene that makes it safe for others to use it after us. Experts have linked improper use of toilet to the spread of food poisoning, diarrhoea, dysentery, cholera and urinary tract infection\n\nHygiene experts advise as the world mark the World Toilet Day that we :\n\n1. Clean the Toilet Seat\n\n2. Wash Hands Thoroughly using the toilet\n\n \n\nThen:\n\n1 Flush Properly\n\n2 Use Toilet Seat Covers\n\n3 Avoid Touching Surfaces:\n\n4 Keep the Toilet Area Clean\n\nThe World toilet awareness day started in 2001 by a Singapore based health organization and then was adopted by the UN in 2013.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6e8658bc-a3cc-4a2f-8536-f926cbd99154.jpeg",
    "timestamp": "2025-11-21T14:54:59.910Z"
  },
  {
    "slug": "base-fm-announces-media-partnership-with-mission-africa-conference-2025-1763656127790",
    "headline": "BASE FM ANNOUNCES MEDIA PARTNERSHIP WITH MISSION AFRICA CONFERENCE 2025",
    "kicker": "",
    "summary": "",
    "bodyText": "Base FM is proud to announce its media partnership with the Mission Africa Conference & WWMRA Awards 2025, taking place on 20th & 21st November 2025 at Lagos Oriental Hotel, Victoria Island, from 10:00 AM daily. \n\nThe two-day conference is a major empowerment and leadership gathering featuring keynote speeches, panel discussions, exhibitions, and the Woman With A Mission Recognition & Achievement Awards (WWMRA Awards), celebrating women creating meaningful change across Africa.\n\nThrough this media partnership, Base FM will support the event with dedicated promotions, interviews, and updates across radio and digital platforms",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6df6f9e3-d7eb-4f33-986e-a54ca47fb708.jpeg",
    "timestamp": "2025-11-20T16:28:47.790Z"
  },
  {
    "slug": "terror-in-kwara-gunmen-attack-church-in-eruku-kill-worshippers-and-abduct-others-by-grandprince-ita-1763631861376",
    "headline": "Terror in Kwara: Gunmen Attack Church in Eruku, Kill Worshippers and Abduct Others by Grandprince Ita",
    "kicker": "",
    "summary": "",
    "bodyText": "The quiet community of Eruku in Ekiti Local Government Area of Kwara State has been thrown\ninto mourning after armed attackers stormed a church during a service, killing several\nworshippers and abducting others. The assault, which occurred during a live-streamed service,\nhas sparked outrage and renewed fears about rising insecurity in Nigeria’s rural communities.\nAccording to eyewitnesses and security reports, gunmen invaded the Christ Apostolic Church, \nOke Isegun, on Sunday evening, opened fire on worshippers who were gathered for service.\n\nThe attackers shot sporadically, leaving chaos and panic as congregants scrambled for safety.\nIn the aftermath, at least three people were confirmed dead, while the pastor and several\nMembers of the congregation were allegedly taken away.\n\nA Community Shaken:\nThe attack has left Eruku residents traumatised, with many describing the incident as the most\nbrutal assault the town has ever witnessed. The fact that the attack was captured live on camera has added to the shock, with graphic footage circulating across social media showing the horrifying moment gunmen entered the church.\n\nFamilies of abducted victims remain distressed, waiting for updates as authorities intensify\nsearch operations. Local vigilantes, hunters and security operatives have reportedly been\ndeployed to comb nearby forests in pursuit of the perpetrators.\n\nGovernment and Community Response:\nSecurity agencies in Kwara State have condemned the attack and promised swift action to track\ndown the assailants. The state police command says tactical teams have been mobilised, and investigations are ongoing. Traditional rulers, community leaders and civil-society groups have\nalso called for urgent intervention, noting that rural communities remain dangerously vulnerable.\n\nThe Larger Problem:\nThis incident adds to a worrying pattern of attacks on worship centres, homes and farms across\nthe North-Central region. Beyond the immediate tragedy, it raises questions about intelligence\ngathering, rural security architecture, and the increasing boldness of armed groups.\n\nA Call for Protection and Justice:\nCommunities like Eruku deserve safety. Places of worship should never become targets. As\nfamilies mourn their loved ones and pray for the return of those abducted, Nigerians continue to\ndemand stronger, more proactive measures from security agencies.\n\nThis tragedy is not just a Kwara incident — it is a national reminder that no community should\nbe left unprotected, and no life should be lost to unchecked violence.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2841e5a4-2ffb-4e01-ae28-b7bb0a29fa6a.jpeg",
    "timestamp": "2025-11-20T09:44:21.376Z"
  },
  {
    "slug": "international-men-s-day-2025-celebrating-men-and-boys-honouring-strength-and-humanity-by-grandprinceita-1763631400885",
    "headline": "International Men’s Day 2025: Celebrating Men and Boys, Honouring Strength and Humanity by GrandprinceIta",
    "kicker": "",
    "summary": "",
    "bodyText": "Yesterday, the world observed International Men’s Day, an annual event dedicated to recognising\nthe positive value men and boys bring to families, communities, and society. This year’s theme,\n“Celebrating Men and Boys,” calls for renewed attention on the emotional, mental, social and\nphysical well-being of men everywhere.\n\nMore than a celebration, the day serves as a reminder that men also face pressures, vulnerabilities, and expectations that often go unspoken. In many societies, especially across\nAfrica, men are encouraged to be strong but rarely encouraged to seek help, embrace\nvulnerability, or prioritise their health. \n\nInternational Men’s Day invites a shift—from silent\nendurance to healthy, balanced living.\n\nWhy This Day Matters:\nMen contribute as protectors, providers, mentors, innovators, caregivers, and nation-builders.\nYet, high rates of mental-health challenges, stress-related illnesses, workplace hazards and\nSocietal expectations continue to affect their quality of life. Recognising these realities is not\nabout elevating men above others; it’s about acknowledging that well-being is a universal\nhuman need.\n\nCelebrating men means:\n● Appreciating fathers, brothers, sons, mentors and male role models who positively shape\nlives.\n● Encouraging men to embrace emotional openness without shame.\n● Supporting boys to grow into healthy, empathetic, confident adults.\n● Challenging harmful stereotypes that box men into silence or pressure them into\nunhealthy masculinity.\n\n\nA Call for Better Support Systems\nIn Nigeria and across the continent, the day highlighted an urgent need to prioritise men’s health\n— from mental health access to preventive care. It also invites families and communities to pay\ncloser attention to the emotional lives of men, who often carry burdens quietly.\n\nInternational Men’s Day is, ultimately, a call for balance. When men and boys thrive—mentally,\nphysically, spiritually and emotionally—families are stronger, communities are safer, and\nsociety progresses.\n\nWe celebrated the strength, resilience, tenderness, and humanity of men and boys everywhere. May this recognition move beyond a single day and become an everyday culture of appreciation and support.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/efcd0fad-b675-48e8-819d-77b87a87295e.jpeg",
    "timestamp": "2025-11-20T09:36:40.885Z"
  },
  {
    "slug": "insecurity-kwara-shuts-schools-in-four-lgs-seeks-army-base-after-deadly-attack-1763630465348",
    "headline": "Insecurity: Kwara Shuts Schools in Four LGs, Seeks Army Base After Deadly Attack.",
    "kicker": "",
    "summary": "",
    "bodyText": "Kwara State has ordered the immediate closure of schools in Isin, Irepodun, Ifelodun, and Ekiti LGAs due to rising insecurity. \n\nThe move follows a bandit attack on a church in Eruku that killed three people and abducted over 35. Governor Abdulrahman Abdulrazaq visited the community and is seeking a military Forward Operating Base and a Police Mobile Squadron. \n\nResidents accused local police of failing to respond during the attack.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/976fec20-eba7-414a-a6d2-6c72e652e09e.jpeg",
    "timestamp": "2025-11-20T09:21:05.348Z"
  },
  {
    "slug": "base-digital-10-1763630348859",
    "headline": "Base Digital 10",
    "kicker": "",
    "summary": "The Base Digital 10 features a rundown of the top 10 Nigerian hits topping charts.",
    "bodyText": "10. Sarz Ft. Asake x Wizkid x Skillibeng - Getting Paid \n\n9. Kizz Daniel - To Be a Man\n\n8. Odumodu blvck Ft Wizkid - Big Time\n\n7. Rema - Fun\n\n6. Blaqbonez Ft. Fola - Despacito\n\n5. Dj Maphorisa x Dj Tunez x Wizkid ft. Mavo - Money Constant\n\n4. Ayra Starr Ft. Rema - Who’s That Girl \n\n3. ⁠Fola - You\n\n2. Ckay Ft Mavo - Body (Danz)\n\n1.Mavo - Shakabulizzy\n\n\n\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b8c1cd57-5dc0-4beb-bd36-c104a9403e37.jpeg",
    "timestamp": "2025-11-20T09:19:08.859Z"
  },
  {
    "slug": "haiti-qualifies-for-world-cup-for-the-first-time-in-52-years-1763563793512",
    "headline": "Haiti Qualifies for World Cup for the First Time in 52 years",
    "kicker": "",
    "summary": "",
    "bodyText": "Haiti’s national team has qualified for the World Cup for the first time in 52 years. \n\nThey beat Nicaragua 2-0 to top Group C in the Concacaf region with 11 points.\n\nHaiti qualified for the World Cup without having played a single home game in Haiti due to the gang violence in Port-au-Prince and lack of FIFA-regulated fields. \n\nAlso, the tiny Caribbean island of Curacao has made history as the smallest nation to ever qualify for the FIFA World Cup after holding the Reggae Boys of Jamaica to a draw.\n\nThe previous record was set by Iceland, who reached the 2018 finals, but their country is far bigger than Curacao, which has a population of just over 150,000 and a land area of 171 square miles, smaller than the Isle of Man.\n\nJamaica’s coach Steve McClaren resigned after his side, who needed a win in Kingston to qualify for their first World Cup since 1998, were held to a goalless draw, including having an injury-time penalty overruled by VAR.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/29cc807c-04b8-4bea-b796-5a7829a2ee32.webp",
    "timestamp": "2025-11-19T14:49:53.512Z"
  },
  {
    "slug": "two-miss-universe-judges-resign-after-suspecting-rigging-1763563507166",
    "headline": "Two Miss Universe Judges Resign After Suspecting Rigging",
    "kicker": "",
    "summary": "",
    "bodyText": "Two Miss Universe judges have resigned days before the annual beauty pageant, with one of them accusing organizers of rigging the selection process.\n\nLebanese- French musician Omar Harfouch, who announced his resignation from the eight-member jury on Instagram, alleged that an \"impromptu jury\" had pre-selected finalists ahead of the competition, set to be held on Friday in Thailand.\n\nHours later, French football manager Claude Makélélé also announced he'd pulled out, citing \"unforeseen personal reasons.\"",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/f77eb75c-b2ba-4255-a989-89781759a1e0.jpg",
    "timestamp": "2025-11-19T14:45:07.166Z"
  },
  {
    "slug": "25-killed-by-russian-drone-strike-against-ukraine-1763563113547",
    "headline": "25 Killed by Russian Drone Strike Against Ukraine",
    "kicker": "",
    "summary": "",
    "bodyText": "At least 25 people have been killed, including three children, in a Russian drone and missile attack on the western city of Ternopil that hit two blocks of flats, Ukrainian rescue officials say.\n\nAnother 73 people were wounded, 15 of them children, officials said, in one of the deadliest Russian strikes on western Ukraine since the full-scale war began in February 2022.\n\nTwo other western regions were hit, Lviv and Ivano-Frankivsk, and a drone attack targeted three districts of the northern city of Kharkiv, wounding more than 30 people. Photos posted online showed buildings and cars ablaze.\n\nPower cuts were affecting a number of regions across the country, Ukraine's energy ministry said.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/47705324-ec63-4dc0-8776-44ea7fc8b8f4.avif",
    "timestamp": "2025-11-19T14:38:33.547Z"
  },
  {
    "slug": "president-bola-tinubu-reschedules-johannesburg-luanda-trip-1763562699861",
    "headline": "President Bola Tinubu Reschedules Johannesburg & Luanda Trip",
    "kicker": "",
    "summary": "President Bola Tinubu has rescheduled trips to Johannesburg in South Africa and Luanda, Angola following the recent abduction of school girls in Kebbi and the attack on a church in Eruku Kwara State.",
    "bodyText": "This was communicated in a statement by the Special Adviser to the President on Information and Strategy, Bayo Onanuga, today.\n\nAccording to the statement, President Tinubu has ordered the deployment of more security men to Eruku and the entire Ekiti Local Government Area of the state at the request of the state government.\n\nThe President will be briefed by Vice President Kashim Shettima, who has been directed by the President to visit Kebbi on his behalf while he awaits reports from the police and the Department of State Services (DSS) regarding the attack in Kwara.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/7b98fe3f-37f1-4a99-b167-476bee4ab3e1.jpeg",
    "timestamp": "2025-11-19T14:31:39.861Z"
  },
  {
    "slug": "osimhen-likely-to-miss-caf-awards-1763562072848",
    "headline": "Osimhen likely to miss CAF awards",
    "kicker": "",
    "summary": "",
    "bodyText": "Victor Osimhen will be absent at this year’s CAF Awards in Rabat, Morocco today, as he returns to Galatasaray for a scheduled MRI scan on the hamstring injury he picked up during international duty for Nigeria.\n\nOsimhen, who won the award in 2023, is in the running for the award for the second time in his career. This year, he is up against Egypt and Liverpool forward Mohammed Salah and Achraf Hakimi of PSG and Morocco.\n\nThe player is expected to undergo a scan that will determine the extent of the injury he suffered on Sunday.\n\nOsimhen was withdrawn at halftime during Nigeria’s loss to DR Congo in the final of the 2026 World Cup African play-offs on Sunday. The striker was believed to have suffered a hamstring injury and was substituted to prevent further aggravation.\n\nIn the semi-final against Gabon, the 27-year-old scored an extra-time brace to take his national team tally for Nigeria to 31 goals.\n\nThe Nigerian striker is returning to the podium after winning two years ago. He was succeeded by his compatriot, Ademola Lookman.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/98853f14-014e-415f-99e0-18682e368656.jpg",
    "timestamp": "2025-11-19T14:21:12.848Z"
  },
  {
    "slug": "nwfl-warns-premiership-clubs-over-late-registration-insists-nov-26-kickoff-remains-sacrosanct-1763561974315",
    "headline": "NWFL Warns Premiership Clubs Over Late Registration, insists Nov 26 kickoff remains sacrosanct",
    "kicker": "",
    "summary": "",
    "bodyText": "The Nigeria Women Football League (NWFL) has issued a firm warning to clubs yet to complete their digital registration and club licensing procedures ahead of the new Premiership season, stressing that non-compliant teams risk sanctions, including relegation.\n\nWith the November 22 deadline fast approaching, the league organizers, in a statement on Tuesday by Media Director Samuel Ahmadu, confirmed that Castmog Ladies, Osun Babes, and Naija Ratels are among the clubs still behind schedule in meeting the mandatory digital documentation and licensing requirements.\n\nAll processes are now conducted through the league’s digital registration portal to ensure transparency and efficiency as part of efforts to professionalize women’s football in Nigeria. \n\nNWFL Chief Operating Officer, Modupe Shabi, urged the outstanding clubs to complete their submissions without delay, reaffirming that the deadline will not be extended.\n\n“The digital registration and licensing process is designed to ensure that every club meets the minimum professional standards required to compete,” Shabi said. \n\n“We expect full compliance before the November 22 deadline. Any club that fails to meet these financial and administrative obligations will face the consequences as outlined in our regulations. Our commitment is to run a credible, properly structured league.”\n\nThe NWFL reiterated its determination to enforce all regulatory provisions to guarantee a seamless start to the new season and uphold the integrity of the competition.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3f359087-8cd8-45a9-84c8-948e8fbba277.jpeg",
    "timestamp": "2025-11-19T14:19:34.315Z"
  },
  {
    "slug": "npbl-we-are-ready-to-retain-our-title-rivers-hoopers-captain-1763561849962",
    "headline": "NPBL: We Are Ready To Retain Our Title - Rivers Hoopers Captain",
    "kicker": "",
    "summary": "",
    "bodyText": "Rivers Hoopers captain Victor Anthony Koko says the team is fully prepared to defend their Nigeria Premier Basketball League title as the 2025 Final Four tips off from November 21 to 23 in Port Harcourt.\n\nThe Hoopers, unbeaten champions in 2023 and 2024, are chasing a historic three-peat and a seventh league crown. They face strong opposition from Lagos Legends, Gboko City Chiefs, and Nigeria Customs, with a Basketball Africa League slot also on the line.\n\nKoko says the KingsMen are “mentally prepared” and focused on retaining their championship, promising fans they will not be let down on home soil.\nPort Harcourt fans now wait to see if their team can extend its dominance as Nigeria’s top basketball side.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/864f9875-79cb-4edf-a6ac-5853bde9d487.webp",
    "timestamp": "2025-11-19T14:17:29.962Z"
  },
  {
    "slug": "faith-fear-foreign-voices-nicki-minaj-kidnapped-schoolgirls-nigeria-s-image-1763545979490",
    "headline": "Faith, Fear & Foreign Voices: Nicki Minaj, Kidnapped Schoolgirls & Nigeria’s Image",
    "kicker": "Article",
    "summary": "On today’s Base Sunrise, Charity Owoh unpacks how global attention is colliding with Nigeria’s harsh security reality.",
    "bodyText": "This morning on Base Sunrise Charity Owoh guided listeners through a powerful and troubling conversation about Nigeria’s ongoing security challenges and its global image.\nIt began with Nicki Minaj, who used a United Nations platform to call out what she described as the “deadly threat” against Christians in Nigeria. Speaking alongside U.S. Ambassador Mike Waltz, Minaj urged the world to defend freedom of belief, emphasizing that protecting Nigerians is about uniting humanity, not dividing people.\n\nMeanwhile, back home, Nigeria faces stark realities. Security forces have intensified efforts to locate 25 schoolgirls abducted from a boarding school in Kebbi State. Gunmen stormed the school in the early hours, killing the vice-principal and taking the students. Families are distraught, and authorities have deployed both military and vigilante groups to secure the safe return of the girls. \n\nAdding to public concern, a viral video from a church in Kwara State has emerged, allegedly showing worshippers under attack. While authorities are still verifying the details, the video underscores the fears Minaj highlighted regarding the safety of Christians in Nigeria.\n\nOn today’s episode, Charity Owoh asks pressing questions:\n- What does it mean when international voices are speaking louder than local authorities?\n- Are these tragedies primarily about religious persecution or part of a broader security crisis?\n- How do these incidents affect Nigeria’s image both domestically and internationally, and what must be done to reclaim it?\n\nListeners are invited to tune in to Base Sunrise and hear Charity Owoh explore these urgent issues with insight, context, and on-the-ground perspective.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/f7908ef7-c145-47a0-baee-7f4a4be0f92d.jpg",
    "timestamp": "2025-11-19T09:52:59.490Z"
  },
  {
    "slug": "why-nigerians-still-feel-no-relief-despite-falling-inflation-economists-1763545410995",
    "headline": "Why Nigerians Still Feel No Relief Despite Falling Inflation—Economists",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria’s inflation fell for the seventh straight month to 16.05% in October, but economists say the decline has not eased living costs. \n\nCPPE’s Muda Yusuf noted that essential sectors—food, transport, housing, and utilities—remain expensive due to structural problems like high logistics costs, energy shortages, and insecurity.\n\nHe said households feel no real relief despite the softer inflation. \n\nFormer CIBN President Okechukwu also dismissed the NBS inflation figures as flawed.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d22b5e9e-ff48-4737-a23d-105d4b41da7a.jpeg",
    "timestamp": "2025-11-19T09:43:30.995Z"
  },
  {
    "slug": "kano-apc-chieftain-withdraws-10m-bribe-claim-predicts-party-s-2027-victory-1763545291697",
    "headline": "Kano APC Chieftain Withdraws $10m Bribe Claim, Predicts Party’s 2027 Victory",
    "kicker": "",
    "summary": "",
    "bodyText": "Kano APC chieftain Mallam Alwan Hassan says the APC is set to reclaim Kano in the 2027 governorship election, citing ongoing party restructuring and political realignments.\n\nHe also retracted and apologized for his previous claim that senators took a $10m bribe to block NERC chairman nominee Ramat Abdullahi, urging the National Assembly to proceed with his confirmation.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e4c69cb7-a3cf-44b8-94ff-ea066c103a3b.jpg",
    "timestamp": "2025-11-19T09:41:31.697Z"
  },
  {
    "slug": "celebrating-purpose-and-elegance-lady-trish-18-1763484716448",
    "headline": "Celebrating Purpose and Elegance: Lady Trish @18",
    "kicker": "",
    "summary": "",
    "bodyText": "The Base Sunrise this morning featured a special segment with Lady Dr. Patricia, Tricia Osita-Onumonu, founder and Creative Director of Trish O Couture. \n\nLady Trish has spent 18 years building\nNigeria’s luxury fashion landscape with timeless designs and unmatched vision.\n\nHighlights from the interview included:\nThe upcoming Trish O Couture @18 Showcase, themed “Classics Across All Seasons,” featuring over 60 couture masterpieces.\n\nThe launch of Lady Trish Diamonds emphasizes timelessness, strength, and empowerment for women.\n\nPersonal reflections on balancing family, \nentrepreneurship, and mentorship, while maintaining grace and building a legacy.\n\nLady Trish’s insights reminded listeners that true beauty isn’t only in fashion; it’s in\nempowering people and shaping culture.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ce7a43fa-0ef4-426c-94a7-9b213e9fded8.jpeg",
    "timestamp": "2025-11-18T16:51:56.448Z"
  },
  {
    "slug": "verydarkman-mr-jollof-deboarded-after-airport-altercation-1763483731032",
    "headline": "VeryDarkman & Mr. Jollof Deboarded After Airport Altercation",
    "kicker": "",
    "summary": "",
    "bodyText": "At Asaba International Airport, social media personalities VeryDarkman and Mr. Jollof were\nremoved from United Nigeria Airlines Flight UN0523 following a heated altercation during boarding.\n\nCrew members acted promptly to de-escalate the situation, and both men were handed over to airport security, in accordance with international aviation safety protocols. \n\nThe flight departed safely without them.\nThe Nigerian Civil Aviation Authority (NCAA) confirmed that the duo will face the full force\nof the law, highlighting zero tolerance for unruly behavior, especially from public figures\nwhose influence reaches millions.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/0d270a38-4049-4cad-83b9-e321f4c4dd6a.jpg",
    "timestamp": "2025-11-18T16:35:31.032Z"
  },
  {
    "slug": "ndlea-arrests-lagos-hotelier-seizes-1-7-tonnes-of-cannabis-1763483436325",
    "headline": "NDLEA Arrests Lagos Hotelier, Seizes 1.7 Tonnes of Cannabis",
    "kicker": "",
    "summary": "",
    "bodyText": "The National Drug Law Enforcement Agency (NDLEA) achieved a major breakthrough in its\nFight against drug trafficking.\n\nA wanted drug baron, Frank Chijioke Ibemesi (Chisco Bee), was arrested after weeks of surveillance. The 42-year-old businessman, who owns Franc CJ Ibemesi Nig Ltd and Daisy Garden Hotel in Isolo, Lagos, was taken into custody early Saturday, November 15.\n\nAuthorities recovered 1.7 tonnes of Loud, a high-grade cannabis strain, neatly packed in 42\njumbo bags and four cartons. Seized foreign currencies included $11,600, £2,000, €2,200,\nand 50 Canadian dollars.\n\nThis operation was part of a nationwide clampdown. In Osun State, authorities intercepted over 11 tonnes of cannabis, while Edo State saw 1.9 tonnes of skunk recovered from forests, highways, and vehicles. Additional arrests and seizures occurred in Ogun, Taraba, Adamawa, Lagos, and Kwara, including methamphetamine and tramadol capsules.\n\nNDLEA continues its War Against Drug Abuse, conducting sensitisation campaigns across\nschools, workplaces, and communities in Zamfara, Ebonyi, Jigawa, Enugu, Lagos, and\nOgun.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ded5cb02-ccc5-47a8-8eef-41d77cf26040.jpeg",
    "timestamp": "2025-11-18T16:30:36.325Z"
  },
  {
    "slug": "uk-threatens-visa-ban-against-3-african-countries-1763476628725",
    "headline": "UK Threatens Visa Ban Against 3 African Countries",
    "kicker": "",
    "summary": "",
    "bodyText": "The United Kingdom has threatened to impose visa bans on citizens of three African countries unless they agree to take back irregular migrants, ahead of the government’s announcement of a sweeping overhaul of the asylum system.\n\nIn a statement released on Monday, the Home Office said Angola, Namibia, and the Democratic Republic of Congo would no longer receive UK visas if they fail to cooperate in accepting the return of “their criminals and illegal immigrants.”",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/474a8430-fd1f-4378-b83d-7e3c51efffc4.jpeg",
    "timestamp": "2025-11-18T14:37:08.725Z"
  },
  {
    "slug": "nff-apologises-to-president-bola-ahmed-tinubu-1763476031825",
    "headline": "NFF Apologises to President Bola Ahmed Tinubu",
    "kicker": "",
    "summary": "",
    "bodyText": "The Nigeria Football Federation (NFF) yesterday, apologised to President Bola Tinubu and Nigerians following the Super Eagles’ failure to qualify for the 2026 FIFA World Cup finals.\n\nIn a statement seen on its official X handle the NFF described the defeat as a moment of profound sadness for Nigerian football.\n\nIt noted that missing out on the World Cup for a second consecutive time was a bitter setback, carrying “great weight and emotional depth” for the nation.\n\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/def8b3e9-5b6d-4789-a5d0-b0c3592adf3f.jpeg",
    "timestamp": "2025-11-18T14:27:11.825Z"
  },
  {
    "slug": "dr-congo-defeats-nigeria-4-3-in-penalties-1763384252671",
    "headline": "DR Congo Defeats Nigeria, 4-3 in Penalties",
    "kicker": "",
    "summary": "Super Eagles of Nigeria’s quest to be at the 2026 World Cup ended after DR. Congo defeated them 4-3 on penalties after full time had ended 1-1,\n\n With this, DR Congo has picked Africa’s sole ticket for the intercontinental play-offs billed for March next year.",
    "bodyText": "In a tight and dramatic playoff match at the Complexe Sportif Prince Moulay El Hassan in Rabat, Nigeria's hopes of qualifying for the 2026 FIFA World Cup ended on Sunday night as the Super Eagles lost 4-3 on penalties to DR Congo.\n\nAfter a long game marked by unused opportunities, tough defense, and intense emotion, Nigeria was crushed as the Leopards maintained their composure in the shootout to progress. The match ended 1-1 after 120 minutes.\n\nIn the third minute, Frank Onyeka gave Nigeria the ideal start by scoring from the edge of the box after goalkeeper Lionel Mpasi-Nzau was wrong-footed by a deflection.\n\nAfter a deft pass from Cedric Bakambu, Meschack Elia of DR Congo equalized in the 32nd minute.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/081b2f6e-3e65-4389-a359-ad94e40a0e53.webp",
    "timestamp": "2025-11-17T12:57:32.671Z"
  },
  {
    "slug": "d-banj-speaks-on-who-initiated-mo-hits-split-1763383461922",
    "headline": "D'banj Speaks on Who Initiated Mo'Hits Split",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigerian music star Oladapo Oyebanjo, popularly known as D’banj, has revealed that it was producer and longtime collaborator Michael “Don Jazzy” Ajereh who made the call for both of them to end their partnership at Mo’Hits Records.\n\nSpeaking on the Mic On Podcast, D’banj said the decision, though unexpected, ultimately protected their friendship.\n\nHe explained that Don Jazzy not only initiated the split but also handed him full ownership of his music catalogue, including about ten unreleased tracks.\n\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3329d66f-0444-49d9-bbe8-3d70870dfc78.webp",
    "timestamp": "2025-11-17T12:44:21.922Z"
  },
  {
    "slug": "base-fm-announces-media-partnership-with-the-9th-afrima-awards-1763383166242",
    "headline": "Base Fm Announces Media Partnership With The 9th AFRIMA Awards",
    "kicker": "",
    "summary": "",
    "bodyText": "Base FM is proud to announce its official media partnership with the 9th All Africa Music Awards (AFRIMA), one of the continent’s most prestigious celebrations of African music, culture, and creativity.\n \nAs a media partner, Base FM will provide exclusive updates, artist spotlights, interviews, red carpet moments, and behind-the-scenes coverage leading up to the event. Listeners can look forward to live reports, and special features across our shows.\n \nThe 9th AFRIMA Awards promises unforgettable performances, international recognition for African talent, and a vibrant showcase of the diverse sounds shaping the continent. Base FM is excited to be part of this celebration and to bring the experience closer to our audience.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/8edca7e0-3455-4c0d-b721-b1b9fbe90fb9.jpeg",
    "timestamp": "2025-11-17T12:39:26.242Z"
  },
  {
    "slug": "don-jazzy-unveils-new-mavins-signee-cupidszn-1763132415635",
    "headline": "Don Jazzy Unveils New Mavins Signee, CUPIDSZN",
    "kicker": "",
    "summary": "",
    "bodyText": "Don Jazzy has officially unveiled the label's newest signee, the 21-year-old artist CUPIDSZN, marking another success story from the Mavin Academy.\n\nThe signing comes with a compelling backstory of persistence and destiny, as revealed by Don Jazzy in a tweet via his X account:\n\"4 years ago... a father who believed so much in his 17-year-old talented son sent me a DM... Unfortunately, I didn't see that message as my DM choke die. 2 yrs later, he didn't give up... he kept developing himself, and destiny still placed him on the path with Mavin.\"\n\nAfter excelling through the Mavin Academy program, the artist is now unveiled simultaneously with his debut EP, 'MYTH ERA.'\n\nThis launch reinforces Mavin Records' commitment to scouting, developing, and launching Africa's next generation of global music stars.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e59fff12-3b8c-46bd-9478-487eb4e35ce3.jpeg",
    "timestamp": "2025-11-14T15:00:15.635Z"
  },
  {
    "slug": "base-fm-joins-the-celebration-at-margarita-fest-2025-1763132206902",
    "headline": "Base FM Joins the Celebration at Margarita Fest 2025",
    "kicker": "Events",
    "summary": "",
    "bodyText": "Raise your glasses,  it’s time to toast to good vibes, great music, and even better company as Base FM partners with Margarita Fest 2025 on November 30, 2025.\n\nThis year’s edition promises a fusion of premium cocktails, live performances, and chilled tropical energy that captures the Lagos spirit. From vibrant pop-up bars to interactive brand activations, Margarita Fest is designed to bring together lovers of good taste and high energy.\n\nBase FM will be covering the event live with on-air updates, interviews, and social media highlights, giving fans a front-row seat to the fun.\n\nExpect Base FM hosts to bring their signature vibe to the stage and connect partygoers through music and laughter.\nWhether you’re there to sip, sway, or simply soak in the moment, Margarita Fest 2025 is the weekend experience you don’t want to miss.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a3bdc202-4113-441c-ae49-a4a6d4ad6881.jpeg",
    "timestamp": "2025-11-14T14:56:46.902Z"
  },
  {
    "slug": "south-africa-set-to-bid-for-2036-or-2040-olympic-and-paralympic-games-1763130501424",
    "headline": "South Africa Set to Bid for 2036 or 2040 Olympic and Paralympic Games",
    "kicker": "",
    "summary": "",
    "bodyText": "South Africa is set to bid for the 2036 or 2040 Olympic and Paralympic Games, the government said on Thursday, 13 November 2025—the first for an African country if it gets the hosting rights.\n\nAlready the country was the first on the continent to host the football World Cup in 2010 successfully.\n\nMinister in the presidency Khumbudzo Ntshavheni said at a briefing that \"South Africa initiates its intention to bid for the 2036 and 2040 Olympic Games.\"\n\nNtshavheni said the government had entered into \"continuous dialogue with the International Olympic Committee.\"\n\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/f88cd9b2-b2c0-4834-a81d-8a2a127f849f.webp",
    "timestamp": "2025-11-14T14:28:21.424Z"
  },
  {
    "slug": "former-world-heavyweight-champion-joseph-parker-tests-positive-for-cocaine-1763130348731",
    "headline": "Former World Heavyweight Champion, Joseph Parker Tests Positive for Cocaine",
    "kicker": "",
    "summary": "",
    "bodyText": "Former world heavyweight champion Joseph Parker has tested positive for cocaine and risks a likely ban from boxing after testing positive for cocaine.\n\nParker, 33, failed a drug test on the day of his fight with Fabio Wardley on 26 October, according to media reports.\n\nHe was tested by the Voluntary Anti-Doping Agency (VADA) on 25 October.\n\nParker tested positive for the recreational drug and not performance-enhancing drugs, which could see him get a two-year ban. He also be suspended for as little as three months depending on circumstances.\n\nAny ban would be handed down by UK Anti-Doping (UKAD) and the British Boxing Board of Control (BBBC).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ef3e72c9-0921-43d5-8a7b-8cdf826758e3.webp",
    "timestamp": "2025-11-14T14:25:48.731Z"
  },
  {
    "slug": "bad-bunny-takes-home-5-latin-grammy-awards-1763130201808",
    "headline": "Bad Bunny Takes Home 5 Latin Grammy Awards",
    "kicker": "",
    "summary": "",
    "bodyText": "Puerto Rican pop singer Bad Bunny scooped home five Latin Grammy Awards on Thursday at the event held in Las Vegas.\n\nAmong them was album of the year, for the acclaimed Debí Tirar Más Fotos, a project that embraced his island's musical heritage—and paved the way for him to perform at next year's Super Bowl halftime show.\n\nBunny dedicated the award to \"all the youth of Latin America.\" He added, \"There are many ways of being patriotic and defending our homelands. We chose music.\"\n\nOther winners are Catriel and Paco Amoroso, who took home five prizes; Alejandro Sanz; Gloria Estefan; and Karol G, who is set to headline next year's Coachella festival.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/875064ee-806c-430b-a1ca-f144ab6941f2.jpeg",
    "timestamp": "2025-11-14T14:23:21.808Z"
  },
  {
    "slug": "south-africa-grants-entry-to-153-palestinian-refugees-1763129822709",
    "headline": "South Africa Grants Entry to 153 Palestinian Refugees",
    "kicker": "",
    "summary": "",
    "bodyText": "South African authorities have granted entry to 153 Palestinian refugees who arrived Thursday, 13 November 2025, on a chartered flight from Kenya to seek asylum in the country but had been denied admission after failing immigration tests.\n\nThe Border Management Authority (BMA) said in a statement that during their standard immigration interview process, the Palestinians did not indicate their duration of stay in the country or their intended accommodation addresses.\n\nThe Palestinian refugees waited for more than 10 hours on the tarmac at OR Tambo International Airport near Johannesburg to be cleared or turned away. The news caused outrage among activists in the country known to be strong supporters of Palestinian rights.\n\nSouth Africa’s Ministry of Home Affairs authorised the passengers to get off the plane on Thursday night after a local humanitarian organisation guaranteed to provide the passengers with accommodation during their stay in South Africa if needed.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/02f26da6-400c-49f6-997a-8b00476acefc.jpg",
    "timestamp": "2025-11-14T14:17:02.709Z"
  },
  {
    "slug": "lagos-state-government-announces-repairs-and-partial-closure-of-lekki-ajah-expressway-1763129645287",
    "headline": "Lagos State Government Announces Repairs and Partial Closure of Lekki-Ajah Expressway",
    "kicker": "",
    "summary": "",
    "bodyText": "The Lagos State Government has announced that sections of the Lekki–Ajah corridor will be partially closed for eight months to allow for major rehabilitation and improvement works aimed at easing traffic flow in the area.\n\nThe Commissioner for Transportation, Oluwaseun Osiyemi, disclosed this in a statement on Wednesday, saying the project will run from Saturday, November 15, 2025, to Wednesday, July 15, 2026.\n\nAccording to him, the rehabilitation project, which has already commenced with preliminary works, will be carried out in two phases to reduce traffic disruption during the period.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/88a9b4bd-5acc-49f2-8dcb-ac83184fd677.webp",
    "timestamp": "2025-11-14T14:14:05.287Z"
  },
  {
    "slug": "president-bola-ahmed-tinubu-approves-reappointment-of-brigadier-general-mohammed-buba-marwa-rtd-as-chairman-of-ndlea-1763129425809",
    "headline": "President Bola Ahmed Tinubu Approves Reappointment of Brigadier-General Mohammed Buba Marwa (rtd) as Chairman of NDLEA",
    "kicker": "",
    "summary": "",
    "bodyText": "President Bola Ahmed Tinubu has approved the reappointment of Brigadier-General Mohammed Buba Marwa (rtd) as Chairman of the National Drug Law Enforcement Agency (NDLEA) for another five-year term.\n\nMarwa, a former military governor of Lagos and Borno States, was first appointed by the late former President Muhammadu Buhari in January 2021.\n\nBefore his appointment, he had chaired the Presidential Advisory Committee for the Elimination of Drug Abuse from 2018 to 2020.\n\nBy his reappointment, he will remain at the helm of the NDLEA until 2031.\n\nThe NDLEA under his leadership has recorded the arrest of more than 73,000 drug traffickers and barons and the seizure of over 15 million kilograms of illicit substances.\n\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4ab905ce-47be-4360-ba95-977d1a0ab29c.jpeg",
    "timestamp": "2025-11-14T14:10:25.809Z"
  },
  {
    "slug": "abductors-of-federal-ministry-of-defence-directors-demand-n150m-1763129269119",
    "headline": "Abductors of Federal Ministry of Defence Directors Demand N150m",
    "kicker": "",
    "summary": "",
    "bodyText": "Reports say abductors of six directors of the Federal Ministry of Defence along the Kabba–Lokoja highway in Kogi State are now demanding N150 million for their release.\n\nThey were kidnapped on November 10, 2025, while traveling from Lagos to Abuja for a Directorate-level promotion examination. Sources described the incident as a well-coordinated ambush.\n\nA family source, while confirming the demand, said, “We are still in shock over the whole incident. To worsen our pain, the kidnappers are demanding N150 million to free all six of them. Where and how can we raise such an outrageous amount? We are appealing to the kidnappers to release our breadwinners unharmed. This is all we can say.”\n\nThe victims are Mrs. Ngozi Ibeziakor, Mrs. C. Emeribe, Mrs. Helen Ezeakor, Mrs. C. Ladoye, Mrs. J. Onwuzurike, and Mrs. Catherine Essien.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d0462e02-9361-4ee5-9fef-c96a16d33252.webp",
    "timestamp": "2025-11-14T14:07:49.119Z"
  },
  {
    "slug": "abuja-airport-shutdown-over-aircraft-incident-1763129059033",
    "headline": "Abuja Airport Shutdown Over Aircraft Incident",
    "kicker": "",
    "summary": "",
    "bodyText": "The Nnamdi Azikiwe International Airport (NAIA), Abuja, was temporarily shut down on Thursday following an aircraft incident on its runway.\n\nThe aircraft, a Gulfstream 400 with the registration number 5N-PZE, a private jet, had its nosewheel damaged on landing at the airport at about 2 pm.\n\nA source close to the airport confided in our correspondent that the aircraft, carrying 10 passengers and four crewmembers, had departed Enugu Airport for Abuja before the incident.\n\nThe cause of the incident could not be ascertained at the time of filing this report, but the source confirmed that the aircraft had been evacuated from the scene.\n\nThe source said, “Yes, I can confirm an aircraft incident on the runway of Abuja Airport today (Thursday). The aircraft was coming from Enugu Airport but had a nosewheel incident on landing.\n\n“As of the time of the incident, there were 14 souls onboard, including four crewmembers. However, there was no casualty among the passengers or the crew. It led to a minimal closure of the airport. The incident happened at about 2 pm.”\n\n\n\n\n\n\n\n\n\n\ncredit: Guardian",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b685c23b-06d7-46da-b270-e0967dc2389f.jpg",
    "timestamp": "2025-11-14T14:04:19.033Z"
  },
  {
    "slug": "suspension-of-15-petrol-and-diesel-import-duty-1763115530200",
    "headline": "Suspension of 15% Petrol and Diesel Import Duty",
    "kicker": "Base Sunrise with Cha Cha",
    "summary": "",
    "bodyText": "The Federal Government has suspended the planned 15% import duty on petrol and diesel, a policy that would have significant economic implications for citizens and businesses alike.\n\nChacha discussed with Omatseye about the potential impact that the duty could have had on transportation costs, the prices of goods, and household budgets, noting that fuel price changes have a ripple effect across the economy. The discussion highlighted the importance of timing, communication, and planning when implementing new policies, stressing that abrupt announcements without proper preparation can create uncertainty and stress for the public.\n\nThe segment explored the broader lesson for policymaking: that government decisions must be carefully considered, with attention to the practical impact on the daily lives of Nigerians. This segment resonated with the principle that effective policies are those that anticipate real-world consequences and seek to minimize disruption while achieving their intended goals.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/eb546e26-28fb-469d-8a45-bd1299b97d4a.jpeg",
    "timestamp": "2025-11-14T10:18:50.200Z"
  },
  {
    "slug": "waec-cbt-suspension-are-nigerian-schools-ready-1763114191959",
    "headline": "WAEC CBT Suspension: Are Nigerian Schools Ready?",
    "kicker": "Base Sunrise with ChaCha",
    "summary": "",
    "bodyText": "The House of Representatives’ has decided to suspend WAEC’s plan to implement Computer-Based Testing (CBT) for the 2026 WASSCE. The move has reignited debates about Nigeria’s readiness for digital education and the challenges facing the country’s students and schools.\n\nChacha highlighted that while modernizing the examination system is a positive step, many schools across the country, particularly in rural areas still face fundamental challenges such as limited access to functional computers, unstable electricity, and a shortage of trained staff.\n\nThe discussion examined the potential consequences of implementing CBT prematurely, including the risk of widening educational inequalities between urban and rural students. The show explored whether a phased rollout or pilot programs might be more effective in ensuring all students have the opportunity to succeed in a digital examination environment.\n\nThe segment underscored the need for careful planning, preparation, and investment in infrastructure to make digital education a reality in Nigeria, emphasizing that policies must align with the realities on the ground to be successful.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/da312bc1-492d-48b5-a5fa-87f1e9096f42.jpeg",
    "timestamp": "2025-11-14T09:56:31.959Z"
  },
  {
    "slug": "super-eagles-soar-over-gabon-in-4-1-victory-head-to-the-playoff-finals-1763065855584",
    "headline": "SUPER EAGLES SOAR OVER GABON IN 4 - 1 VICTORY, HEAD TO THE PLAYOFF FINALS",
    "kicker": "",
    "summary": "",
    "bodyText": "The Super Eagles soared past Gabon with a 4-1 extra-time victory (thanks to that Osimhen double & Ejuke's strike!) in the playoff semi-final.\n\nBUT THE JOB ISN'T DONE! We're now heading to the final hurdle this Sunday. The winner of that match goes to the InterContinental Playoff where only one more win secures our spot in the 2026 FIFA World Cup!",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/9a7a2005-a651-4093-a8c7-721624413595.jpeg",
    "timestamp": "2025-11-13T20:30:55.584Z"
  },
  {
    "slug": "kizz-daniel-s-paris-no-show-who-s-really-at-fault-1763063273574",
    "headline": "Kizz Daniel’s Paris No-Show: Who’s Really at Fault?",
    "kicker": "",
    "summary": "",
    "bodyText": "The spotlight then shifted to Kizz Daniel, who once again found himself at the center of controversy. \n\nA Paris-based promoter is demanding nearly €80,000 in refunds after Kizz allegedly failed to appear for a scheduled performance. \n\nThe issue reportedly stemmed from payment misunderstandings — leaving fans disappointed, organizers frustrated, and Lagos asking: When shows fall apart, is the artist responsible, or should promoters bear the blame?\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4bcbb72c-f3b1-44c4-a0dc-c0a2e1927fea.jpeg",
    "timestamp": "2025-11-13T19:47:53.574Z"
  },
  {
    "slug": "base-fm-partners-with-militant-camp-rave-call-of-duty-edition-1763063059864",
    "headline": "Base FM Partners with Militant Camp Rave “Call of Duty” Edition",
    "kicker": "",
    "summary": "",
    "bodyText": "Get ready for one of the most explosive experiences of the year as Base FM partners with Militant Camp Rave for its “Call of Duty” edition, happening on November 29, 2025.\nKnown for its bold themes and adrenaline-packed atmosphere, Militant Camp Rave is where music, creativity, and gaming culture collide. \n\nThis year’s edition promises an immersive experience inspired by the energy and thrill of the iconic video game. Attendees can expect high-energy performances, interactive installations, and a non-stop rave that celebrates freedom, intensity, and expression.\n\nBase FM will be live on-ground to capture the excitement, host exclusive interviews, and engage ravers with special giveaways and on-air moments. It’s not just a party, it’s a movement of sound, light, and culture.\n\nStay tuned to Base FM for updates, behind-the-scenes coverage, and your chance to win tickets to this unforgettable night.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ed5a1d6f-b574-4503-a2d9-e92ce4253cbc.jpeg",
    "timestamp": "2025-11-13T19:44:19.864Z"
  },
  {
    "slug": "healthline-segment-understanding-cholera-with-nurse-ayomide-from-diamed-centre-1763062912164",
    "headline": "Healthline Segment: Understanding Cholera with Nurse Ayomide from Diamed Centre",
    "kicker": "",
    "summary": "",
    "bodyText": "On our Healthline segment, we were joined by Nurse Akinwekomi Ayomide O. from\nDiamed Centre Hospital, who shed light on cholera prevention and awareness amid\nrising reports of outbreaks in some regions.\n\nShe explained the causes, symptoms, and treatments of cholera, stressing the\nimportance of clean water, proper sanitation, and early medical attention.\n\nNurse Akinwekomi also tackled some of the myths surrounding cholera, from the false\nbelief that alcohol or peppery foods can “kill” the bacteria, to the misconception that\nonly people in rural areas are at risk.\n\nHer message was clear: “Cholera thrives where hygiene fails and prevention starts with simple habits like handwashing and safe food handling.”",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/907f753e-a060-4e11-b443-fe1d0bd92d64.jpeg",
    "timestamp": "2025-11-13T19:41:52.164Z"
  },
  {
    "slug": "it-s-unfortunate-our-super-eagles-are-being-owed-peter-obi-1763040966361",
    "headline": "It’s unfortunate our Super Eagles are being owed – Peter Obi",
    "kicker": "",
    "summary": "",
    "bodyText": "In a statement on his verified X account on Wednesday, Mr Obi lamented that a country that finds resources for “needless lavish spending” cannot meet its obligations to athletes who represent it with pride.\n\nLabour Party’s 2023 presidential candidate, Peter Obi, has condemned the Nigeria Football Federation (NFF) and the federal government over the non-payment of allowances owed to the Super Eagles, describing the situation as “truly unfortunate” and symptomatic of Nigeria’s governance failures.\n\nIn a statement on his verified X account on Wednesday, Mr Obi lamented that a country that finds resources for “needless lavish spending” cannot meet its obligations to athletes who represent it with pride.\n\n“It is truly unfortunate that our Super Eagles, who consistently give their best in representing our dear nation, are being owed their allowances,” Mr Obi wrote. “We always seem to find money to waste on needless lavish spending and political patronage, yet we cannot pay those who patriotically raise our flag, bring us pride, and serve with dedication. That is what is found in a now disgraced country.”\n\nThe former Anambra governor said the development reflects a deep moral problem in Nigeria’s governance culture.\n\n“When those who serve their country are not treated with dignity, it sends the wrong message to our youth — that hard work and service are not rewarded. Those who represent Nigeria deserve to be paid promptly and treated with respect. We must do better,” he added.\n\nMr Obi’s statement comes amid an ongoing crisis in the Super Eagles’ camp in Rabat, Morocco, where players and officials boycotted training on Tuesday over long-standing unpaid bonuses and allowances.\n\nThe players who threatened not to train until the Nigeria Football Federation settles its debts, have made peace with the federation, after the boycott initially casted a shadow on the Preparations ahead of today’s games.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/73d995bb-0cbf-44b3-8eb9-71375325dd7f.webp",
    "timestamp": "2025-11-13T13:36:06.361Z"
  },
  {
    "slug": "dr-congo-offers-1m-per-player-for-w-cup-play-off-ticket-1763039907235",
    "headline": "DR Congo offers $1m per player for W’Cup Play-off Ticket",
    "kicker": "",
    "summary": "",
    "bodyText": "The Democratic Republic of Congo have promised each player a one-million-dollar bonus if they qualify for the intercontinental play-offs of the 2026 FIFA World Cup.\n\nThe Leopards face Cameroon on Thursday, November 13, in the African play-offs, with the winner set to meet either Nigeria or Gabon for a place in the intercontinental stage.\n\nAccording to Sport News Africa, President Félix Tshisekedi personally approved the incentive, with arrangements already made for Rawbank to transfer the funds directly to the players if qualification is secured by November 16.\n\nThe offer applies only to players, excluding coach Sébastien Desabre and his staff, as the government aims to inspire a first World Cup appearance since 1974.\n\nThe CAF-organised play-offs, hosted in Morocco from November 13 to 16, feature four top African runners-up competing for a single spot in the intercontinental play-offs for the expanded 2026 World Cup in North America.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/835a64f3-ac4c-4795-9883-e4451c75445b.jpeg",
    "timestamp": "2025-11-13T13:18:27.235Z"
  },
  {
    "slug": "super-eagles-clash-with-gabon-today-1763025375510",
    "headline": "Super Eagles Clash with Gabon Today",
    "kicker": "",
    "summary": "",
    "bodyText": "The Super Eagles of Nigeria will clash with the Panthers of Gabon in a CAF World Cup semifinal   playoff in Morocco later today.\n\nThe match is a must win for the Eric Chelle charges. Report from the Super Eagles Camp in Morocco say they have resumed training on Wednesday after boycotting Tuesday’s session citing unpaid bonuses.\n\nSources say the standoff has been resolved following discussions between the players and the Nigeria Football Federation (NFF).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/96ebd30b-d742-4a8a-8ea5-06b22d85f1a1.jpg",
    "timestamp": "2025-11-13T09:16:15.510Z"
  },
  {
    "slug": "adele-lands-her-first-acting-role-in-movie-by-former-fashion-designer-tom-ford-1763024844968",
    "headline": "Adele Lands Her First Acting Role in Movie by Former Fashion Designer, Tom Ford.",
    "kicker": "",
    "summary": "British Grammy winning singer Adele Laurie Blue Adkins popular known Adele has landed her first acting role in the next movie by former fashion designer Tom Ford.",
    "bodyText": "British Grammy winning singer Adele Laurie Blue Adkins popular known Adele has landed her first acting role in the next movie by former fashion designer Tom Ford.\n\nThe ‘Hello’ hitmaker is set to star alongside old timers including Nicholas Hoult, Aaron Taylor-Johnson, Colin Firth, Paul Bettany and Adolescence's breakthrough star Owen Cooper in Cry to Heaven. Details about her character or role in the movies is still under wraps.\n\nIt will be adapted from Anne Rice's 1982 novel, which is set in the 18th Century world of the \"castrati\" - male singing stars who were castrated to preserve their high voices.\n\nWatchout Adele is coming to a screen near you or right inside your living room or mobile devices.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/68bc2eaf-8077-46af-a69d-d9fa61d00823.jpg",
    "timestamp": "2025-11-13T09:07:24.968Z"
  },
  {
    "slug": "google-denies-removing-western-sahara-border-for-morocco-users-1763024631100",
    "headline": "Google Denies Removing Western Sahara border for Morocco Users",
    "kicker": "",
    "summary": "",
    "bodyText": "The company issued the disclaimer on Tuesday, explaining that the dotted lines illustrating the border between Western Sahara and Morocco have never been visible to people using Google Maps in the Morocco.\n\nAfter media reports last week highlighted the discrepancy, linking it to the UN Security Council endorsing the Moroccan autonomy plan for Western Sahara, the tech giant has now clarified it  saying the different border displays have always been the case.\n\nWestern Sahara is a vast mineral-rich former Spanish colony that is largely controlled by Morocco but has been claimed for decades by the pro-independence Polisario Front, which is supported by Algeria.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cd1c8717-29b9-4044-a692-9b2a197835ba.jpeg",
    "timestamp": "2025-11-13T09:03:51.100Z"
  },
  {
    "slug": "dangote-group-announces-plans-to-invest-1-billion-in-zimbabwe-1763023787339",
    "headline": "Dangote Group Announces Plans to Invest $1 Billion in Zimbabwe",
    "kicker": "",
    "summary": "",
    "bodyText": "Dangote Group has announced plans to invest up to $1 billion in Zimbabwe to develop cement and power plants and  a fuel pipeline.\n\nPresident and Chief Executive of the Dangote Group, Aliko Dangote, disclosed this  after a meeting with Zimbabwean President Emmerson Mnangagwa in Harare on Wednesday.\n\nDangote said   the efforts of Mnangagwa to   turn his country’s economy around were showing already. He noted that results of the government efforts inspired the group’s decision that this is the right time for  to .invest in Zimbabwe.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a91d12ad-f690-428f-82c4-a5be95ce1769.png",
    "timestamp": "2025-11-13T08:49:47.339Z"
  },
  {
    "slug": "ipob-leader-files-application-at-the-court-of-appeal-for-a-stay-of-further-proceedings-1763023311206",
    "headline": "IPOB Leader Files Application at the Court of Appeal For a Stay of Further Proceedings",
    "kicker": "",
    "summary": "",
    "bodyText": "The leader of the Indigenous People of Biafra, IPOB, has filed an application at the Court of Appeal, praying for a stay of further proceedings in his trial before Justice James Omotosho of Abuja Federal High Court.\n\nIn the motion, Kanu urged the Appeal Court to stay delivery of judgment scheduled for November 20, 2025, pending the determination of the appeal.\n\nHe filed the motion on notice pursuant to section 36(1) of the Nigerian constitution, which guarantees that in the determination of one's civil rights and obligations, including any question or determination by or against a government or authority, a person is entitled to a fair hearing within a reasonable time by an independent and impartial court or other tribunal. This right ensures a just legal process, preventing unfair judgments by an unbiased body.\n\nPlans by the Peoples Democratic Party, PDP, to hold a national convention in the next 48 hours seem to have suffered another setback, as a Federal High Court in Abuja has again restrained it from holding its National Convention scheduled to be held in Ibadan, Oyo State, between November 15 and 16.\n\nThe court also barred the Independent National Electoral Commission (INEC) from supervising, monitoring, or recognizing the outcome of the Convention, where national officers are expected to be elected.\n\nThe court gave the order while delivering a ruling in an application brought by a former governor of Jigawa State, Sule Lamido.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/939e60bd-ee46-46e7-acf4-854a5c976030.webp",
    "timestamp": "2025-11-13T08:41:51.206Z"
  },
  {
    "slug": "tacha-breaks-two-guinness-world-records-1762966752096",
    "headline": "Tacha Breaks Two Guinness World Records ",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigerian media personality Anita Natacha Akide, popularly known as Symply Tacha, has made history after completing 82 full cosmetic makeovers in eight hours on October 11, 2025, and 144 in 24 hours the following day during her Tacha Beauty Fest in Lagos.\n\nGuinness World Records confirmed the remarkable achievements today, officially recognizing Tacha's record-breaking feat. \n\nEach makeover included the application of foundation, concealer, blush, eyeshadow, mascara, lip liner, gloss, and powder.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2c63b3fe-421d-4dc6-a034-aff160b9d590.jpeg",
    "timestamp": "2025-11-12T16:59:12.096Z"
  },
  {
    "slug": "false-accusation-culture-when-allegations-go-wrong-1762958910358",
    "headline": "False Accusation Culture: When Allegations Go Wrong",
    "kicker": "",
    "summary": "The Base Sunrise with Charity Owoh closed this morning with a critical social topic—false accusations and their impact.",
    "bodyText": "Enugu Case: A 29-year-old woman, Chisom Okonkwo, accused her husband, Ozioma Okonkwo, of sexually assaulting their two young daughters during a marital dispute. Investigations revealed no evidence of abuse, and the case is now being handled under the law for defamation and giving false information to authorities.\n\nTrending on X: social media, conversations around Vivian Okeke sparked debate when alleged remarks encouraging false rape accusations went viral. This brought to light questions about misinformation, accountability, and the consequences of public speech.\n\nListeners were invited to reflect on the societal impact of false claims, how to protect genuine victims, and the broader cultural implications for trust and justice in families and communities.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3aaf6298-2bec-471a-8c62-29ad5f556530.jpeg",
    "timestamp": "2025-11-12T14:48:30.358Z"
  },
  {
    "slug": "nigeria-submits-formal-request-for-prison-transfer-of-former-deputy-senate-president-ike-ekweremadu-1762942662700",
    "headline": "Nigeria Submits Formal Request for Prison Transfer of Former Deputy Senate President, Ike Ekweremadu",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria has dispatched a high-level delegation to begin discussions with the UK government over the possibility of former Deputy Senate President Ike Ekweremadu serving out the remainder of his prison sentence in the United Kingdom for human trafficking and organ harvesting in Nigeria.\n\nThe delegation, which included the Minister of Foreign Affairs, Yusuf Tuggar, and the Attorney General and Minister of Justice, Lateef Fagbemi.\n\nA source says that a formal request for a prisoner transfer to allow Ekweremadu to serve the remainder of his sentence in Nigeria has been submitted.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/bc479987-b52d-4f7d-b912-5d891782f21e.jpg",
    "timestamp": "2025-11-12T10:17:42.700Z"
  },
  {
    "slug": "tense-standoff-in-abuja-between-soldiers-and-fct-minister-nyesom-wike-1762942349835",
    "headline": " Tense Standoff  in Abuja Between Soldiers and FCT Minister, Nyesom Wike",
    "kicker": "",
    "summary": "",
    "bodyText": "A tense standoff occurred in Abuja on Tuesday when soldiers prevented the Federal Capital Territory Minister, Nyesom Wike, and officials of the FCTA from accessing disputed estate land.\n\nA viral video shows the soldiers blocking the minister’s convoy, leading to a heated verbal exchange between Wike and one of the officers.\n\nWike accused the soldiers of obstructing lawful government activities, while the officer insisted he was acting on orders and that the land was “legally acquired.”\n\nThe confrontation, which quickly escalated, drew public attention and highlighted growing tensions over land disputes in the FCT.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/54aa7b0d-c907-456e-849e-f4421fb92512.jpg",
    "timestamp": "2025-11-12T10:12:29.835Z"
  },
  {
    "slug": "catherine-connolly-has-been-sworn-in-as-the-10th-president-of-the-republic-of-ireland-1762941923294",
    "headline": "Catherine Connolly has been sworn in as the 10th President of the Republic of Ireland.",
    "kicker": "",
    "summary": "",
    "bodyText": "Catherine Connolly has been sworn in as the 10th President of the Republic of Ireland.\n\nConnolly, speaking at Dublin Castle, where she was inaugurated, said she was looking forward to her first visit to Northern Ireland as president and that she would foster an inclusive dialogue across the island.\n\nConnolly was elected in a landslide vote at the end of October, defeating Fine Gael candidate Heather Humphreys.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/1aac99cb-248c-451a-8e17-942183b007f7.jpg",
    "timestamp": "2025-11-12T10:05:23.294Z"
  },
  {
    "slug": "super-eagles-boycott-training-session-1762941611712",
    "headline": "Super Eagles Boycott Training Session",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria’s Super Eagles on Tuesday boycotted their training session ahead of Thursday’s must-win 2026 FIFA World Cup playoff against Gabon.\n\nReports from the Morocco camp of the eagles cited the non-payment of allowances and bonuses dating back to 2019.\n\nAlready in camp are 23 players, including Osimhen, Alex Iwobi, Wilfred Ndidi, William Troost-Ekong, Calvin Bassey, Samuel Chukwueze, and Ademola Lookman, with goalkeeper Maduka Okoye still expected to arrive.\n\nThe Super Eagles are expected to resume training on Wednesday, pending a resolution of the financial dispute, as they seek to stay focused ahead of what is widely regarded as one of Nigeria’s most crucial fixtures in recent years.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/35ff89d0-9f02-4fe0-82f1-a3f93519a4ad.jpg",
    "timestamp": "2025-11-12T10:00:11.712Z"
  },
  {
    "slug": "sabrina-carpenter-makes-big-screen-return-1762941481478",
    "headline": "Sabrina Carpenter Makes Big Screen Return",
    "kicker": "",
    "summary": "",
    "bodyText": "Grammy-winning American singer Sabrina Carpenter is making a return to the big screen after a long break from acting in a new musical inspired by Lewis Carroll's Alice in Wonderland.\n\nIt will be Carpenter's first leading role in a theatrical motion picture.\n\nClose sources say the ‘Expresso’ hitmaker will also produce the as-yet unnamed film, which will be released by Universal Pictures and is to be written and directed by Lorene Scafaria.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d2a6fb21-f208-4559-b8de-0006e0b9a21f.jpeg",
    "timestamp": "2025-11-12T09:58:01.478Z"
  },
  {
    "slug": "squid-game-star-o-yeong-su-acquitted-of-sexual-misconduct-charges-1762941356987",
    "headline": "Squid Game Star O Yeong-Su, Acquitted of Sexual Misconduct Charges",
    "kicker": "",
    "summary": "",
    "bodyText": "Squid Game star O Yeong-Su has been acquitted of sexual misconduct charges by a court in South Korea.\n\nYeong-Su, 81, was charged in 2022 with sexually assaulting a woman twice. The allegations said that he hugged the woman and kissed her on the cheek against her will.\n\nHowever, he was found guilty in 2024 and given an eight-month suspended prison sentence but said he would appeal against the verdict.\n\nOn Tuesday, a court overturned his sentence, saying he had undergone classes on sexual violence and suggesting that the alleged victim's memory may have been \"distorted,\" considering how long ago the incident occurred.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3b307bc2-1e25-4db1-9454-ed55187c9e9b.webp",
    "timestamp": "2025-11-12T09:55:56.987Z"
  },
  {
    "slug": "vip-protection-vs-community-safety-1762900265291",
    "headline": "VIP Protection vs. Community Safety",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "A new report by the European Union Agency for Asylum reveals that over 100,000 police\nofficers in Nigeria are assigned to VIPs, leaving ordinary citizens with limited protection.\n\nOut of a total police force of 371,800, this has contributed to slow emergency\nresponses, corruption, and weak accountability.\n\nExperts and policy advisers, including Hadiza Bala-Usman, have called for reforms to\nallow private security firms to handle VIP protection, freeing the police to focus on\nnational security and community policing.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/20d22de6-9276-45a4-b6d0-5f62faaa20f3.jpeg",
    "timestamp": "2025-11-11T22:31:05.291Z"
  },
  {
    "slug": "nigerians-jailed-in-london-phone-robbery-spree-1762900131076",
    "headline": "Nigerians Jailed in London Phone Robbery Spree",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "Four Nigerians received lengthy prison sentences in the UK for their roles in a violent\nphone robbery syndicate.\n\n The gang carried out 13 coordinated robberies targeting\nmobile phone outlets in London, stealing devices valued at £240,000.\n\nA total of ten suspects were tried, with eight pleading guilty to conspiracy to rob,\nreceiving a combined 55 years in prison. \n\nThe case highlights the dangers of organised\ncrime and the importance of vigilance at home and abroad",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6614a71d-fed9-43b6-b411-8d00aa6da4c4.jpeg",
    "timestamp": "2025-11-11T22:28:51.076Z"
  },
  {
    "slug": "the-grammys-and-the-illusion-of-recognition-how-afrobeats-is-being-boxed-not-celebrated-1762899818074",
    "headline": "The Grammys and the Illusion of Recognition: How Afrobeats is Being Boxed, Not Celebrated ",
    "kicker": "By QuincyJonze",
    "summary": "",
    "bodyText": "In recent years, the global music landscape has witnessed the undeniable rise of African sound, a vibrant fusion of rhythm, culture, and storytelling that has birthed what the world now casually labels “Afrobeats.”\n\nFrom Lagos to London, Johannesburg to New York, the genre has transcended borders, inspiring dance floors and dominating charts. Yet, beneath the applause and the seemingly flattering “African categories” at the Grammy Awards lies a more uncomfortable truth: what appears to be recognition is, in reality, a carefully orchestrated form of exploitation.\n\nWhen Ckay’s Love Nwantiti went viral across continents, charting in over 30 countries and becoming one of the most-streamed songs globally, it wasn’t simply a Nigerian success story; it was a global phenomenon. The same can be said for Rema’s Calm Down, which shattered streaming records and held the Billboard Hot 100 hostage for months, and Wizkid and Tems’ Essence, a soulful masterpiece that even Justin Bieber couldn’t resist jumping on. These were not just African hits; they were world hits — songs that resonated with listeners in Paris, New Delhi, and Los Angeles alike.\n\nYet, despite this global resonance, none of these tracks found a place in the Record of the Year or Song of the Year categories at the Grammys. Instead, they were grouped into the new “Best African Music Performance” category, a move the Recording Academy frames as inclusion, but which, upon closer inspection, appears to be containment. By isolating African excellence into its own box, the Grammys conveniently avoid allowing African artists to compete on equal footing with their Western counterparts.\nThis pattern betrays a deeper discomfort within the global music establishment. The Western world is eager to consume Afrobeats to dance to it, brand with it, and profit from its infectious rhythm but reluctant to legitimise it as an equal. The creation of the Afrobeats category feels less like progress and more like partition. It’s a symbolic pat on the back, not a seat at the main table.\n\nThe irony runs deeper when one considers that “Afrobeat” (singular) was not invented by the Grammys or any Western institution. It was pioneered by Fela Anikulapo Kuti and the Kuti family, a politically charged, musically sophisticated art form that challenged power structures and redefined African expression. The newer “Afrobeats” (plural), a more commercial evolution of that legacy, has carried the continent’s sound into global consciousness. Yet, rather than honour that lineage authentically, the West has repackaged it as an exotic export a flavour of the moment rather than a foundation of musical innovation.\n\nConsider Burna Boy, a Grammy winner, global performer, and cultural ambassador whose albums have sold out arenas from Madison Square Garden to Paris La Défense. Or Tyla, whose Water became a global anthem and earned her a viral spotlight most pop stars dream of. Both are household names, yet they too find themselves boxed in the “African categories,” rarely acknowledged as contenders for the main awards they’ve clearly earned the right to contest.\n\nThe message this sends is subtle but insidious: African artists can be popular, but not peerless; they can entertain the world, but not define it. The Grammys’ selective recognition reinforces a hierarchy that privileges Western artistry while commodifying African creativity for cultural cachet.\n\nIn truth, Afrobeats does not need the Grammys for validation. The world has already spoken in streams, in stadiums, in dance challenges, and in cultural crossovers that have reshaped global pop, but as long as institutions like the Grammys continue to frame African brilliance as an annex rather than a cornerstone, the celebration will always be laced with exploitation.\n\nIf the Recording Academy truly seeks to honor music’s global evolution, it must stop treating Africa as a genre and start acknowledging it as a force. Because what artists like Wizkid, Tems, Rema, Ckay, Burna Boy, Tyla, and many others have built is not a niche — it’s the sound of a generation. And it deserves not just a category, but its rightful place in the world’s biggest conversations about art, innovation, and excellence.\n \n- QuincyJonze",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/da929720-7a44-416d-bd09-4307150a3b3c.jpeg",
    "timestamp": "2025-11-11T22:23:38.074Z"
  },
  {
    "slug": "entertainment-highlights-seyi-vibez-and-pretty-mike-dominate-the-conversation-1762899569395",
    "headline": "Entertainment Highlights: Seyi Vibez and Pretty Mike Dominate the Conversation",
    "kicker": "By QueenDivavee ",
    "summary": "",
    "bodyText": "Seyi Vibez, has announced his upcoming project ‘Fuji Moto,’ dropping November 14, 2025. The announcement sparked conversations around how Seyi continues to blend Fuji culture with modern Afrobeats sound — proving that originality still pays off in an industry full of trends.\n\nANightlife influencer Pretty Mike, who recently made headlines after being granted ₦50 million bail following his arraignment for alleged drug-related offences. \n\nWe reflected on the balance between fame, public image, and accountability — asking listeners whether celebrity lifestyle choices should affect their credibility or if everyone deserves the chance to rebuild after mistakes.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2e3bf5ff-02a5-4a7c-b901-6180ee8c11e5.jpeg",
    "timestamp": "2025-11-11T22:19:29.395Z"
  },
  {
    "slug": "insecurity-naf-strikes-kill-terrorists-bandits-in-borno-kwara-katsina-others-1762855817544",
    "headline": "Insecurity: NAF Strikes Kill Terrorists, Bandits in Borno, Kwara, Katsina, Others ",
    "kicker": "",
    "summary": "",
    "bodyText": "Numerous Islamic State of West Africa Province (ISWAP) terrorists were killed by a series of precision airstrikes carried out by the Nigerian Air Force (NAF) in the Mallam Fatori and Shuwaram regions of Borno State as part of the NAF's increased nationwide counterterrorism and counterbanditry operations.\n\nThis occurred as members of the FCT Police Anti-Kidnapping Unit conducted a special church patrol in forests and border communities connecting Bwari in Kaduna State, Bwari in Niger State, and Gwagwalada, also in Niger State, in collaboration with Department of State Services (DSS) employees, local hunters, and vigilante groups.\nAt least four nursing mothers were reportedly abducted by bandits yesterday in Yan Kwada village, Faruruwa community, in the Shanono Local Government Area of Kano State.\n\nAdditionally, Governor Abdullahi Sule of Nasarawa State has ordered a manhunt for the gunmen who attacked residents of the Sarkin Noma community in the Keana Local Government Area at midnight, promising to bring the perpetrators to justice as soon as possible. Meanwhile, Dr. Nasir Idris, the governor of Kebbi State, boasted yesterday that not a single square inch of his state was occupied by armed bandits.\n\nIn a similar vein, the Islamic State of West Africa Province (ISWAP), Jam'at Ahl as-Sunna lid-Da'wa wa'l-Jihd (JAS), and Boko Haram factions engaged in a deadly battle at Toumbun Gini, an island community in Borno State's Abadam Local Government Area, that left over 100 people dead.\n\n\"The coordinated missions, executed on November 9, 2025, represent a decisive phase in ongoing joint operations under Operation Hadin Kai and Operation Fasan Yamma, aimed at degrading terrorist and criminal networks across Nigeria's northern theatres,\" stated Air Commodore Ehimen Ejodame, Director of Public Relations and Information, NAF, who made these announcements yesterday.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2292b0d4-5b4f-49bf-bc88-cd19dfece844.png",
    "timestamp": "2025-11-11T10:10:17.544Z"
  },
  {
    "slug": "chief-timipre-sylva-declared-wanted-1762855099060",
    "headline": "Chief Timipre Sylva Declared Wanted",
    "kicker": "",
    "summary": "The Economic and Financial Crimes Commission (EFCC) yesterday declared former Minister of State for Petroleum Resources and ex-Governor of Bayelsa State, Chief Timipre Sylva, wanted over an alleged case of conspiracy and dishonest conversion of $14,859,257.",
    "bodyText": "The Economic and Financial Crimes Commission (EFCC) yesterday declared former Minister of State for Petroleum Resources and ex-Governor of Bayelsa State, Chief Timipre Sylva, wanted over an alleged case of conspiracy and dishonest conversion of $14,859,257.\n\nThe amount is said to be part of the funds injected by the Nigerian Content Development and Monitoring Board (NCDMB) into Atlantic International Refinery and Petrochemical Limited for the construction of a refinery in Bayelsa State.\n\nBut Sylva has dismissed the allegations, describing them as another persecution and smear campaign by his political enemies, just as he claimed there was no due process by the EFCC in declaring him wanted.\n\nA statement by the EFCC’s Head of Media and Publicity, Mr. Dele Oyewale, said the commission secured a warrant for Sylva’s arrest from a Federal High Court sitting in Lagos on November 6.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ca911f12-f318-455b-8579-e742155f6517.jpeg",
    "timestamp": "2025-11-11T09:58:19.060Z"
  },
  {
    "slug": "anambra-decides-2025-1762848822864",
    "headline": "Anambra Decides 2025",
    "kicker": "",
    "summary": "",
    "bodyText": "The people of Anambra State went to the polls on Saturday, November 8, 2025, to elect their governor for the next four years. The election, conducted by the Independent National Electoral Commission (INEC), attracted widespread attention across Nigeria due to the state’s political significance and history of competitive elections.\n \nThe race was primarily between the incumbent governor, Professor Chukwuma Charles Soludo of the All Progressives Grand Alliance (APGA), and Nicholas Ukachukwu of the All Progressives Congress (APC). Other notable contenders included George Moghalu of the Labour Party (LP), John Chuma-Nwosu of the African Democratic Congress (ADC), and Paul Chukwuma of the Young Progressives Party (YPP). Soludo, a former Central Bank Governor and a technocrat-turned-politician, sought re-election on the strength of his first-term achievements, including infrastructure development, youth empowerment, and public sector reforms. His campaign message focused on continuity and consolidation of his “Anambra Agenda” aimed at turning the state into a hub for investment and innovation in the Southeast. Ukachukwu and other opposition candidates, however, argued that the incumbent had failed to meet expectations on job creation, security, and inclusiveness in governance, urging voters to seek change.\n \nAccording to INEC data, Anambra had 2,802,790 registered voters, with women making up slightly more than half. However, turnout was low across most polling units, with reports indicating that fewer than 20% of registered voters cast their ballots. Observers from civil society groups noted that while the voting process was largely peaceful and orderly, the low participation reflected growing voter apathy and disillusionment with the political class. Security presence across the state was heavy, with thousands of police officers and soldiers deployed to maintain calm. Although a few isolated incidents of intimidation and vote-buying were reported in some local government areas, the election was generally free from major violence or disruptions.\n \nAfter collation at the state INEC headquarters in Awka, Professor Chukwuma Soludo was declared the winner of the election. He polled a total of 422,664 votes, defeating his closest rival, Nicholas Ukachukwu of the APC, who secured 99,445 votes. The Labour Party’s George Moghalu came in a distant third. INEC recorded 584,054 valid votes and 11,244 rejected ballots. In a remarkable show of dominance, Soludo won in all 21 Local Government Areas of Anambra State — a rare political feat that underscored APGA’s enduring grassroots structure and brand strength in the region.\n \nThe result sparked mixed reactions. Supporters of APGA celebrated across major towns, particularly in Awka, Onitsha, and Nnewi, hailing Soludo’s re-election as a victory for continuity and progress. Opposition figures, however, criticized the process, citing widespread vote-buying and voter intimidation. Civil society organizations and election observers echoed similar concerns, calling for deeper electoral reforms to restore citizens’ confidence in Nigeria’s democratic institutions. Despite the criticisms, the general consensus was that the 2025 election represented a relatively peaceful democratic exercise compared to previous cycles in the state.\n \nSoludo’s landslide victory offers both opportunity and challenge. On one hand, his overwhelming mandate grants him political legitimacy and the freedom to push forward with his development agenda. On the other, the low voter turnout raises important questions about civic engagement and the health of democracy in the state. For Anambra’s leadership, the next four years will be critical in addressing unemployment, youth restiveness, and infrastructural decay — issues that dominated pre-election debates. The administration will also be expected to deliver tangible improvements in education, healthcare, and local government empowerment. Politically, APGA’s sweeping victory reaffirms its dominance in Anambra State, even as the Labour Party and APC continue to strengthen their grassroots networks in the Southeast. The opposition will likely turn to the courts or public campaigns to challenge aspects of the electoral process.\n \nGovernor Soludo’s second term will test his ability to build trust among disenchanted voters and maintain a balance between technocratic efficiency and political inclusion. Analysts believe his re-election could either consolidate his reputation as a reform-minded leader or expose the limitations of incumbency politics in a challenging socio-economic climate. Beyond Anambra, the election also sends a national message: voter turnout and electoral integrity remain key issues in Nigeria’s democratic evolution. The state’s experience underscores the need for stronger political education, anti-corruption measures during elections, and more transparent campaign financing.\n \nThe 2025 Anambra Governorship Election reaffirmed APGA’s political dominance under Chukwuma Soludo, who now faces the task of transforming his electoral success into meaningful governance. While the election was largely peaceful, the pervasive voter apathy and allegations of vote-buying reflect deeper systemic issues. As Soludo prepares for another four years, the people of Anambra — and indeed Nigeria — will be watching closely to see whether his second term delivers not just continuity, but renewed confidence in leadership and democracy itself.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/956147a4-8bef-4791-b600-41d0b2a7ae78.jpeg",
    "timestamp": "2025-11-11T08:13:42.864Z"
  },
  {
    "slug": "wafu-b-glory-falconets-cruise-past-benin-to-maintain-perfect-run-1762794318338",
    "headline": "WAFU B Glory: Falconets Cruise Past Benin to Maintain Perfect Run",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria’s Falconets maintained their perfect start at the 2025 WAFU B U-20 Girls Cup with a dominant 3-0 victory over Benin Republic at the Stade Adjanhou on Sunday.\n\nForward Ramotalahi Kareem was the driving force once again, scoring twice to inspire the defending champions to another commanding performance.\n\nThe Falconets, wasted no time stamping their authority on the match as Kareem opened the scoring in the 15th minute after a well-worked team move.\n\nBenin’s Amazons showed determination and moments of courage in front of their home crowd, but Nigeria’s fluid attacking play proved too much to handle.\n\nKareem doubled the lead in the 59th minute, calmly slotting past the Beninese goalkeeper to put the result beyond doubt.\n\nSubstitute Precious Oscar added the final flourish deep into stoppage time, finishing off a flowing counter-attack to seal a comprehensive 3-0 win for the Falconets.\n\nFor her brace and tireless display, Kareem was named Player of the Match. The victory leaves Nigeria top of the three-team tournament and firmly on course for a top-place finish as they continue their pursuit of back-to-back regional titles.\n\nNigeria’s defensive solidity and clinical finishing have made them early favourites to retain their WAFU B crown.\n\nWith two convincing victories and six goals scored in as many games, the Falconets have once again demonstrated their dominance in West African women’s football as they face Ghana and Benin again on Tuesday and Wednesday, respectively.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/69705628-4cb4-4dcd-8f6b-de26ca361255.jpg",
    "timestamp": "2025-11-10T17:05:18.338Z"
  },
  {
    "slug": "chaos-in-katsina-player-injured-during-katsina-united-vs-barua-fc-clash-1762794105157",
    "headline": "Chaos in Katsina: Player Injured During Katsina United vs Barua FC Clash",
    "kicker": "",
    "summary": "",
    "bodyText": "Fresh concerns have emerged over player safety in the Nigeria Premier Football League (NPFL) after Barau FC midfielder, Nana Abraham, was allegedly stabbed in the neck by a pitch invader during his team’s away match against Katsina United at the Muhammadu Dikko Stadium on Saturday. \n\nOn a closer look in a video circulated on social media, it was a stone been thrown at the player causing a cut in the neck area, and it was attended to swiftly by the medical team on ground, as play was stopped to that effect. \n\nThe shocking incident occurred moments after Barau FC scored a 69th-minute equaliser in the tense encounter.\n\nImages circulating on social media showed Abraham bleeding heavily from the neck while receiving emergency medical attention on the pitch.\n\nHe was later substituted and taken to a nearby hospital, where he is said to be responding to treatment.\n\nIt follows several similar episodes that have marred the 2025/26 NPFL season, raising serious concerns about the effectiveness of crowd control and stadium safety.\n\nIn October, the NPFL handed down heavy sanctions to Kano Pillars after fans invaded the Sani Abacha Stadium pitch during a Matchday 8 clash against Shooting Stars Sports Club (3SC).\n\nThe violent scenes erupted moments after 3SC scored a dramatic 94th-minute equaliser.\n\nSeveral match officials and away team players were assaulted in the chaos, prompting the league to impose a ₦9.5 million fine, deduct three points and three goals from Pillars’ record, while also banning the team from their Sani Abacha Stadium home ground for at least 10 home matches.\n\nIn an October decision signed by NPFL’s Chief Operating Officer Davidson Owumi, the league management vowed to maintain “a zero-tolerance policy for violence,” warning that any future infractions would attract even stiffer penalties.\n\n“We will invoke the rules wherever and whenever required to keep bad behaviour of fans, players and officials out of the league,” Mr Owumi said in the statement released on October 13.\n\nThat statement, now more relevant than ever, underscores the NPFL’s ongoing struggle to translate disciplinary pronouncements into consistent deterrence. Despite multiple sanctions, violence has persisted at alarming levels.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/424ed144-9bd5-4eca-8ae3-7699de89c653.jpeg",
    "timestamp": "2025-11-10T17:01:45.157Z"
  },
  {
    "slug": "super-eagles-begin-camp-as-full-squad-list-drops-ahead-of-qualifiers-1762793911359",
    "headline": "Super Eagles Begin Camp as Full Squad List Drops Ahead of Qualifiers",
    "kicker": "",
    "summary": "Nigeria’s Head Coach, Eric Chelle, has named a 24-man squad for the decisive 2026 FIFA World Cup African Play-off Tournament in Rabat, Morocco, recalling goalkeeper Maduka Okoye, Spain-based forward Chidera Ejuke, and midfielder Raphael Onyedika for the crucial encounter.",
    "bodyText": "Nigeria’s Head Coach, Eric Chelle, has named a 24-man squad for the decisive 2026 FIFA World Cup African Play-off Tournament in Rabat, Morocco, recalling goalkeeper Maduka Okoye, Spain-based forward Chidera Ejuke, and midfielder Raphael Onyedika for the crucial encounter.\n\nBright Osayi-Samuel who was injured in the last qualifying window is also in the roster made public on Saturday.\n\nThe Super Eagles will face Gabon in the first semi-final at the 22,000-capacity Complexe Sportif Prince Héritier Moulay El Hassan on Thursday, while Cameroon take on DR Congo in the other semi-final at the El-Barid Stadium.\n\nChelle’s list features the core of Nigeria’s experienced internationals alongside a few returning and emerging names as the Super Eagles seek redemption after their underwhelming group campaign.\n\nCaptain William Troost-Ekong, striker Victor Osimhen, and first-choice goalkeeper Stanley Nwabali headline the squad, which also includes defender Calvin Bassey and young prospect Benjamin Fredericks.\n\nIn midfield, the experienced duo of Alex Iwobi and Wilfred Ndidi return, alongside Frank Onyeka and Alhassan Yusuf, while Onyedika’s inclusion adds depth and structure to Chelle’s transitional plans.\n\nIn attack, Chelle has gone for a balance of flair and form, with Ademola Lookman, Samuel Chukwueze, Moses Simon, and Osimhen joined by Ejuke, Tolu Arokodare, Jerome Akor Adams, and Olusegun Olakunle — all players capable of offering pace, width, and goal threat in a game of high stakes.\n\nDefender Semi Ajayi is suspended for the semi-final after picking up two yellow cards during the 10-match qualifying series.\n\nThe Hull City man will be available only if Nigeria advances to the final round.\n\nThe players are expected to arrive in Rabat from their respective club bases on Monday, 10 November, ahead of a four-day closed training camp.\n\nThe winner of the Nigeria–Gabon tie will face either Cameroon or DR Congo for a place in the final qualifying phase, where Africa’s representatives for the global tournament will be decided.\n\n24 Super Eagles for 2026 FIFA World Cup Africa Play-Off Tournament\n\nGoalkeepers: Stanley Nwabali (Chippa United, South Africa); Amas Obasogie (Singida Blackstars, Tanzania); Maduka Okoye (Udinese FC, Italy)\n\nDefenders: William Ekong (Al-Kholood, Saudi Arabia); Calvin Bassey (Fulham FC, England); Oluwasemilogo Ajayi (Hull City, England); Bright Osayi-Samuel (Birmingham City, England); Bruno Onyemaechi (Olympiakos, Greece); Chidozie Awaziem (Nantes FC, France); Zaidu Sanusi (FC Porto, Portugal); Benjamin Fredericks (Dender FC, Belgium)\n\nMidfielders: Alex Iwobi (Fulham FC, England); Frank Onyeka (Brentford FC, England); Alhassan Yusuf Abdullahi (New England Revolution, USA); Wilfred Ndidi (Besiktas FC, Turkey); Raphael Onyedika (Club Brugge, Belgium)\n\nForwards: Ademola Lookman (Atalanta BC, Italy); Samuel Chukwueze (Fulham FC, England); Victor Osimhen (Galatasaray FC, Turkey); Moses Simon (Paris FC, France); Chidera Ejuke (Sevilla FC, Spain); Tolu Arokodare (Wolverhampton Wanderers, England); Akor Adams (Sevilla FC, Spain); Olakunle Olusegun (Pari Nizhny Novgorod, Russia).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cd368b75-2e2b-4161-b29d-f4eb14968da3.jpg",
    "timestamp": "2025-11-10T16:58:31.359Z"
  },
  {
    "slug": "soludo-extends-olive-branch-1762789847343",
    "headline": "SOLUDO EXTENDS OLIVE BRANCH",
    "kicker": "",
    "summary": "",
    "bodyText": "Governor Chukwuma Charles Soludo has extended an olive branch to his fellow contestants following his sweeping victory in the November 8 Anambra governorship election.\n\nIn a statement, Soludo expressed appreciation to all those who participated in the race, including Nicholas Ukachukwu, Paul Chukwuma, George Moghalu, and others, acknowledging their shared commitment to the development of Anambra State.\n\nHe urged his opponents and their supporters to put political differences aside and join hands in advancing the state’s common goals — improved infrastructure, job creation, and enhanced community security.\n\nSoludo reaffirmed his pledge to run an inclusive and transparent government that listens to all voices, including dissenting ones.\n\nHe called on the people of Anambra to unite behind a collective vision of progress, saying his renewed mandate is an opportunity to build a stronger, more prosperous state for all.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/902d1345-1b1f-4094-90b9-35c2841ad466.webp",
    "timestamp": "2025-11-10T15:50:47.343Z"
  },
  {
    "slug": "soludo-re-elected-sweeps-all-21-lgas-in-anambra-poll-1762784068633",
    "headline": "SOLUDO RE-ELECTED, SWEEPS ALL 21 LGAS IN ANAMBRA POLL",
    "kicker": "",
    "summary": "",
    "bodyText": "Governor Charles Soludo of APGA has been reelected for a second term, winning all 21 local government areas with 422,664 votes.\n\nAPC's Nicholas Ukachukwu came second with 99,445 votes.\n\nTinubu and Nige congratulated Soludo, while LP's Moghalu and ADC's Nwosu rejected the results, alleging vote-buying. \n\nVoter turnout was 21.45%.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/374a433f-ac2b-444a-802d-98c77414a4c0.jpeg",
    "timestamp": "2025-11-10T14:14:28.633Z"
  },
  {
    "slug": "fayose-meets-obasanjo-in-ogun-1762783856804",
    "headline": "Fayose Meets Obasanjo in Ogun",
    "kicker": "",
    "summary": "",
    "bodyText": "A former Governor of Ekiti State, Ayodele Fayose, paid a visit to ex-President Olusegun Obasanjo at his residence in Abeokuta, Ogun State, yesterday, ahead of Fayose’s upcoming 65th birthday on November 15.\n\nPhotos shared on X by the Senior Special Assistant on Public Communication and Social Media to the FCT Minister, Nyesome Wike, Lere Olayinka, captured the two leaders in warm moments, signalling an end to years of public animosity.\n\nThe meeting also comes amid a series of high-profile visits to Fayose in the lead-up to his birthday, including one from former Vice President Yemi Osinbajo on Tuesday.\n\nOsinbajo said he decided to visit Fayose ahead of the celebration because he would not be available on the day of the event.\n\nDuring the visit, both leaders exchanged warm pleasantries and reflected on national issues, with Osinbajo commending Fayose’s courage and consistency in public life.\n\nFayose, in turn, expressed appreciation for the visit, describing it as a mark of respect and friendship across political lines",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d787fe80-3861-4149-82dc-2919a2a6b7be.jpg",
    "timestamp": "2025-11-10T14:10:56.804Z"
  },
  {
    "slug": "man-dies-after-attempting-to-flee-efcc-raid-in-lekki-1762783647096",
    "headline": "Man Dies After Attempting to Flee EFCC Raid in Lekki",
    "kicker": "",
    "summary": "",
    "bodyText": "A man identified as Endurance Udeke has died after jumping from a four-storey building during a raid conducted by operatives of Nigeria’s Economic and Financial Crimes Commission (EFCC) in the Lekki area of Lagos.\n\nThe EFCC confirmed the incident in a statement issued on Saturday, saying the operation, which took place on 4 November, targeted suspected internet fraudsters residing at Periwinkle Estate, Lekki Phase 1.\n\nAccording to the agency, four suspects were arrested during the sting operation, while Udeke and another resident attempted to escape after learning of the EFCC’s presence.\n\nThe second individual survived after receiving treatment and has since been stabilised, according to EFCC officials.\n\nThe anti-graft agency stressed that its operatives had no physical contact with Udeke before the incident, describing his action as tragic and unnecessary.\n\nThe agency added that the case has been handed over to the police for further investigation into the circumstances surrounding Udeke’s death.\n\nThe EFCC urged the public to remain calm and cooperate during its lawful operations, insisting that its raids are conducted in accordance with due process.\n\nThe incident comes amid growing scrutiny of EFCC operations following several controversial raids in recent months.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b6d2f418-2a7f-4aa1-940f-73065f6e5d65.webp",
    "timestamp": "2025-11-10T14:07:27.096Z"
  },
  {
    "slug": "at17-conversation-regina-daniels-ned-nwoko-1762774448776",
    "headline": "#At17 Conversation: Regina Daniels & Ned Nwoko",
    "kicker": "",
    "summary": "",
    "bodyText": "Following up with the trending #At17 discussion, Regina Daniels has stated that she was married at 17 and challenged Ned Nwoko to address allegations about her past, including claims around drug use.\n\nNed has responded, describing the viral video involving Regina’s family, where thugs\nwere allegedly sent to intimidate her — as a “Nollywood script.”\n\nBeyond the headlines, this story touched on deeper issues such as:\n- Age and consent in relationships\n- Power dynamics in marriages\n- How social media fuels narratives and shapes public opinion\n\nIt’s a reminder that celebrity stories often reflect broader societal conversations about\ninfluence, vulnerability, and accountability.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/51634bef-707d-47d8-990c-c85a8987cecb.jpeg",
    "timestamp": "2025-11-10T11:34:08.776Z"
  },
  {
    "slug": "uk-flags-21-nigerian-states-as-high-risk-1762774166090",
    "headline": "UK Flags 21 Nigerian States as High-Risk",
    "kicker": "",
    "summary": "",
    "bodyText": "The UK has updated it's travel advisory, warning citizens against traveling to 21 Nigerian states due to rising insecurity.\n\nThe advisory pointed to kidnapping, violent crime, and intercommunal clashes across regions — from the Northeast and Northwest to parts of the Southeast, the capital territory, and even concerns around crime levels in Lagos.\n\nFor many Nigerians, this is not shocking news — it simply underscores the security realities people face daily. It also raises important questions about governance, stability, and how international perception affects travel, business, and global\nengagement with Nigeria.\n\nThe core message is clear: staying informed and safety-conscious is essential.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6fa1f400-8ed2-44cc-b4be-98226716506f.jpg",
    "timestamp": "2025-11-10T11:29:26.090Z"
  },
  {
    "slug": "special-adviser-to-the-lagos-state-governor-on-tourism-arts-culture-mr-idris-aregbe-celebrates-birthday-in-lagos-1762700254252",
    "headline": "Special Adviser to the Lagos State Governor on Tourism, Arts & Culture, Mr. Idris Aregbe Celebrates Birthday in Lagos",
    "kicker": "",
    "summary": "",
    "bodyText": "A very happy birthday to Mr. Idris Aregbe the Special Adviser to the Lagos State Governor on Tourism, Arts & Culture, Lagos State.\n\nIn attendance to his birthday celebration yesterday were Nollywood actresses, Ini Edo & Juliet Ibrahim among other dignitaries and personalities.\n\nThe Base Fm team wishes him many more fruitful years.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a43471e9-0e34-46ab-a6a4-274b2d7f39d6.jpeg",
    "timestamp": "2025-11-09T14:57:34.252Z"
  },
  {
    "slug": "anambra-election-soludo-wins-own-polling-unit-1762633436918",
    "headline": "Anambra Election: Soludo Wins Own Polling Unit",
    "kicker": "",
    "summary": "",
    "bodyText": "Despite BVAS malfunction Governor Charles Soludo of APGA has won his polling unit in the Anambra governorship election, polling 417 votes at Ofiyi Square, Isuofia Ward, Aguata LGA. APC's Nicholas Ukachukwu got 4 votes, and ACCORD's candidate scored 1. Out of 933 registered voters, 430 were accredited, with 422 valid votes.\nVoting was briefly disrupted by a BVAS malfunction, but Soludo's strong local showing reflects solid grassroots support as results collation continues statewide.\nSource: Punch News",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/735ea883-f49f-4ffe-9a9f-3f8a7dde5959.jpeg",
    "timestamp": "2025-11-08T20:23:56.918Z"
  },
  {
    "slug": "burna-boy-davido-ayra-starr-wizkid-make-2026-grammy-nominations-list-1762556467709",
    "headline": "Burna Boy, Davido, Ayra Starr, Wizkid make 2026 Grammy Nominations List",
    "kicker": "",
    "summary": "The 2026 Grammy nominations revealed last night, with artists, albums, and songs competing for honours at the 68th annual ceremony.",
    "bodyText": "Burna Boy received two nominations, Best African Music Performance for “Love” and Best Global Music Album for “No Sign of Weakness,” making him the highest-nominated African artist this year.\n\nOther Nigerian stars on the list include Davido, Omah Lay, Ayra Starr, and Wizkid, alongside continental heavyweights such as Angélique Kidjo (Benin), Eddy Kenzo (Uganda), Tyla (South Africa), and Youssou N’Dour (Senegal).\n\nSee the full list of nominees below:\nAlbum of the Year\nBad Bunny – DeBÍ TiRAR MáS FOToS\nJustin Bieber – Swag\nSabrina Carpenter – Man’s Best Friend\nClipse – Let God Sort Em Out\nLady Gaga – Mayhem\nKendrick Lamar – GNX\nLeon Thomas – Mutt\nTyler, the Creator – Chromakopia\n\nRecord of the Year\nBad Bunny – “DtMF”\nSabrina Carpenter – “Manchild”\nDoechii – “Anxiety”\nBillie Eilish – “Wildflower”\nLady Gaga – “Abracadabra”\nKendrick Lamar with SZA – “Luther”\nChappell Roan – “The Subway”\nRosé and Bruno Mars – “APT.”\n\nSong of the Year\nLady Gaga – “Abracadabra”\nDoechii – “Anxiety”\nRosé and Bruno Mars – “APT.”\n“DtMF” – Bad Bunny\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden” (from KPop Demon Hunters)\nKendrick Lamar with SZA – “Luther”\nSabrina Carpenter – “Manchild”\nBillie Eilish – “Wildflower”\n\nBest African Music Performance\nBurna Boy – “Love”\nDavido Featuring Omah Lay – “With You”\nEddy Kenzo & Mehran Matin – “Hope & Love”\nAyra Starr featuring Wizkid – “Gimme Dat”\nTyla – “Push 2 Start”\n\nBest Global Music Performance\nBad Bunny – “EoO”\nCiro Hurtado – “Cantando en el Camino”\nAngélique Kidjo – “Jerusalema”\nYeisy Rojas – “Inmigrante Y Que?”\nShakti – “Shrini’s Dream” (Live)\nAnoushka Shankar featuring Alam Khan & Sarathy Korwar – “Daybreak”\n\nBest New Artist\nOlivia Dean\nKATSEYE\nThe Marias\nAddison Rae\nSombr\nLeon Thomas\nAlex Warren\nLola Young\n\nSongwriter of the Year, Non-Classical\nAmy Allen\nEdgar Barrera\nJessie Jo Dillon\nTobias Jesso Jr.\nLaura Veltz\n\nProducer of the Year, Non-Classical\nDan Auerbach\nCirkut\nDijon\nBlake Mills\nSounwave\n\nBest Pop Solo Performance\nJustin Bieber – “Daisies”\nSabrina Carpenter – “Manchild”\nLady Gaga – “Disease”\nChappell Roan – “The Subway”\nLola Young – “Messy”\n\nBest Pop Vocal Album\nJustin Bieber – Swag\nSabrina Carpenter – Man’s Best Friend\nMiley Cyrus – Something Beautiful\nLady Gaga – Mayhem\nTeddy Swims – I’ve Tried Everything But Therapy (Part 2)\n\nBest Pop Duo/Group Performance\nCynthia Erivo & Ariana Grande – “Defying Gravity”\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden”\nKATSEYE – “Gabriela”\nRosé and Bruno Mars – “APT.”\nSZA with Kendrick Lamar – “30 for 30”\n\nBest Dance Pop Recording\nSelena Gomez & benny blanco – “Bluest Flame”\nLady Gaga – “Abracadabra”\nZara Larsson – “Midnight Sun”\nTate McRae – “Just Keep Watching”\nPinkPantheress – “Illegal”\n\nBest Traditional Pop Vocal Album\nLaila Biali – Wintersongs\nJennifer Hudson – The Gift Of Love\nElton John & Brandi Carlile – Who Believes In Angels?\nLady Gaga – Harlequin\nLaufey – A Matter Of Time\nBarbra Streisand – The Secret Of Life: Partners, Volume 2\n\nBest Dance Electronic Album\nFKA twigs – Eusexua\nFred again.. – Ten Days\nPinkPantheress – Fancy That\nRüfüs Du Sol – Inhale / Exhale\nSkrillex – Fuck U Skrillex You Think Ur Andy Warhol But Ur Not!! <3\n\nBest Dance/Electronic Recording\nDisclosure & Anderson .Paak – “No Cap”\nFred again.., Skepta, & PlaqueBoyMax – “Victory Lap”\nKaytranada – “Space Invader”\nSkrillex – “Voltage”\nTame Impala – “End of Summer”\n\nBest Rock Album\nDeftones – Private Music\nHaim – I Quit\nLinkin Park – From Zero\nTurnstile – Never Enough\nYungblud – Idols\n\nBest Rock Song\nNine Inch Nails – “As Alive As You Need Me To Be”\nSleep Token – “Caramel\nHayley Williams – “Glum”\nTurnstile – “Never Enough”\nYungblud – “Zombie”\n\nBest Metal Performance\nDream Theater – “Night Terror”\nGhost – “Lachryma”\nSleep Token – “Emergence”\nSpiritbox – “Soft Spine”\nTurnstile – “Birds”\n\nBest Rock Performance\nAmyl and The Sniffers – “U Should Not Be Doing That”\nLinkin Park – “The Emptiness Machine”\nTurnstile – “Never Enough”\nHayley Williams – “Mirtazapine”\nYungblud featuring Nuno Bettencourt, Frank Bello, Adam Wakeman, II – “Changes” (Live From Villa Park, Back To The Beginning)\n\nBest Alternative Music Performance\nBon Iver – “Everything Is Peaceful Love”\nThe Cure – “Alone”\nTurnstile – “Seein’ Stars”\nWet Leg – “Mangetout”\nHayley Williams – “Parachute”\n\nBest Alternative Music Album\nBon Iver – SABLE, fABLE\nThe Cure – Songs Of A Lost World\nTyler, The Creator – Don’t Tap the Glass\nWet Leg – Moisturizer\nHayley Williams – Ego Death At A Bachelorette Party\n\nBest R&B Album\nGivēon – Beloved\nCoco Jones – Why Not More?\nLedisi – The Crown\nTeyana Taylor – Escape Room\nLeon Thomas – Mutt\n\nBest R&B Song\nKehlani – “Folded”\nSummer Walker – “Heart Of A Woman”\nChris Brown Featuring Bryson Tiller – “It Depends”\nDurand Bernarr – “Overqualified”\nLeon Thomas – “Yes It Is”\n\nBest R&B Performance\nJustin Bieber – “Yukon”\nChris Brown Featuring Bryson Tiller – “It Depends”\nKehlani – “Folded”\nLeon Thomas – “Mutt” (Live From NPR’s Tiny Desk)\nSummer Walker – “Heart Of A Woman”\n\nBest Traditional R&B Performance\nDurand Bernarr – “Here We Are”\nLalah Hathaway – “Uptown”\nLedisi – “Love You Too”\nSZA – “Crybaby”\nLeon Thomas – “Vibes Don’t Lie”\n\nBest Progressive R&B Album\nDurand Bernarr – Bloom\nBilal – Adjust Brightness\nDestin Conrad – Love on Digital\nFlo – Access All Areas\nTerrace Martin & Kenyon Dixon – Come As You Are\n\nBest Spoken Word Poetry Album\nQueen Sheba – A Hurricane in Heels: healed people don’t act like that (partially recorded live @City Winery & other places)\nMarc Marcel – Black Shaman\nOmari Hardwick & Anthony Hamilton – Pages\nSaul Williams, Carlos Niño & Friends – Saul Williams meets Carlos Niño & Friends At Treepeople\nMad Skillz – Words For Days Vol. 1\n\nBest Rap Album\nClipse – Let God Sort Em Out\nGloRilla – Glorious\nJID – God Does Like Ugly\nKendrick Lamar – GNX\nTyler, The Creator – Chromakopia\n\nBest Rap Song\nDoechii – “Anxiety”\nClipse featuring John Legend and Voices of Fire – “The Birds Don’t Sing”\nTyler, The Creator featuring GloRilla, Sexyy Red, and Lil Wayne – “Sticky”\nGloRilla – “TGIF”\nKendrick Lamar featuring Lefty Gunplay – “TV Off”\n\nBest Melodic Rap Performance\nFridayy featuring Meek Mill – “Proud Of Me”\nJID featuring Ty Dolla $ign & 6Lack – “Wholeheartedly”\nKendrick Lamar with SZA – “Luther”\nTerrace Martin and Kenyon Dixon featuring Rapsody – “WeMaj”\nPartyNextDoor and Drake – “Somebody Loves Me”\n\nBest Rap Performance\nCardi B – “Outside”\nClipse featuring Kendrick Lamar and Pharrell Williams – “Chains & Whips”\nDoechii – “Anxiety”\nKendrick Lamar featuring Lefty Gunplay – “TV Off”\nTyler, The Creator featuring Teezo Touchdown – “Darling, I”\n\nBest Música Urbana Album\nBad Bunny – DeBÍ TiRAR MáS FOToS\nJ Balvin – Mixteip\nFeid – Ferxxo Vol X: Sagrado\nNicki Nicole – Naiki\nTrueno – Eub Deluxe\nYandel – Sinfónico (En Vivo)\n\nBest Música Mexicana Album (Including Tejano)\nFuerza Regida, Grupo Frontera – Mala Mía\nGrupo Frontera – Y Lo Que Viene\nPaola Jara – Sin Rodeos\nCarín León – Palabra De To’s (Seca)\nBobby Pulido and Friends Una Tuya Y Una Mía – Por La Puerta Grande (En Vivo)\n\nBest Latin Pop Album\nRauw Alejandro – Cosa Nuestra\nAndrés Cepeda – Bogotá (Deluxe)\nKarol G – Tropicoqueta\nNatalia Lafourcade – Cancionera\nAlejandro Sanz – ¿Y ahora qué?\n\nBest Latin Rock or Alternative Album\nAterciopelados – Genes Rebeldes\nAstropical – Astropical\nCa7riel and Paco Amoroso – Papota\nLos Wizzards – Algorhythm\nFito Paez – Novela\n\nBest Tropical Latin Album\nRubén Blades, Roberto Delgado & Orquesta – Fotografías\nGloria Estefan – Raíces\nGrupo Niche – Clásicos 1.0\nAlain Pérez – Bingo\nGilberto Santa Rosa – Debut y Segunda Tanda, Vol. 2\n\nBest Traditional Country Album\nCharley Crockett – Dollar A Day\nLukas Nelson – American Romance\nWillie Nelson – Oh What A Beautiful World\nMargo Price – Hard Headed Woman\nZach Top – Ain’t In It For My Health\n\nBest Contemporary Country Album\nKelsea Ballerini – Patterns\nTyler Childers – Snipe Hunter\nEric Church – Evangeline Vs. The Machine\nJelly Roll – Beautifully Broken\nMiranda Lambert – Postcards From Texas\n\nBest Country Solo Performance\nTyler Childers – “Nose On The Grindstone”\nShaboozey – “Good News”\nChris Stapleton – “Bad As I Used To Be”\nZach Top – “I Never Lie”\nLainey Wilson – “Somewhere Over Laredo”\n\nBest Country Duo/Group Performance\nMiranda Lambert and Chris Stapleton – “A Song To Sing”\nReba McEntire, Miranda Lambert, Lainey Wilson – “Trailblazer”\nMargo Price and Tyler Childers – “Love Me Like You Used To Do”\nShaboozey and Jelly Roll – “Amen”\nGeorge Strait and Chris Stapleton – “Honky Tonk Hall Of Fame”\n\nBest Country Song\nTyler Childers – “Bitin’ List”\nShaboozey – “Good News”\nZach Top – “I Never Lie”\nLainey Wilson – “Somewhere Over Laredo”\nMiranda Lambert and Chris Stapleton – “A Song To Sing”\n\nBest American Roots Performance\nJon Batiste featuring Randy Newman – “Lonely Avenue”\nI’m With Her – “Ancient Light”\nJason Isbell – “Crimson And Clay”\nAlison Krauss and Union Station – “Richmond On The James”\nMavis Staples – “Beautiful Strangers”\n\nBest Americana Performance\nSierra Hull – “Boom”\nMaggie Rose & Grace Potter – “Poison In My Well”\nMavis Staples – “Godspeed”\nMolly Tuttle – “That’s Gonna Leave A Mark”\nJesse Welles – “Horses”\n\n\nBest American Roots Song\nI’m With Her – “Ancient Light”\nJon Batiste – “Big Money”\nJason Isbell – “Foxes In The Snow”\nJesse Welles – “Middle”\nSierra Hull – “Spitfire”\n\nBest Americana Album\nJon Batiste – Big Money\nLarkin Poe – Bloom\nWillie Nelson – Last Leaf On The Tree\nMolly Tuttle – So Long Little Miss Sunshine\nJesse Welles – Middle\n\nBest Bluegrass Album\nMichael Cleveland & Jason Carter – Carter & Cleveland\nSierra Hull – A Tip Toe High Wire\nAlison Krauss & Union Station – Arcadia\nThe Steeldrivers – Outrun\nBilly Strings – Highway Prayers\n\nBest Traditional Blues Album\nBuddy Guy – Ain’t Done With The Blues\nTaj Mahal & Keb’ Mo’ – Room On The Porch\nMaria Muldaur – One Hour Mama: The Blues Of Victoria Spivey\nCharlie Musselwhite – Look Out Highway\nKenny Wayne Shepherd and Bobby Rush – Young Fashioned Ways\n\nBest Contemporary Blues Album\nJoe Bonamassa – Breakthrough\nSamantha Fish – Paper Doll\nEric Gales – A Tribute To LJK\nRobert Randolph – Preacher Kids\nSouthern Avenue – Family\n\nBest Folk Album\nRhiannon Giddens and Justin Robinson – What Did The Blackbird Say To The Crow\nPatty Griffin – Crown Of Roses\nI’m With Her – Wild And Clear And Blue\nJason Isbell – Foxes In The Snow\nJesse Welles – Under The Powerlines (April 24 – September 24)\n\nBest Gospel Performance/Song\nKirk Franklin – “Do It Again”\nTasha Cobbs Leonard, John Legend – “Church”\nJonathan McReynolds & Jamal Roberts – “Still” (Live)\nPastor Mike Jr – “Amen”\nCece Winans featuring Shirley Caesar – “Come Jesus Come”\n\nBest Global Music Album\nSiddhant Bhatia – Sounds Of Kumbha\nBurna Boy – No Sign of Weakness\nYoussou N’Dour – Eclairer le monde – Light the World\nShakti – Mind Explosion (50th Anniversary Tour Live)\nAnoushka Shankar Featuring Alam Khan & Sarathy Korwar – Chapter III: We Return To Light\nCaetano Veloso And Maria Bethânia – Caetano e Bethânia Ao Vivo\n\nBest Musical Theater Album\nBuena Vista Social Club\nDeath Becomes Her\nGypsy\nJust In Time\nMaybe Happy Ending\n\nBest Reggae Album\nLila Iké – Treasure Self Love\nVybz Kartel – Heart & Soul\nKeznamdi – Blxxd & Fyah\nMortimer – From Within\nJesse Royal – No Place Like Home\n\nBest Comedy Album\nBill Burr – Drop Dead Years\nSarah Silverman – PostMortem\nAli Wong – Single Lady\nJamie Foxx – What Had Happened Was…\nNate Bargatze –Your Friend, Nate Bargatze\n\nBest Audio Book, Narration, and Storytelling Recording\nKathy Garver – Elvis, Rocky & Me: The Carol Connors Story\nTrevor Noah – Into The Uncut Grass\nKetanji Brown Jackson – Lovely One: A Memoir\nDalai Lama – Meditations: The Reflections Of His Holiness The Dalai Lama\nFab Morvan – You Know It’s True: The Real Story Of Milli Vanilli\n\nBest Compilation Soundtrack For Visual Media\nTimothée Chalamet – A Complete Unknown\nVarious Artists – F1® The Album\nVarious Artists – KPop Demon Hunters\nVarious Artists – Sinners\nVarious Artists – Wicked\n\nBest Song Written For Visual Media\nNine Inch Nails – “As Alive As You Need Me To Be” (from Tron: Ares)\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden” (from KPop Demon Hunters)\nMiles Caton – “I Lied to You” (from Sinners)\nElton John and Brandi Carlile – “Never Too Late” (from Elton John: Never Too Late)\nJayme Lawson – “Pale, Pale Moon” (from Sinners)\nRod Wave – “Sinners” (from Sinners)\n\nBest Score Soundtrack For Visual Media (Includes Film and Television)\nJohn Powell – How to Train Your Dragon\nTheodore Shapiro – Severance: Season 2\nLudwig Göransson – Sinners\nJohn Powell & Stephen Schwartz – Wicked\nKris Bowers – The Wild Robot\n\nBest Music Video\nSade – “Young Lion”\nSabrina Carpenter – “Manchild”\nClipse – “So Be It”\nDoechii – “Anxiety”\nOK Go – “Love”\n\nBest Music Film\nDevo – Devo\nRaye – Live at the Royal Albert Hall\nDiane Warren – Relentless\nJohn Williams – Music by John Williams\nPharrell Williams – Piece by Piece\n\nBest Album Cover\nTyler, The Creator – Chromakopia (Shaun Llewellyn & Luis “Panch” Perez)\nDjo – The Crux (William Wesley II)\nBad Bunny – Debí Tirar Más Fotos (Benito Antonio Martinez Ocasio)\nPerfume Genius – Glory (Cody Critcheloe & Andrew J.S.)\nWet Leg – Moisturizer (Hester Chambers, Ellis Durand, Henry Holmes, Matt de Jong, Jamie-James Medina, Joshua Mobaraki & Rhian Teasdale)",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/7c3ff234-dfff-4d1f-8c6e-f33c3551bddb.jpg",
    "timestamp": "2025-11-07T23:01:07.709Z"
  },
  {
    "slug": "base-fm-new-music-friday-1762555566290",
    "headline": "BASE FM NEW MUSIC FRIDAY",
    "kicker": "",
    "summary": "Your latest hits out today!",
    "bodyText": "Take a look at all the new music out for the first week in November:\n\n- L.A.X Ft Olamide- Belinda\n\n- Johnny Drille - I'm Available\n\n- Poco Lee Ft Mavo, Diamond boy - Enjoyment\n\n- Shine TTW - Loco\n\n- Korede Bello - Numba 1\n\n- Alpha P x Yo x - Location\n\n- Olivetheboy- Spifomita\n\n- Raybekah - Kolobi\n\n- Smur Lee Ft Dj Maphorisa x Focalistic x Chico - Deliver\n\n- Falz - Bounce\n\n- Joshua Baraka Dr Jae5 - Still Young\n\n- Mavins Ft Don Jazzy - Waka",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3f154708-4411-426b-b2b2-9fb5723a1713.jpeg",
    "timestamp": "2025-11-07T22:46:06.290Z"
  },
  {
    "slug": "meghan-markle-returns-to-acting-1762511610514",
    "headline": "Meghan Markle Returns to Acting",
    "kicker": "",
    "summary": "The Duchess of Sussex, Meghan Markle is returning to acting  as she takes  a small role in an upcoming movie titled \"Close Personal Friends.",
    "bodyText": "The Duchess of Sussex, Meghan Markle is returning to acting  as she takes  a small role in an upcoming movie titled \"Close Personal Friends.\n\nMarkle is reportedly set to play herself in the Amazon MGM Studios project starring Brie Larson, Lily Collins, Jack Quaid and Henry Golding.\n\nShe and her husband Harry  had in   2022 partnered with Netflix to star in the 2022 docuseries \"Meghan & Harry\" .",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/50b8ba0d-90f2-4af1-9ff4-d27e7739332f.jpeg",
    "timestamp": "2025-11-07T10:33:30.514Z"
  },
  {
    "slug": "nafdac-bans-alcoholic-drinks-in-sachets-startig-december-1762511484835",
    "headline": "NAFDAC Bans Alcoholic Drinks in Sachets Startig December",
    "kicker": "",
    "summary": "The Senate has directed  the National Agency for Food and Drug Administration and Control,NAFDAC, to begin the enforcement of  the ban on the production and sale of alcoholic drinks in sachets and small plastic bottles by December 2025.",
    "bodyText": "The Senate has directed  the National Agency for Food and Drug Administration and Control,NAFDAC, to begin the enforcement of  the ban on the production and sale of alcoholic drinks in sachets and small plastic bottles by December 2025.\n\nThe directive followed a motion sponsored by Senator Asuquo Ekpenyong,Cross River South, who expressed concerns over the repeated postponement of the ban despite the rising health and social problems linked to the consumption of cheap alcohol.\n\nEkpenyong argued that NAFDAC had shifted the phase-out date several times, from 2023 to 2024 and later to 2025, due to pressure from manufacturers, waring that indefinite delays  would amount to “a betrayal of public trust and a violation of Nigeria’s commitment to global health standards.”",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2d896920-95e4-4d06-8f33-c2fe77d1f7a7.jpg",
    "timestamp": "2025-11-07T10:31:24.835Z"
  },
  {
    "slug": "nancy-pelosi-announces-she-will-not-seek-re-election-1762511353957",
    "headline": "Nancy Pelosi Announces She Will Not Seek Re-election",
    "kicker": "",
    "summary": "",
    "bodyText": "Former U.S. House Speaker Nancy Pelosi has announced she will not seek re-election at the end of her current tenure.\n\nThe 85-year-old Democrat, who made history as the first woman to serve as Speaker of the House, announced  her decision in a video to her San Francisco constituents, saying she would serve her final term “with a grateful heart.”\n\nPelosi, now in her 19th term, has represented San Francisco for 38 years and led her party in Congress for two decades.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4689222a-b4c8-4b05-a54c-dddc2012794f.jpeg",
    "timestamp": "2025-11-07T10:29:13.957Z"
  },
  {
    "slug": "president-bola-tinubu-has-sworn-in-two-newly-appointed-ministers-bernard-doro-and-kingsley-ude-1762511221650",
    "headline": "President Bola Tinubu has Sworn in Two Newly Appointed Ministers, Bernard Doro and Kingsley Ude.",
    "kicker": "",
    "summary": "",
    "bodyText": "Doro, from Plateau State, replaces former Minister of Humanitarian Affairs and Poverty Reduction, Nentawe Yilwatda, who recently assumed office as National Chairman of the All Progressives Congress (APC).\n\nWhile Ude, a Senior Advocate of Nigeria (SAN) from Enugu State, replaces  former Minister of Science, Innovation and Technology, Uche Nnaji, who resigned following certificate forgery allegations.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/fb9df721-1318-41a5-a2bd-f21bd67e96fd.jpeg",
    "timestamp": "2025-11-07T10:27:01.650Z"
  },
  {
    "slug": "lagos-fashion-week-wins-earthshot-prize-2025-to-build-a-waste-free-world-1762511112032",
    "headline": "LAGOS FASHION WEEK WINS EARTHSHOT PRIZE 2025 - TO BUILD A WASTE FREE WORLD",
    "kicker": "",
    "summary": "",
    "bodyText": "Lagos Fashion Week has been named the Winner of the 2025 Earthshot Prize to Build a Waste-Free World.\nReceiving the award, founder Omoyemi Akerele shared:\n\"By 2030, with the support of the Earthshot Prize, we will establish the first fully functional Circular Fashion Hub in Lagos. This hub will travel to other African cities powered by culture and craftsmanship transforming textile waste into new materials, new businesses, and sustainable livelihoods.\"\nShe added:\n\"We call on fashion weeks across the Global South to join us in adopting this model to champion local craftsmanship and build a regenerative fashion future that restores both people and the planet.\"",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/118cdb04-8ba5-4774-bec2-b29e8cd68b08.jpeg",
    "timestamp": "2025-11-07T10:25:12.032Z"
  },
  {
    "slug": "the-fisherman-cast-opens-up-on-the-lunchroom-from-deep-sea-dreams-to-deep-personal-grief-1762508194192",
    "headline": "The Fisherman Cast Opens Up on The Lunchroom: From Deep Sea Dreams to Deep Personal Grief",
    "kicker": "",
    "summary": "",
    "bodyText": "It was an emotional and engaging episode of The Lunchroom this week as host GrandPrince Ita sat down with the creative team behind the highly anticipated film, The Fisherman.\nFilmmaker Director Zoe was joined by actors Endurance Grand, Rick Ade Layitar, and William Lamptey for a conversation that delved into the film’s message, the emotional toll of storytelling, and the cultural bond that unites the cast, ending, of course, with the lighthearted Nigeria vs. Ghana Jollof rice debate.\nDirector Zoe clarified that despite its title, The Fisherman is not a story about the sea but about dreams, resilience, and the pursuit of purpose against all odds.\n“Forget the hook and line,” she said. “This film is pure heart, a testament to resilience, the power of a dream, and the enduring human spirit. Every character is fighting for something bigger than themselves.”\nFor Endurance Grand, taking on her first major leading role was both challenging and transformative. She described the process as “intensely demanding but deeply rewarding,” crediting the film for pushing her to discover new emotional depths as an actor.\nHer co-star Rick Ade Layitar shared a deeply personal story that touched everyone in the studio. The actor revealed he was dealing with the loss of his brother when he joined the project, and that the experience became a crucial part of his healing journey.\n“Acting in The Fisherman was therapy for me,” he admitted. “It allowed me to channel my grief into something meaningful and find peace through the character.”\nThe discussion also took a lighter turn when William Lamptey, who is visiting Nigeria for the first time, praised the country’s “overwhelming energy, infectious creativity, and incredible warmth.”\nNaturally, the conversation soon drifted to the long-standing culinary rivalry between Nigeria and Ghana. With Endurance Grand being of both Nigerian and Ghanaian heritage, she found herself hilariously stuck in the middle as her co-stars playfully defended their countries’ versions of Jollof rice.\nWrapping up the conversation, Director Zoe encouraged audiences to experience the story for themselves, describing The Fisherman as a film that will inspire viewers to never give up on their dreams.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/0eab6085-1003-4b57-aad3-ee44c6fd245c.jpeg",
    "timestamp": "2025-11-07T09:36:34.192Z"
  },
  {
    "slug": "omawumi-explores-new-sounds-with-fuji-house-fusion-on-base-sunrise-1762502043410",
    "headline": "Omawumi Explores New Sounds with Fuji-House Fusion on Base Sunrise",
    "kicker": "",
    "summary": "",
    "bodyText": "It was an exciting morning on Base Sunrise with Chacha as award-winning Nigerian singer and songwriter Omawumi joined the show to talk about her latest single, “Temperature,” and the bold, experimental direction her music is taking.\nDuring the lively conversation, Omawumi revealed that “Temperature” is a daring blend of Fuji and House music — a combination rarely heard in the Nigerian soundscape.\nAccording to the singer, the inspiration for the song came from a fan who challenged her to step completely outside her comfort zone and experiment with something unexpected.\n“The creative process was genuinely refreshing and unpredictable,” Omawumi shared. “It felt like I was back in the lab  taking elements I love and seeing how they could fight, dance, and finally blend. The result is something that respects our roots but is impossible to sit still to.”\nThe track, she explained, merges the layered percussion of traditional Fuji music with the vibrant, rhythmic pulse of House creating a sound that’s as energetic as it is culturally grounded.\nBeyond the music, Omawumi used her time on Base FM to speak passionately about unity among female artists in the Nigerian music industry.\n“Growth in this industry, especially for women, depends on us,” she said. “We need to intentionally uplift one another — share knowledge, share stages, and share the spotlight. That genuine support is what drives collective success.”\nWrapping up the conversation, Omawumi teased that “Temperature” marks the beginning of an exciting new chapter in her career. She confirmed that more releases are on the way in January, promising to keep exploring fresh sounds and creative risks.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/78f2452b-a146-4f46-a808-475e8a7da763.jpeg",
    "timestamp": "2025-11-07T07:54:03.410Z"
  },
  {
    "slug": "journalism-under-siege-base-sunrise-marks-international-day-to-end-impunity-for-crimes-against-journalists-1762456125151",
    "headline": "Journalism Under Siege: Base Sunrise Marks International Day to End Impunity for Crimes Against Journalists",
    "kicker": "",
    "summary": "On Base Sunrise with Chacha, veteran journalist Segun James joined the conversation to reflect on the harsh realities of practicing journalism in Nigeria, a country where, as he put it, “the lives of journalists are not valued.”",
    "bodyText": "As the world marked the International Day to End Impunity for Crimes Against Journalists, Segun shared deeply personal experiences that shed light on the dangers, lack of protection, and emotional toll faced by those in the media profession.\nSegun emphasized that the root of the crisis lies in impunity, the consistent failure to hold perpetrators accountable for violence against journalists.\n“The major reason these attacks persist,” he noted, “is because those responsible are never investigated or punished.”\nBoth international and local media watchdogs have long confirmed this disturbing trend: in nearly all cases of journalist killings, harassment, or intimidation in Nigeria, justice is never served. This entrenched culture of impunity, Segun warned, emboldens aggressors and silences truth-tellers.\nBeyond the physical threats, the journalist spoke about the psychological burden of working under constant danger. He described how this climate of fear has created a “chilling effect” where journalists are forced into self-censorship to avoid detention, harm, or even death.\n“When your personal safety is at stake,” he explained, “you begin to question whether reporting the truth is worth the risk. And when that happens, the public suffers—because a less-informed public means a weaker democracy.”\nSegun James also recounted harrowing personal experiences from the field—including witnessing a colleague’s assassination while on duty and facing physical violence after publishing a story about a state governor.\n“The governor called me a ‘terrorist journalist’ just because I wrote the truth,” he recalled. “He didn’t even bother to report me to my organization because he knew the facts were correct.”\nHe went on to reveal that such confrontations have forced him to tone down his reporting and avoid certain assignments, not out of fear of exposure, but simply to stay alive.\nSegun further highlighted the economic struggles many Nigerian journalists face, stressing that poor pay and lack of insurance or institutional protection make an already risky job even more dangerous.\nHost Chacha echoed his sentiments, reminding listeners that journalism is more than a profession; it is a public service.\n“Journalism isn’t just a job,” she said. “It’s a social service that holds power accountable and keeps society informed.” Segun agreed, adding that while the tools of journalism have evolved from fax machines to laptops and mobile phones, the most urgent transformation must happen in education.\n“Not everyone sharing information online is a journalist,” he cautioned. “There’s a thin line between citizen reporting and professional journalism, and that line is fading fast. We need education and regulation to preserve the credibility of the profession.”\nAs the conversation closed, both Segun and Chacha called for stronger laws to protect journalists and hold attackers accountable. Their discussion served as a sobering reminder that without safety, fairness, and freedom for the press, democracy itself remains under threat.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2f3ff076-1331-4a11-a8f9-954ed3aa04c3.jpg",
    "timestamp": "2025-11-06T19:08:45.151Z"
  },
  {
    "slug": "14-yr-old-british-boy-who-sued-ghanaian-parents-for-sending-him-to-boarding-school-in-ghana-loses-1762445909607",
    "headline": "14-yr-old British Boy Who Sued Ghanaian Parents for Sending Him to Boarding School in Ghana, Loses",
    "kicker": "",
    "summary": "A British court has ruled that a 14-year-old boy who sued his parents after being sent to boarding school in Ghana must remain there until he completes the equivalent of his GCSEs.",
    "bodyText": "A British court has ruled that a 14-year-old boy who sued his parents after being sent to boarding school in Ghana must remain there until he completes the equivalent of his GCSEs.\n\nThe teenager, who cannot be identified for legal reasons, was taken to Ghana in March 2024 under the pretext of visiting a sick relative. However, court documents reveal his parents had planned the move over concerns about his behaviour in London, citing frequent absences from school, unexplained money, and possession of a knife. The boy denies carrying a weapon or being involved in gang activity.\n\nIn a judgment delivered on Tuesday, Mrs Justice Theis of the High Court ruled that the boy should continue his studies in Ghana, despite his wish to return to the United Kingdom. She said: “I am acutely aware that the conclusion I have reached does not accord with [his] wishes and how that will feel for him. [He] has the talent, ability and intelligence to make this work together with his family. It will be difficult but they all have the common aim for [him] to return to live with his family.”\n\nThe decision marks the latest development in a case that began when the boy, feeling “unhappy and homesick”, contacted publicly funded lawyers and filed a case against his parents in February 2025. He initially lost the case after the High Court ruled that returning to the UK would expose him to “greater harm”. However, the Court of Appeal ordered a rehearing in June after Sir Andrew McFarlane, President of the Family Division, found that the earlier ruling contained procedural confusion.\n\nThe boy, who holds both British and Ghanaian citizenship, told the court he felt “like an alien” in Ghana and described his experience as “living in hell”. He said he had struggled to make friends, did not speak Twi, and suffered from social anxiety.\n\nHis solicitor, James Netto of the International Family Law Group, said his client “welcomes” the judge’s decision to provide a “road map” for his eventual return but maintained that “his position remains unchanged: he wants to return home”. Mr Netto added that the case had been “extremely difficult on every level” and that the boy had not wanted to take legal action against his parents but had “no meaningful alternative”.\n\nThe boy’s mother told the court she still feared for her son’s safety if he were to return to the UK prematurely. “It is really hard to be away from him,” she said. “I feared and continue to fear if he were to come back now, that he could end up dead. I know he does not see it like that.”\n\nMrs Justice Theis ordered that the teenager “remain living in Ghana with the aim of setting out a road map and taking the necessary steps for [him] to return here after completing his GCSEs”, adding that his situation “will need to be reviewed nearer the time”.\n\nThe roadmap includes ongoing family therapy funded by the local authority, intended to support the boy’s eventual reintegration into life in the United Kingdom.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/020233b9-1c0d-4d28-bcd1-6af570841471.jpeg",
    "timestamp": "2025-11-06T16:18:29.607Z"
  },
  {
    "slug": "anambra-poll-obi-calls-for-peaceful-election-1762445709535",
    "headline": "Anambra Poll: Obi Calls for Peaceful Election",
    "kicker": "",
    "summary": "The presidential candidate of the Labour Party in the 2023 general elections, Mr Peter Obi, has called on Anambra residents and political candidates to ensure a peaceful and transparent electoral process in the November 8, 2025, governorship election in the state.",
    "bodyText": "Addressing journalists at his residence in Agulu, Anaocha Local Government Area of the state, on Wednesday, Obi urged the residents to turn out in mass and exercise their democratic and civil rights.\n\nThe former Anambra governor urged political actors to respect the rule of law and prioritise the state’s peace and security, stressing that politicians must pursue their interests within the confines of the law.\n\nHe said, “My interest in this Anambra 2025 governorship election is a peaceful process before, during, and after the exercise. I want a peaceful, free and fair election. This election is for Ndi-Anambra, and anyone who wins, wins for the development of the state.\n\n“All the contestants, including the incumbent governor, Prof. Chukwuma Soludo of the All Progressives Grand Alliance, Prince Nicholas Ukachukwu of the All Progressives Congress and my party’s candidate, Chief George Moughalu of the Labour Party, are my friends.\n\n“But I will vote for the candidate of my party, and I urged every other voter-card-carrying resident in Anambra State to go out and vote for the candidate of their choice.”\n\nObi, however, called on the Independent National Electoral Commission and security agencies to uphold their constitutional responsibilities by ensuring neutrality and professionalism during the electoral exercise.\n\nPunch Online had reported that the INEC had declared full readiness for the governorship election slated for Saturday, November 8, 2025, across the 5,718 wards across the state.\n\nThe Chairman of the commission, Prof. Joash Amupitan, during a stakeholders meeting in Awka, said about 24,000 ad hoc staff will be deployed, while about 540 journalists have been accredited to cover the election, adding that the commission is fully committed to the governorship poll in line with its commitment to credible and inclusive elections.\n\nHe said the Commission has been implementing a comprehensive plan of activities covering logistics, technology, training, stakeholder engagement, and security coordination, including the conduct of a mock accreditation exercise, which was conducted across selected polling units in three senatorial districts of the state on Saturday.\n\nAccording to INEC, 16 candidates from 16 political parties are contesting the governorship election to wrest power from the incumbent, Prof. Chukwuma Soludo, who is also seeking reelection under the platform of APGA.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/093a9708-0bbd-4400-9c47-1709b01781f0.webp",
    "timestamp": "2025-11-06T16:15:09.535Z"
  },
  {
    "slug": "fifa-appoints-south-african-referee-tom-abongile-1762443989733",
    "headline": "FIFA Appoints South African referee, Tom Abongile",
    "kicker": "",
    "summary": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.",
    "bodyText": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.\n\nHis compatriots Zakhele Siwela and Akhona Makalima will serve as assistant referee and VAR official, with a Beninese assessor overseeing the match. The appointment has sparked outrage in Nigeria, where officials and fans questioned FIFA’s neutrality.\n\nFIFA said the selections were made by its Referees Committee, noting South Africans’ strong experience in major continental competitions.\n\n*The chief executive of Israeli club Maccabi Tel Aviv says it is \"incredibly sad\" away fans have been banned from his side's Europa League match at Aston Villa.\n\nJack Angelides  noted that Politics should never be drawn into football.\n\nLast month, the local Safety Advisory Group - the body responsible for issuing safety certificates for matches - informed Villa that no travelling fans would be allowed to attend the fixture in Birmingham on Thursday after police raised concerns, sparking a major backlash.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e82fdb64-b9f1-42c2-af30-291eaffc0894.webp",
    "timestamp": "2025-11-06T15:46:29.733Z"
  },
  {
    "slug": "bandits-kill-pastor-abduct-20-worshippers-in-kaduna-community-1761995025934",
    "headline": "BANDITS KILL PASTOR, ABDUCT 20 WORSHIPPERS IN KADUNA COMMUNITY",
    "kicker": "BREAKING",
    "summary": "Armed bandits attacked the Farin Dutse community in Kauru Local Government Area of Kaduna State, killed Rev. Yahaya Kambasiya of the United Church of Christ in Nigeria (HEKAN), and kidnapped more than 20 worshippers. Church leaders are calling for urgent security intervention.",
    "bodyText": "Armed bandits raided the Farin Dutse community in Kauru Local Government Area of Kaduna State and killed a local pastor, Rev. Yahaya Kambasiya, during a night attack that also left more than 20 residents abducted.\n\nRev. Kambasiya was a minister with the United Church of Christ in Nigeria (HEKAN). According to witnesses, the attackers moved into the village shooting, forcing families out of their homes, and targeting members of the church community. He was shot and killed at the scene.\n\nAfter killing the pastor, the gunmen went house to house and took several people, including women and youths, before escaping with them into nearby bush areas.\n\nThe President of HEKAN, Rev. Dr. Amos Kiri, condemned the attack and described it as “an attack on a peaceful worship community.” He called the killing of Rev. Kambasiya “painful and unacceptable,” and demanded immediate action from security agencies to rescue the abducted members and stop repeated raids on Christian communities in that part of Kaduna.\n\nHe also urged authorities at both state and federal level to stop treating these incidents as routine and to treat them as an ongoing emergency affecting worship centres, pastors, and entire families.\n\nResidents of the area say this is not the first time armed groups have entered at night, taken hostages, and left without resistance. Locals say they feel abandoned and unprotected, and that kidnappings for ransom have become a way of life in rural Kaduna.\n\nAs of now, the abducted worshippers are still missing.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/89079af3-addc-4005-9625-c4353d1688e1.jpeg",
    "timestamp": "2025-11-01T11:03:45.934Z"
  },
  {
    "slug": "adekunle-gold-reveals-ongoing-battle-with-sickle-cell-disease-1761994916694",
    "headline": "ADEKUNLE GOLD REVEALS ONGOING BATTLE WITH SICKLE CELL DISEASE",
    "kicker": "HEALTH • MUSIC",
    "summary": "Nigerian singer Adekunle Gold says he is still living with sickle cell disease and still goes through painful “crises,” a condition he’s managed since he was five years old. He urged Nigerians to know their genotype before marriage so they don’t pass the disorder to their children, saying “a lot of people still don’t understand the risk",
    "bodyText": "Adekunle Gold has opened up about his ongoing battle with sickle cell disease, saying he still experiences painful health crises even as an adult.\n\nAccording to him, his first major crisis happened when he was about five years old. He said his mum had to carry him on her back to the hospital in the middle of the night while his dad wasn’t home. He’s been on medication ever since.\n\n“I still have crises,” he said. “When we talk about a crisis, it’s pain in your joints, your legs, and sometimes your stomach. It’s really crazy.” He added that while the attacks are now less frequent than when he was younger, they haven’t fully gone away. He credits better self-care and access to treatment for keeping things under control.The 38-year-old artist also addressed rumours that he did a bone marrow transplant to ‘cure’ it. He denied that and said people on the internet talk “with so much confidence about what they don’t know.”\n\nBeyond talking about his own story, Adekunle Gold used the moment to push awareness. He told Nigerians to take genotype seriously before getting married, because two people with incompatible genotypes can pass sickle cell to their child and lock that child into a lifetime of pain. “Knowing your genotype is very important,” he said. “A lot of people still don’t understand the risks.”\n\n\nHe said he wants to “make more noise” about it, not just as a celebrity moment, but so fewer kids are born into a situation where every fever could become an emergency and every joint pain might mean another night in the hospital.\n\nFor him, this is personal — not PR. He’s lived it.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/9027b890-d293-453c-accf-334652e0c617.jpeg",
    "timestamp": "2025-11-01T11:01:56.694Z"
  }
]