[
  {
    "slug": "base-fm-joins-the-celebration-at-margarita-fest-2025-1763132206902",
    "headline": "Base FM Joins the Celebration at Margarita Fest 2025",
    "kicker": "Events",
    "summary": "",
    "bodyText": "Raise your glasses,  it’s time to toast to good vibes, great music, and even better company as Base FM partners with Margarita Fest 2025 on November 30, 2025.\n\nThis year’s edition promises a fusion of premium cocktails, live performances, and chilled tropical energy that captures the Lagos spirit. From vibrant pop-up bars to interactive brand activations, Margarita Fest is designed to bring together lovers of good taste and high energy.\n\nBase FM will be covering the event live with on-air updates, interviews, and social media highlights, giving fans a front-row seat to the fun.\n\nExpect Base FM hosts to bring their signature vibe to the stage and connect partygoers through music and laughter.\nWhether you’re there to sip, sway, or simply soak in the moment, Margarita Fest 2025 is the weekend experience you don’t want to miss.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a3bdc202-4113-441c-ae49-a4a6d4ad6881.jpeg",
    "timestamp": "2025-11-14T14:56:46.902Z"
  },
  {
    "slug": "south-africa-set-to-bid-for-2036-or-2040-olympic-and-paralympic-games-1763130501424",
    "headline": "South Africa Set to Bid for 2036 or 2040 Olympic and Paralympic Games",
    "kicker": "",
    "summary": "",
    "bodyText": "South Africa is set to bid for the 2036 or 2040 Olympic and Paralympic Games, the government said on Thursday, 13 November 2025—the first for an African country if it gets the hosting rights.\n\nAlready the country was the first on the continent to host the football World Cup in 2010 successfully.\n\nMinister in the presidency Khumbudzo Ntshavheni said at a briefing that \"South Africa initiates its intention to bid for the 2036 and 2040 Olympic Games.\"\n\nNtshavheni said the government had entered into \"continuous dialogue with the International Olympic Committee.\"\n\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/f88cd9b2-b2c0-4834-a81d-8a2a127f849f.webp",
    "timestamp": "2025-11-14T14:28:21.424Z"
  },
  {
    "slug": "former-world-heavyweight-champion-joseph-parker-tests-positive-for-cocaine-1763130348731",
    "headline": "Former World Heavyweight Champion, Joseph Parker Tests Positive for Cocaine",
    "kicker": "",
    "summary": "",
    "bodyText": "Former world heavyweight champion Joseph Parker has tested positive for cocaine and risks a likely ban from boxing after testing positive for cocaine.\n\nParker, 33, failed a drug test on the day of his fight with Fabio Wardley on 26 October, according to media reports.\n\nHe was tested by the Voluntary Anti-Doping Agency (VADA) on 25 October.\n\nParker tested positive for the recreational drug and not performance-enhancing drugs, which could see him get a two-year ban. He also be suspended for as little as three months depending on circumstances.\n\nAny ban would be handed down by UK Anti-Doping (UKAD) and the British Boxing Board of Control (BBBC).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ef3e72c9-0921-43d5-8a7b-8cdf826758e3.webp",
    "timestamp": "2025-11-14T14:25:48.731Z"
  },
  {
    "slug": "bad-bunny-takes-home-5-latin-grammy-awards-1763130201808",
    "headline": "Bad Bunny Takes Home 5 Latin Grammy Awards",
    "kicker": "",
    "summary": "",
    "bodyText": "Puerto Rican pop singer Bad Bunny scooped home five Latin Grammy Awards on Thursday at the event held in Las Vegas.\n\nAmong them was album of the year, for the acclaimed Debí Tirar Más Fotos, a project that embraced his island's musical heritage—and paved the way for him to perform at next year's Super Bowl halftime show.\n\nBunny dedicated the award to \"all the youth of Latin America.\" He added, \"There are many ways of being patriotic and defending our homelands. We chose music.\"\n\nOther winners are Catriel and Paco Amoroso, who took home five prizes; Alejandro Sanz; Gloria Estefan; and Karol G, who is set to headline next year's Coachella festival.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/875064ee-806c-430b-a1ca-f144ab6941f2.jpeg",
    "timestamp": "2025-11-14T14:23:21.808Z"
  },
  {
    "slug": "south-africa-grants-entry-to-153-palestinian-refugees-1763129822709",
    "headline": "South Africa Grants Entry to 153 Palestinian Refugees",
    "kicker": "",
    "summary": "",
    "bodyText": "South African authorities have granted entry to 153 Palestinian refugees who arrived Thursday, 13 November 2025, on a chartered flight from Kenya to seek asylum in the country but had been denied admission after failing immigration tests.\n\nThe Border Management Authority (BMA) said in a statement that during their standard immigration interview process, the Palestinians did not indicate their duration of stay in the country or their intended accommodation addresses.\n\nThe Palestinian refugees waited for more than 10 hours on the tarmac at OR Tambo International Airport near Johannesburg to be cleared or turned away. The news caused outrage among activists in the country known to be strong supporters of Palestinian rights.\n\nSouth Africa’s Ministry of Home Affairs authorised the passengers to get off the plane on Thursday night after a local humanitarian organisation guaranteed to provide the passengers with accommodation during their stay in South Africa if needed.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/02f26da6-400c-49f6-997a-8b00476acefc.jpg",
    "timestamp": "2025-11-14T14:17:02.709Z"
  },
  {
    "slug": "lagos-state-government-announces-repairs-and-partial-closure-of-lekki-ajah-expressway-1763129645287",
    "headline": "Lagos State Government Announces Repairs and Partial Closure of Lekki-Ajah Expressway",
    "kicker": "",
    "summary": "",
    "bodyText": "The Lagos State Government has announced that sections of the Lekki–Ajah corridor will be partially closed for eight months to allow for major rehabilitation and improvement works aimed at easing traffic flow in the area.\n\nThe Commissioner for Transportation, Oluwaseun Osiyemi, disclosed this in a statement on Wednesday, saying the project will run from Saturday, November 15, 2025, to Wednesday, July 15, 2026.\n\nAccording to him, the rehabilitation project, which has already commenced with preliminary works, will be carried out in two phases to reduce traffic disruption during the period.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/88a9b4bd-5acc-49f2-8dcb-ac83184fd677.webp",
    "timestamp": "2025-11-14T14:14:05.287Z"
  },
  {
    "slug": "president-bola-ahmed-tinubu-approves-reappointment-of-brigadier-general-mohammed-buba-marwa-rtd-as-chairman-of-ndlea-1763129425809",
    "headline": "President Bola Ahmed Tinubu Approves Reappointment of Brigadier-General Mohammed Buba Marwa (rtd) as Chairman of NDLEA",
    "kicker": "",
    "summary": "",
    "bodyText": "President Bola Ahmed Tinubu has approved the reappointment of Brigadier-General Mohammed Buba Marwa (rtd) as Chairman of the National Drug Law Enforcement Agency (NDLEA) for another five-year term.\n\nMarwa, a former military governor of Lagos and Borno States, was first appointed by the late former President Muhammadu Buhari in January 2021.\n\nBefore his appointment, he had chaired the Presidential Advisory Committee for the Elimination of Drug Abuse from 2018 to 2020.\n\nBy his reappointment, he will remain at the helm of the NDLEA until 2031.\n\nThe NDLEA under his leadership has recorded the arrest of more than 73,000 drug traffickers and barons and the seizure of over 15 million kilograms of illicit substances.\n\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4ab905ce-47be-4360-ba95-977d1a0ab29c.jpeg",
    "timestamp": "2025-11-14T14:10:25.809Z"
  },
  {
    "slug": "abductors-of-federal-ministry-of-defence-directors-demand-n150m-1763129269119",
    "headline": "Abductors of Federal Ministry of Defence Directors Demand N150m",
    "kicker": "",
    "summary": "",
    "bodyText": "Reports say abductors of six directors of the Federal Ministry of Defence along the Kabba–Lokoja highway in Kogi State are now demanding N150 million for their release.\n\nThey were kidnapped on November 10, 2025, while traveling from Lagos to Abuja for a Directorate-level promotion examination. Sources described the incident as a well-coordinated ambush.\n\nA family source, while confirming the demand, said, “We are still in shock over the whole incident. To worsen our pain, the kidnappers are demanding N150 million to free all six of them. Where and how can we raise such an outrageous amount? We are appealing to the kidnappers to release our breadwinners unharmed. This is all we can say.”\n\nThe victims are Mrs. Ngozi Ibeziakor, Mrs. C. Emeribe, Mrs. Helen Ezeakor, Mrs. C. Ladoye, Mrs. J. Onwuzurike, and Mrs. Catherine Essien.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d0462e02-9361-4ee5-9fef-c96a16d33252.webp",
    "timestamp": "2025-11-14T14:07:49.119Z"
  },
  {
    "slug": "abuja-airport-shutdown-over-aircraft-incident-1763129059033",
    "headline": "Abuja Airport Shutdown Over Aircraft Incident",
    "kicker": "",
    "summary": "",
    "bodyText": "The Nnamdi Azikiwe International Airport (NAIA), Abuja, was temporarily shut down on Thursday following an aircraft incident on its runway.\n\nThe aircraft, a Gulfstream 400 with the registration number 5N-PZE, a private jet, had its nosewheel damaged on landing at the airport at about 2 pm.\n\nA source close to the airport confided in our correspondent that the aircraft, carrying 10 passengers and four crewmembers, had departed Enugu Airport for Abuja before the incident.\n\nThe cause of the incident could not be ascertained at the time of filing this report, but the source confirmed that the aircraft had been evacuated from the scene.\n\nThe source said, “Yes, I can confirm an aircraft incident on the runway of Abuja Airport today (Thursday). The aircraft was coming from Enugu Airport but had a nosewheel incident on landing.\n\n“As of the time of the incident, there were 14 souls onboard, including four crewmembers. However, there was no casualty among the passengers or the crew. It led to a minimal closure of the airport. The incident happened at about 2 pm.”\n\n\n\n\n\n\n\n\n\n\ncredit: Guardian",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b685c23b-06d7-46da-b270-e0967dc2389f.jpg",
    "timestamp": "2025-11-14T14:04:19.033Z"
  },
  {
    "slug": "suspension-of-15-petrol-and-diesel-import-duty-1763115530200",
    "headline": "Suspension of 15% Petrol and Diesel Import Duty",
    "kicker": "Base Sunrise with Cha Cha",
    "summary": "",
    "bodyText": "The Federal Government has suspended the planned 15% import duty on petrol and diesel, a policy that would have significant economic implications for citizens and businesses alike.\n\nChacha discussed with Omatseye about the potential impact that the duty could have had on transportation costs, the prices of goods, and household budgets, noting that fuel price changes have a ripple effect across the economy. The discussion highlighted the importance of timing, communication, and planning when implementing new policies, stressing that abrupt announcements without proper preparation can create uncertainty and stress for the public.\n\nThe segment explored the broader lesson for policymaking: that government decisions must be carefully considered, with attention to the practical impact on the daily lives of Nigerians. This segment resonated with the principle that effective policies are those that anticipate real-world consequences and seek to minimize disruption while achieving their intended goals.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/eb546e26-28fb-469d-8a45-bd1299b97d4a.jpeg",
    "timestamp": "2025-11-14T10:18:50.200Z"
  },
  {
    "slug": "waec-cbt-suspension-are-nigerian-schools-ready-1763114191959",
    "headline": "WAEC CBT Suspension: Are Nigerian Schools Ready?",
    "kicker": "Base Sunrise with ChaCha",
    "summary": "",
    "bodyText": "The House of Representatives’ has decided to suspend WAEC’s plan to implement Computer-Based Testing (CBT) for the 2026 WASSCE. The move has reignited debates about Nigeria’s readiness for digital education and the challenges facing the country’s students and schools.\n\nChacha highlighted that while modernizing the examination system is a positive step, many schools across the country, particularly in rural areas still face fundamental challenges such as limited access to functional computers, unstable electricity, and a shortage of trained staff.\n\nThe discussion examined the potential consequences of implementing CBT prematurely, including the risk of widening educational inequalities between urban and rural students. The show explored whether a phased rollout or pilot programs might be more effective in ensuring all students have the opportunity to succeed in a digital examination environment.\n\nThe segment underscored the need for careful planning, preparation, and investment in infrastructure to make digital education a reality in Nigeria, emphasizing that policies must align with the realities on the ground to be successful.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/da312bc1-492d-48b5-a5fa-87f1e9096f42.jpeg",
    "timestamp": "2025-11-14T09:56:31.959Z"
  },
  {
    "slug": "super-eagles-soar-over-gabon-in-4-1-victory-head-to-the-playoff-finals-1763065855584",
    "headline": "SUPER EAGLES SOAR OVER GABON IN 4 - 1 VICTORY, HEAD TO THE PLAYOFF FINALS",
    "kicker": "",
    "summary": "",
    "bodyText": "The Super Eagles soared past Gabon with a 4-1 extra-time victory (thanks to that Osimhen double & Ejuke's strike!) in the playoff semi-final.\n\nBUT THE JOB ISN'T DONE! We're now heading to the final hurdle this Sunday. The winner of that match goes to the InterContinental Playoff where only one more win secures our spot in the 2026 FIFA World Cup!",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/9a7a2005-a651-4093-a8c7-721624413595.jpeg",
    "timestamp": "2025-11-13T20:30:55.584Z"
  },
  {
    "slug": "kizz-daniel-s-paris-no-show-who-s-really-at-fault-1763063273574",
    "headline": "Kizz Daniel’s Paris No-Show: Who’s Really at Fault?",
    "kicker": "",
    "summary": "",
    "bodyText": "The spotlight then shifted to Kizz Daniel, who once again found himself at the center of controversy. \n\nA Paris-based promoter is demanding nearly €80,000 in refunds after Kizz allegedly failed to appear for a scheduled performance. \n\nThe issue reportedly stemmed from payment misunderstandings — leaving fans disappointed, organizers frustrated, and Lagos asking: When shows fall apart, is the artist responsible, or should promoters bear the blame?\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4bcbb72c-f3b1-44c4-a0dc-c0a2e1927fea.jpeg",
    "timestamp": "2025-11-13T19:47:53.574Z"
  },
  {
    "slug": "base-fm-partners-with-militant-camp-rave-call-of-duty-edition-1763063059864",
    "headline": "Base FM Partners with Militant Camp Rave “Call of Duty” Edition",
    "kicker": "",
    "summary": "",
    "bodyText": "Get ready for one of the most explosive experiences of the year as Base FM partners with Militant Camp Rave for its “Call of Duty” edition, happening on November 29, 2025.\nKnown for its bold themes and adrenaline-packed atmosphere, Militant Camp Rave is where music, creativity, and gaming culture collide. \n\nThis year’s edition promises an immersive experience inspired by the energy and thrill of the iconic video game. Attendees can expect high-energy performances, interactive installations, and a non-stop rave that celebrates freedom, intensity, and expression.\n\nBase FM will be live on-ground to capture the excitement, host exclusive interviews, and engage ravers with special giveaways and on-air moments. It’s not just a party, it’s a movement of sound, light, and culture.\n\nStay tuned to Base FM for updates, behind-the-scenes coverage, and your chance to win tickets to this unforgettable night.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ed5a1d6f-b574-4503-a2d9-e92ce4253cbc.jpeg",
    "timestamp": "2025-11-13T19:44:19.864Z"
  },
  {
    "slug": "healthline-segment-understanding-cholera-with-nurse-ayomide-from-diamed-centre-1763062912164",
    "headline": "Healthline Segment: Understanding Cholera with Nurse Ayomide from Diamed Centre",
    "kicker": "",
    "summary": "",
    "bodyText": "On our Healthline segment, we were joined by Nurse Akinwekomi Ayomide O. from\nDiamed Centre Hospital, who shed light on cholera prevention and awareness amid\nrising reports of outbreaks in some regions.\n\nShe explained the causes, symptoms, and treatments of cholera, stressing the\nimportance of clean water, proper sanitation, and early medical attention.\n\nNurse Akinwekomi also tackled some of the myths surrounding cholera, from the false\nbelief that alcohol or peppery foods can “kill” the bacteria, to the misconception that\nonly people in rural areas are at risk.\n\nHer message was clear: “Cholera thrives where hygiene fails and prevention starts with simple habits like handwashing and safe food handling.”",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/907f753e-a060-4e11-b443-fe1d0bd92d64.jpeg",
    "timestamp": "2025-11-13T19:41:52.164Z"
  },
  {
    "slug": "it-s-unfortunate-our-super-eagles-are-being-owed-peter-obi-1763040966361",
    "headline": "It’s unfortunate our Super Eagles are being owed – Peter Obi",
    "kicker": "",
    "summary": "",
    "bodyText": "In a statement on his verified X account on Wednesday, Mr Obi lamented that a country that finds resources for “needless lavish spending” cannot meet its obligations to athletes who represent it with pride.\n\nLabour Party’s 2023 presidential candidate, Peter Obi, has condemned the Nigeria Football Federation (NFF) and the federal government over the non-payment of allowances owed to the Super Eagles, describing the situation as “truly unfortunate” and symptomatic of Nigeria’s governance failures.\n\nIn a statement on his verified X account on Wednesday, Mr Obi lamented that a country that finds resources for “needless lavish spending” cannot meet its obligations to athletes who represent it with pride.\n\n“It is truly unfortunate that our Super Eagles, who consistently give their best in representing our dear nation, are being owed their allowances,” Mr Obi wrote. “We always seem to find money to waste on needless lavish spending and political patronage, yet we cannot pay those who patriotically raise our flag, bring us pride, and serve with dedication. That is what is found in a now disgraced country.”\n\nThe former Anambra governor said the development reflects a deep moral problem in Nigeria’s governance culture.\n\n“When those who serve their country are not treated with dignity, it sends the wrong message to our youth — that hard work and service are not rewarded. Those who represent Nigeria deserve to be paid promptly and treated with respect. We must do better,” he added.\n\nMr Obi’s statement comes amid an ongoing crisis in the Super Eagles’ camp in Rabat, Morocco, where players and officials boycotted training on Tuesday over long-standing unpaid bonuses and allowances.\n\nThe players who threatened not to train until the Nigeria Football Federation settles its debts, have made peace with the federation, after the boycott initially casted a shadow on the Preparations ahead of today’s games.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/73d995bb-0cbf-44b3-8eb9-71375325dd7f.webp",
    "timestamp": "2025-11-13T13:36:06.361Z"
  },
  {
    "slug": "dr-congo-offers-1m-per-player-for-w-cup-play-off-ticket-1763039907235",
    "headline": "DR Congo offers $1m per player for W’Cup Play-off Ticket",
    "kicker": "",
    "summary": "",
    "bodyText": "The Democratic Republic of Congo have promised each player a one-million-dollar bonus if they qualify for the intercontinental play-offs of the 2026 FIFA World Cup.\n\nThe Leopards face Cameroon on Thursday, November 13, in the African play-offs, with the winner set to meet either Nigeria or Gabon for a place in the intercontinental stage.\n\nAccording to Sport News Africa, President Félix Tshisekedi personally approved the incentive, with arrangements already made for Rawbank to transfer the funds directly to the players if qualification is secured by November 16.\n\nThe offer applies only to players, excluding coach Sébastien Desabre and his staff, as the government aims to inspire a first World Cup appearance since 1974.\n\nThe CAF-organised play-offs, hosted in Morocco from November 13 to 16, feature four top African runners-up competing for a single spot in the intercontinental play-offs for the expanded 2026 World Cup in North America.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/835a64f3-ac4c-4795-9883-e4451c75445b.jpeg",
    "timestamp": "2025-11-13T13:18:27.235Z"
  },
  {
    "slug": "super-eagles-clash-with-gabon-today-1763025375510",
    "headline": "Super Eagles Clash with Gabon Today",
    "kicker": "",
    "summary": "",
    "bodyText": "The Super Eagles of Nigeria will clash with the Panthers of Gabon in a CAF World Cup semifinal   playoff in Morocco later today.\n\nThe match is a must win for the Eric Chelle charges. Report from the Super Eagles Camp in Morocco say they have resumed training on Wednesday after boycotting Tuesday’s session citing unpaid bonuses.\n\nSources say the standoff has been resolved following discussions between the players and the Nigeria Football Federation (NFF).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/96ebd30b-d742-4a8a-8ea5-06b22d85f1a1.jpg",
    "timestamp": "2025-11-13T09:16:15.510Z"
  },
  {
    "slug": "adele-lands-her-first-acting-role-in-movie-by-former-fashion-designer-tom-ford-1763024844968",
    "headline": "Adele Lands Her First Acting Role in Movie by Former Fashion Designer, Tom Ford.",
    "kicker": "",
    "summary": "British Grammy winning singer Adele Laurie Blue Adkins popular known Adele has landed her first acting role in the next movie by former fashion designer Tom Ford.",
    "bodyText": "British Grammy winning singer Adele Laurie Blue Adkins popular known Adele has landed her first acting role in the next movie by former fashion designer Tom Ford.\n\nThe ‘Hello’ hitmaker is set to star alongside old timers including Nicholas Hoult, Aaron Taylor-Johnson, Colin Firth, Paul Bettany and Adolescence's breakthrough star Owen Cooper in Cry to Heaven. Details about her character or role in the movies is still under wraps.\n\nIt will be adapted from Anne Rice's 1982 novel, which is set in the 18th Century world of the \"castrati\" - male singing stars who were castrated to preserve their high voices.\n\nWatchout Adele is coming to a screen near you or right inside your living room or mobile devices.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/68bc2eaf-8077-46af-a69d-d9fa61d00823.jpg",
    "timestamp": "2025-11-13T09:07:24.968Z"
  },
  {
    "slug": "google-denies-removing-western-sahara-border-for-morocco-users-1763024631100",
    "headline": "Google Denies Removing Western Sahara border for Morocco Users",
    "kicker": "",
    "summary": "",
    "bodyText": "The company issued the disclaimer on Tuesday, explaining that the dotted lines illustrating the border between Western Sahara and Morocco have never been visible to people using Google Maps in the Morocco.\n\nAfter media reports last week highlighted the discrepancy, linking it to the UN Security Council endorsing the Moroccan autonomy plan for Western Sahara, the tech giant has now clarified it  saying the different border displays have always been the case.\n\nWestern Sahara is a vast mineral-rich former Spanish colony that is largely controlled by Morocco but has been claimed for decades by the pro-independence Polisario Front, which is supported by Algeria.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cd1c8717-29b9-4044-a692-9b2a197835ba.jpeg",
    "timestamp": "2025-11-13T09:03:51.100Z"
  },
  {
    "slug": "dangote-group-announces-plans-to-invest-1-billion-in-zimbabwe-1763023787339",
    "headline": "Dangote Group Announces Plans to Invest $1 Billion in Zimbabwe",
    "kicker": "",
    "summary": "",
    "bodyText": "Dangote Group has announced plans to invest up to $1 billion in Zimbabwe to develop cement and power plants and  a fuel pipeline.\n\nPresident and Chief Executive of the Dangote Group, Aliko Dangote, disclosed this  after a meeting with Zimbabwean President Emmerson Mnangagwa in Harare on Wednesday.\n\nDangote said   the efforts of Mnangagwa to   turn his country’s economy around were showing already. He noted that results of the government efforts inspired the group’s decision that this is the right time for  to .invest in Zimbabwe.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a91d12ad-f690-428f-82c4-a5be95ce1769.png",
    "timestamp": "2025-11-13T08:49:47.339Z"
  },
  {
    "slug": "ipob-leader-files-application-at-the-court-of-appeal-for-a-stay-of-further-proceedings-1763023311206",
    "headline": "IPOB Leader Files Application at the Court of Appeal For a Stay of Further Proceedings",
    "kicker": "",
    "summary": "",
    "bodyText": "The leader of the Indigenous People of Biafra, IPOB, has filed an application at the Court of Appeal, praying for a stay of further proceedings in his trial before Justice James Omotosho of Abuja Federal High Court.\n\nIn the motion, Kanu urged the Appeal Court to stay delivery of judgment scheduled for November 20, 2025, pending the determination of the appeal.\n\nHe filed the motion on notice pursuant to section 36(1) of the Nigerian constitution, which guarantees that in the determination of one's civil rights and obligations, including any question or determination by or against a government or authority, a person is entitled to a fair hearing within a reasonable time by an independent and impartial court or other tribunal. This right ensures a just legal process, preventing unfair judgments by an unbiased body.\n\nPlans by the Peoples Democratic Party, PDP, to hold a national convention in the next 48 hours seem to have suffered another setback, as a Federal High Court in Abuja has again restrained it from holding its National Convention scheduled to be held in Ibadan, Oyo State, between November 15 and 16.\n\nThe court also barred the Independent National Electoral Commission (INEC) from supervising, monitoring, or recognizing the outcome of the Convention, where national officers are expected to be elected.\n\nThe court gave the order while delivering a ruling in an application brought by a former governor of Jigawa State, Sule Lamido.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/939e60bd-ee46-46e7-acf4-854a5c976030.webp",
    "timestamp": "2025-11-13T08:41:51.206Z"
  },
  {
    "slug": "tacha-breaks-two-guinness-world-records-1762966752096",
    "headline": "Tacha Breaks Two Guinness World Records ",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigerian media personality Anita Natacha Akide, popularly known as Symply Tacha, has made history after completing 82 full cosmetic makeovers in eight hours on October 11, 2025, and 144 in 24 hours the following day during her Tacha Beauty Fest in Lagos.\n\nGuinness World Records confirmed the remarkable achievements today, officially recognizing Tacha's record-breaking feat. \n\nEach makeover included the application of foundation, concealer, blush, eyeshadow, mascara, lip liner, gloss, and powder.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2c63b3fe-421d-4dc6-a034-aff160b9d590.jpeg",
    "timestamp": "2025-11-12T16:59:12.096Z"
  },
  {
    "slug": "false-accusation-culture-when-allegations-go-wrong-1762958910358",
    "headline": "False Accusation Culture: When Allegations Go Wrong",
    "kicker": "",
    "summary": "The Base Sunrise with Charity Owoh closed this morning with a critical social topic—false accusations and their impact.",
    "bodyText": "Enugu Case: A 29-year-old woman, Chisom Okonkwo, accused her husband, Ozioma Okonkwo, of sexually assaulting their two young daughters during a marital dispute. Investigations revealed no evidence of abuse, and the case is now being handled under the law for defamation and giving false information to authorities.\n\nTrending on X: social media, conversations around Vivian Okeke sparked debate when alleged remarks encouraging false rape accusations went viral. This brought to light questions about misinformation, accountability, and the consequences of public speech.\n\nListeners were invited to reflect on the societal impact of false claims, how to protect genuine victims, and the broader cultural implications for trust and justice in families and communities.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3aaf6298-2bec-471a-8c62-29ad5f556530.jpeg",
    "timestamp": "2025-11-12T14:48:30.358Z"
  },
  {
    "slug": "nigeria-submits-formal-request-for-prison-transfer-of-former-deputy-senate-president-ike-ekweremadu-1762942662700",
    "headline": "Nigeria Submits Formal Request for Prison Transfer of Former Deputy Senate President, Ike Ekweremadu",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria has dispatched a high-level delegation to begin discussions with the UK government over the possibility of former Deputy Senate President Ike Ekweremadu serving out the remainder of his prison sentence in the United Kingdom for human trafficking and organ harvesting in Nigeria.\n\nThe delegation, which included the Minister of Foreign Affairs, Yusuf Tuggar, and the Attorney General and Minister of Justice, Lateef Fagbemi.\n\nA source says that a formal request for a prisoner transfer to allow Ekweremadu to serve the remainder of his sentence in Nigeria has been submitted.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/bc479987-b52d-4f7d-b912-5d891782f21e.jpg",
    "timestamp": "2025-11-12T10:17:42.700Z"
  },
  {
    "slug": "tense-standoff-in-abuja-between-soldiers-and-fct-minister-nyesom-wike-1762942349835",
    "headline": " Tense Standoff  in Abuja Between Soldiers and FCT Minister, Nyesom Wike",
    "kicker": "",
    "summary": "",
    "bodyText": "A tense standoff occurred in Abuja on Tuesday when soldiers prevented the Federal Capital Territory Minister, Nyesom Wike, and officials of the FCTA from accessing disputed estate land.\n\nA viral video shows the soldiers blocking the minister’s convoy, leading to a heated verbal exchange between Wike and one of the officers.\n\nWike accused the soldiers of obstructing lawful government activities, while the officer insisted he was acting on orders and that the land was “legally acquired.”\n\nThe confrontation, which quickly escalated, drew public attention and highlighted growing tensions over land disputes in the FCT.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/54aa7b0d-c907-456e-849e-f4421fb92512.jpg",
    "timestamp": "2025-11-12T10:12:29.835Z"
  },
  {
    "slug": "catherine-connolly-has-been-sworn-in-as-the-10th-president-of-the-republic-of-ireland-1762941923294",
    "headline": "Catherine Connolly has been sworn in as the 10th President of the Republic of Ireland.",
    "kicker": "",
    "summary": "",
    "bodyText": "Catherine Connolly has been sworn in as the 10th President of the Republic of Ireland.\n\nConnolly, speaking at Dublin Castle, where she was inaugurated, said she was looking forward to her first visit to Northern Ireland as president and that she would foster an inclusive dialogue across the island.\n\nConnolly was elected in a landslide vote at the end of October, defeating Fine Gael candidate Heather Humphreys.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/1aac99cb-248c-451a-8e17-942183b007f7.jpg",
    "timestamp": "2025-11-12T10:05:23.294Z"
  },
  {
    "slug": "super-eagles-boycott-training-session-1762941611712",
    "headline": "Super Eagles Boycott Training Session",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria’s Super Eagles on Tuesday boycotted their training session ahead of Thursday’s must-win 2026 FIFA World Cup playoff against Gabon.\n\nReports from the Morocco camp of the eagles cited the non-payment of allowances and bonuses dating back to 2019.\n\nAlready in camp are 23 players, including Osimhen, Alex Iwobi, Wilfred Ndidi, William Troost-Ekong, Calvin Bassey, Samuel Chukwueze, and Ademola Lookman, with goalkeeper Maduka Okoye still expected to arrive.\n\nThe Super Eagles are expected to resume training on Wednesday, pending a resolution of the financial dispute, as they seek to stay focused ahead of what is widely regarded as one of Nigeria’s most crucial fixtures in recent years.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/35ff89d0-9f02-4fe0-82f1-a3f93519a4ad.jpg",
    "timestamp": "2025-11-12T10:00:11.712Z"
  },
  {
    "slug": "sabrina-carpenter-makes-big-screen-return-1762941481478",
    "headline": "Sabrina Carpenter Makes Big Screen Return",
    "kicker": "",
    "summary": "",
    "bodyText": "Grammy-winning American singer Sabrina Carpenter is making a return to the big screen after a long break from acting in a new musical inspired by Lewis Carroll's Alice in Wonderland.\n\nIt will be Carpenter's first leading role in a theatrical motion picture.\n\nClose sources say the ‘Expresso’ hitmaker will also produce the as-yet unnamed film, which will be released by Universal Pictures and is to be written and directed by Lorene Scafaria.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d2a6fb21-f208-4559-b8de-0006e0b9a21f.jpeg",
    "timestamp": "2025-11-12T09:58:01.478Z"
  },
  {
    "slug": "squid-game-star-o-yeong-su-acquitted-of-sexual-misconduct-charges-1762941356987",
    "headline": "Squid Game Star O Yeong-Su, Acquitted of Sexual Misconduct Charges",
    "kicker": "",
    "summary": "",
    "bodyText": "Squid Game star O Yeong-Su has been acquitted of sexual misconduct charges by a court in South Korea.\n\nYeong-Su, 81, was charged in 2022 with sexually assaulting a woman twice. The allegations said that he hugged the woman and kissed her on the cheek against her will.\n\nHowever, he was found guilty in 2024 and given an eight-month suspended prison sentence but said he would appeal against the verdict.\n\nOn Tuesday, a court overturned his sentence, saying he had undergone classes on sexual violence and suggesting that the alleged victim's memory may have been \"distorted,\" considering how long ago the incident occurred.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3b307bc2-1e25-4db1-9454-ed55187c9e9b.webp",
    "timestamp": "2025-11-12T09:55:56.987Z"
  },
  {
    "slug": "vip-protection-vs-community-safety-1762900265291",
    "headline": "VIP Protection vs. Community Safety",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "A new report by the European Union Agency for Asylum reveals that over 100,000 police\nofficers in Nigeria are assigned to VIPs, leaving ordinary citizens with limited protection.\n\nOut of a total police force of 371,800, this has contributed to slow emergency\nresponses, corruption, and weak accountability.\n\nExperts and policy advisers, including Hadiza Bala-Usman, have called for reforms to\nallow private security firms to handle VIP protection, freeing the police to focus on\nnational security and community policing.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/20d22de6-9276-45a4-b6d0-5f62faaa20f3.jpeg",
    "timestamp": "2025-11-11T22:31:05.291Z"
  },
  {
    "slug": "nigerians-jailed-in-london-phone-robbery-spree-1762900131076",
    "headline": "Nigerians Jailed in London Phone Robbery Spree",
    "kicker": "By Charity Owoh",
    "summary": "",
    "bodyText": "Four Nigerians received lengthy prison sentences in the UK for their roles in a violent\nphone robbery syndicate.\n\n The gang carried out 13 coordinated robberies targeting\nmobile phone outlets in London, stealing devices valued at £240,000.\n\nA total of ten suspects were tried, with eight pleading guilty to conspiracy to rob,\nreceiving a combined 55 years in prison. \n\nThe case highlights the dangers of organised\ncrime and the importance of vigilance at home and abroad",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6614a71d-fed9-43b6-b411-8d00aa6da4c4.jpeg",
    "timestamp": "2025-11-11T22:28:51.076Z"
  },
  {
    "slug": "the-grammys-and-the-illusion-of-recognition-how-afrobeats-is-being-boxed-not-celebrated-1762899818074",
    "headline": "The Grammys and the Illusion of Recognition: How Afrobeats is Being Boxed, Not Celebrated ",
    "kicker": "By QuincyJonze",
    "summary": "",
    "bodyText": "In recent years, the global music landscape has witnessed the undeniable rise of African sound, a vibrant fusion of rhythm, culture, and storytelling that has birthed what the world now casually labels “Afrobeats.”\n\nFrom Lagos to London, Johannesburg to New York, the genre has transcended borders, inspiring dance floors and dominating charts. Yet, beneath the applause and the seemingly flattering “African categories” at the Grammy Awards lies a more uncomfortable truth: what appears to be recognition is, in reality, a carefully orchestrated form of exploitation.\n\nWhen Ckay’s Love Nwantiti went viral across continents, charting in over 30 countries and becoming one of the most-streamed songs globally, it wasn’t simply a Nigerian success story; it was a global phenomenon. The same can be said for Rema’s Calm Down, which shattered streaming records and held the Billboard Hot 100 hostage for months, and Wizkid and Tems’ Essence, a soulful masterpiece that even Justin Bieber couldn’t resist jumping on. These were not just African hits; they were world hits — songs that resonated with listeners in Paris, New Delhi, and Los Angeles alike.\n\nYet, despite this global resonance, none of these tracks found a place in the Record of the Year or Song of the Year categories at the Grammys. Instead, they were grouped into the new “Best African Music Performance” category, a move the Recording Academy frames as inclusion, but which, upon closer inspection, appears to be containment. By isolating African excellence into its own box, the Grammys conveniently avoid allowing African artists to compete on equal footing with their Western counterparts.\nThis pattern betrays a deeper discomfort within the global music establishment. The Western world is eager to consume Afrobeats to dance to it, brand with it, and profit from its infectious rhythm but reluctant to legitimise it as an equal. The creation of the Afrobeats category feels less like progress and more like partition. It’s a symbolic pat on the back, not a seat at the main table.\n\nThe irony runs deeper when one considers that “Afrobeat” (singular) was not invented by the Grammys or any Western institution. It was pioneered by Fela Anikulapo Kuti and the Kuti family, a politically charged, musically sophisticated art form that challenged power structures and redefined African expression. The newer “Afrobeats” (plural), a more commercial evolution of that legacy, has carried the continent’s sound into global consciousness. Yet, rather than honour that lineage authentically, the West has repackaged it as an exotic export a flavour of the moment rather than a foundation of musical innovation.\n\nConsider Burna Boy, a Grammy winner, global performer, and cultural ambassador whose albums have sold out arenas from Madison Square Garden to Paris La Défense. Or Tyla, whose Water became a global anthem and earned her a viral spotlight most pop stars dream of. Both are household names, yet they too find themselves boxed in the “African categories,” rarely acknowledged as contenders for the main awards they’ve clearly earned the right to contest.\n\nThe message this sends is subtle but insidious: African artists can be popular, but not peerless; they can entertain the world, but not define it. The Grammys’ selective recognition reinforces a hierarchy that privileges Western artistry while commodifying African creativity for cultural cachet.\n\nIn truth, Afrobeats does not need the Grammys for validation. The world has already spoken in streams, in stadiums, in dance challenges, and in cultural crossovers that have reshaped global pop, but as long as institutions like the Grammys continue to frame African brilliance as an annex rather than a cornerstone, the celebration will always be laced with exploitation.\n\nIf the Recording Academy truly seeks to honor music’s global evolution, it must stop treating Africa as a genre and start acknowledging it as a force. Because what artists like Wizkid, Tems, Rema, Ckay, Burna Boy, Tyla, and many others have built is not a niche — it’s the sound of a generation. And it deserves not just a category, but its rightful place in the world’s biggest conversations about art, innovation, and excellence.\n \n- QuincyJonze",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/da929720-7a44-416d-bd09-4307150a3b3c.jpeg",
    "timestamp": "2025-11-11T22:23:38.074Z"
  },
  {
    "slug": "entertainment-highlights-seyi-vibez-and-pretty-mike-dominate-the-conversation-1762899569395",
    "headline": "Entertainment Highlights: Seyi Vibez and Pretty Mike Dominate the Conversation",
    "kicker": "By QueenDivavee ",
    "summary": "",
    "bodyText": "Seyi Vibez, has announced his upcoming project ‘Fuji Moto,’ dropping November 14, 2025. The announcement sparked conversations around how Seyi continues to blend Fuji culture with modern Afrobeats sound — proving that originality still pays off in an industry full of trends.\n\nANightlife influencer Pretty Mike, who recently made headlines after being granted ₦50 million bail following his arraignment for alleged drug-related offences. \n\nWe reflected on the balance between fame, public image, and accountability — asking listeners whether celebrity lifestyle choices should affect their credibility or if everyone deserves the chance to rebuild after mistakes.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2e3bf5ff-02a5-4a7c-b901-6180ee8c11e5.jpeg",
    "timestamp": "2025-11-11T22:19:29.395Z"
  },
  {
    "slug": "insecurity-naf-strikes-kill-terrorists-bandits-in-borno-kwara-katsina-others-1762855817544",
    "headline": "Insecurity: NAF Strikes Kill Terrorists, Bandits in Borno, Kwara, Katsina, Others ",
    "kicker": "",
    "summary": "",
    "bodyText": "Numerous Islamic State of West Africa Province (ISWAP) terrorists were killed by a series of precision airstrikes carried out by the Nigerian Air Force (NAF) in the Mallam Fatori and Shuwaram regions of Borno State as part of the NAF's increased nationwide counterterrorism and counterbanditry operations.\n\nThis occurred as members of the FCT Police Anti-Kidnapping Unit conducted a special church patrol in forests and border communities connecting Bwari in Kaduna State, Bwari in Niger State, and Gwagwalada, also in Niger State, in collaboration with Department of State Services (DSS) employees, local hunters, and vigilante groups.\nAt least four nursing mothers were reportedly abducted by bandits yesterday in Yan Kwada village, Faruruwa community, in the Shanono Local Government Area of Kano State.\n\nAdditionally, Governor Abdullahi Sule of Nasarawa State has ordered a manhunt for the gunmen who attacked residents of the Sarkin Noma community in the Keana Local Government Area at midnight, promising to bring the perpetrators to justice as soon as possible. Meanwhile, Dr. Nasir Idris, the governor of Kebbi State, boasted yesterday that not a single square inch of his state was occupied by armed bandits.\n\nIn a similar vein, the Islamic State of West Africa Province (ISWAP), Jam'at Ahl as-Sunna lid-Da'wa wa'l-Jihd (JAS), and Boko Haram factions engaged in a deadly battle at Toumbun Gini, an island community in Borno State's Abadam Local Government Area, that left over 100 people dead.\n\n\"The coordinated missions, executed on November 9, 2025, represent a decisive phase in ongoing joint operations under Operation Hadin Kai and Operation Fasan Yamma, aimed at degrading terrorist and criminal networks across Nigeria's northern theatres,\" stated Air Commodore Ehimen Ejodame, Director of Public Relations and Information, NAF, who made these announcements yesterday.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2292b0d4-5b4f-49bf-bc88-cd19dfece844.png",
    "timestamp": "2025-11-11T10:10:17.544Z"
  },
  {
    "slug": "chief-timipre-sylva-declared-wanted-1762855099060",
    "headline": "Chief Timipre Sylva Declared Wanted",
    "kicker": "",
    "summary": "The Economic and Financial Crimes Commission (EFCC) yesterday declared former Minister of State for Petroleum Resources and ex-Governor of Bayelsa State, Chief Timipre Sylva, wanted over an alleged case of conspiracy and dishonest conversion of $14,859,257.",
    "bodyText": "The Economic and Financial Crimes Commission (EFCC) yesterday declared former Minister of State for Petroleum Resources and ex-Governor of Bayelsa State, Chief Timipre Sylva, wanted over an alleged case of conspiracy and dishonest conversion of $14,859,257.\n\nThe amount is said to be part of the funds injected by the Nigerian Content Development and Monitoring Board (NCDMB) into Atlantic International Refinery and Petrochemical Limited for the construction of a refinery in Bayelsa State.\n\nBut Sylva has dismissed the allegations, describing them as another persecution and smear campaign by his political enemies, just as he claimed there was no due process by the EFCC in declaring him wanted.\n\nA statement by the EFCC’s Head of Media and Publicity, Mr. Dele Oyewale, said the commission secured a warrant for Sylva’s arrest from a Federal High Court sitting in Lagos on November 6.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/ca911f12-f318-455b-8579-e742155f6517.jpeg",
    "timestamp": "2025-11-11T09:58:19.060Z"
  },
  {
    "slug": "anambra-decides-2025-1762848822864",
    "headline": "Anambra Decides 2025",
    "kicker": "",
    "summary": "",
    "bodyText": "The people of Anambra State went to the polls on Saturday, November 8, 2025, to elect their governor for the next four years. The election, conducted by the Independent National Electoral Commission (INEC), attracted widespread attention across Nigeria due to the state’s political significance and history of competitive elections.\n \nThe race was primarily between the incumbent governor, Professor Chukwuma Charles Soludo of the All Progressives Grand Alliance (APGA), and Nicholas Ukachukwu of the All Progressives Congress (APC). Other notable contenders included George Moghalu of the Labour Party (LP), John Chuma-Nwosu of the African Democratic Congress (ADC), and Paul Chukwuma of the Young Progressives Party (YPP). Soludo, a former Central Bank Governor and a technocrat-turned-politician, sought re-election on the strength of his first-term achievements, including infrastructure development, youth empowerment, and public sector reforms. His campaign message focused on continuity and consolidation of his “Anambra Agenda” aimed at turning the state into a hub for investment and innovation in the Southeast. Ukachukwu and other opposition candidates, however, argued that the incumbent had failed to meet expectations on job creation, security, and inclusiveness in governance, urging voters to seek change.\n \nAccording to INEC data, Anambra had 2,802,790 registered voters, with women making up slightly more than half. However, turnout was low across most polling units, with reports indicating that fewer than 20% of registered voters cast their ballots. Observers from civil society groups noted that while the voting process was largely peaceful and orderly, the low participation reflected growing voter apathy and disillusionment with the political class. Security presence across the state was heavy, with thousands of police officers and soldiers deployed to maintain calm. Although a few isolated incidents of intimidation and vote-buying were reported in some local government areas, the election was generally free from major violence or disruptions.\n \nAfter collation at the state INEC headquarters in Awka, Professor Chukwuma Soludo was declared the winner of the election. He polled a total of 422,664 votes, defeating his closest rival, Nicholas Ukachukwu of the APC, who secured 99,445 votes. The Labour Party’s George Moghalu came in a distant third. INEC recorded 584,054 valid votes and 11,244 rejected ballots. In a remarkable show of dominance, Soludo won in all 21 Local Government Areas of Anambra State — a rare political feat that underscored APGA’s enduring grassroots structure and brand strength in the region.\n \nThe result sparked mixed reactions. Supporters of APGA celebrated across major towns, particularly in Awka, Onitsha, and Nnewi, hailing Soludo’s re-election as a victory for continuity and progress. Opposition figures, however, criticized the process, citing widespread vote-buying and voter intimidation. Civil society organizations and election observers echoed similar concerns, calling for deeper electoral reforms to restore citizens’ confidence in Nigeria’s democratic institutions. Despite the criticisms, the general consensus was that the 2025 election represented a relatively peaceful democratic exercise compared to previous cycles in the state.\n \nSoludo’s landslide victory offers both opportunity and challenge. On one hand, his overwhelming mandate grants him political legitimacy and the freedom to push forward with his development agenda. On the other, the low voter turnout raises important questions about civic engagement and the health of democracy in the state. For Anambra’s leadership, the next four years will be critical in addressing unemployment, youth restiveness, and infrastructural decay — issues that dominated pre-election debates. The administration will also be expected to deliver tangible improvements in education, healthcare, and local government empowerment. Politically, APGA’s sweeping victory reaffirms its dominance in Anambra State, even as the Labour Party and APC continue to strengthen their grassroots networks in the Southeast. The opposition will likely turn to the courts or public campaigns to challenge aspects of the electoral process.\n \nGovernor Soludo’s second term will test his ability to build trust among disenchanted voters and maintain a balance between technocratic efficiency and political inclusion. Analysts believe his re-election could either consolidate his reputation as a reform-minded leader or expose the limitations of incumbency politics in a challenging socio-economic climate. Beyond Anambra, the election also sends a national message: voter turnout and electoral integrity remain key issues in Nigeria’s democratic evolution. The state’s experience underscores the need for stronger political education, anti-corruption measures during elections, and more transparent campaign financing.\n \nThe 2025 Anambra Governorship Election reaffirmed APGA’s political dominance under Chukwuma Soludo, who now faces the task of transforming his electoral success into meaningful governance. While the election was largely peaceful, the pervasive voter apathy and allegations of vote-buying reflect deeper systemic issues. As Soludo prepares for another four years, the people of Anambra — and indeed Nigeria — will be watching closely to see whether his second term delivers not just continuity, but renewed confidence in leadership and democracy itself.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/956147a4-8bef-4791-b600-41d0b2a7ae78.jpeg",
    "timestamp": "2025-11-11T08:13:42.864Z"
  },
  {
    "slug": "wafu-b-glory-falconets-cruise-past-benin-to-maintain-perfect-run-1762794318338",
    "headline": "WAFU B Glory: Falconets Cruise Past Benin to Maintain Perfect Run",
    "kicker": "",
    "summary": "",
    "bodyText": "Nigeria’s Falconets maintained their perfect start at the 2025 WAFU B U-20 Girls Cup with a dominant 3-0 victory over Benin Republic at the Stade Adjanhou on Sunday.\n\nForward Ramotalahi Kareem was the driving force once again, scoring twice to inspire the defending champions to another commanding performance.\n\nThe Falconets, wasted no time stamping their authority on the match as Kareem opened the scoring in the 15th minute after a well-worked team move.\n\nBenin’s Amazons showed determination and moments of courage in front of their home crowd, but Nigeria’s fluid attacking play proved too much to handle.\n\nKareem doubled the lead in the 59th minute, calmly slotting past the Beninese goalkeeper to put the result beyond doubt.\n\nSubstitute Precious Oscar added the final flourish deep into stoppage time, finishing off a flowing counter-attack to seal a comprehensive 3-0 win for the Falconets.\n\nFor her brace and tireless display, Kareem was named Player of the Match. The victory leaves Nigeria top of the three-team tournament and firmly on course for a top-place finish as they continue their pursuit of back-to-back regional titles.\n\nNigeria’s defensive solidity and clinical finishing have made them early favourites to retain their WAFU B crown.\n\nWith two convincing victories and six goals scored in as many games, the Falconets have once again demonstrated their dominance in West African women’s football as they face Ghana and Benin again on Tuesday and Wednesday, respectively.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/69705628-4cb4-4dcd-8f6b-de26ca361255.jpg",
    "timestamp": "2025-11-10T17:05:18.338Z"
  },
  {
    "slug": "chaos-in-katsina-player-injured-during-katsina-united-vs-barua-fc-clash-1762794105157",
    "headline": "Chaos in Katsina: Player Injured During Katsina United vs Barua FC Clash",
    "kicker": "",
    "summary": "",
    "bodyText": "Fresh concerns have emerged over player safety in the Nigeria Premier Football League (NPFL) after Barau FC midfielder, Nana Abraham, was allegedly stabbed in the neck by a pitch invader during his team’s away match against Katsina United at the Muhammadu Dikko Stadium on Saturday. \n\nOn a closer look in a video circulated on social media, it was a stone been thrown at the player causing a cut in the neck area, and it was attended to swiftly by the medical team on ground, as play was stopped to that effect. \n\nThe shocking incident occurred moments after Barau FC scored a 69th-minute equaliser in the tense encounter.\n\nImages circulating on social media showed Abraham bleeding heavily from the neck while receiving emergency medical attention on the pitch.\n\nHe was later substituted and taken to a nearby hospital, where he is said to be responding to treatment.\n\nIt follows several similar episodes that have marred the 2025/26 NPFL season, raising serious concerns about the effectiveness of crowd control and stadium safety.\n\nIn October, the NPFL handed down heavy sanctions to Kano Pillars after fans invaded the Sani Abacha Stadium pitch during a Matchday 8 clash against Shooting Stars Sports Club (3SC).\n\nThe violent scenes erupted moments after 3SC scored a dramatic 94th-minute equaliser.\n\nSeveral match officials and away team players were assaulted in the chaos, prompting the league to impose a ₦9.5 million fine, deduct three points and three goals from Pillars’ record, while also banning the team from their Sani Abacha Stadium home ground for at least 10 home matches.\n\nIn an October decision signed by NPFL’s Chief Operating Officer Davidson Owumi, the league management vowed to maintain “a zero-tolerance policy for violence,” warning that any future infractions would attract even stiffer penalties.\n\n“We will invoke the rules wherever and whenever required to keep bad behaviour of fans, players and officials out of the league,” Mr Owumi said in the statement released on October 13.\n\nThat statement, now more relevant than ever, underscores the NPFL’s ongoing struggle to translate disciplinary pronouncements into consistent deterrence. Despite multiple sanctions, violence has persisted at alarming levels.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/424ed144-9bd5-4eca-8ae3-7699de89c653.jpeg",
    "timestamp": "2025-11-10T17:01:45.157Z"
  },
  {
    "slug": "super-eagles-begin-camp-as-full-squad-list-drops-ahead-of-qualifiers-1762793911359",
    "headline": "Super Eagles Begin Camp as Full Squad List Drops Ahead of Qualifiers",
    "kicker": "",
    "summary": "Nigeria’s Head Coach, Eric Chelle, has named a 24-man squad for the decisive 2026 FIFA World Cup African Play-off Tournament in Rabat, Morocco, recalling goalkeeper Maduka Okoye, Spain-based forward Chidera Ejuke, and midfielder Raphael Onyedika for the crucial encounter.",
    "bodyText": "Nigeria’s Head Coach, Eric Chelle, has named a 24-man squad for the decisive 2026 FIFA World Cup African Play-off Tournament in Rabat, Morocco, recalling goalkeeper Maduka Okoye, Spain-based forward Chidera Ejuke, and midfielder Raphael Onyedika for the crucial encounter.\n\nBright Osayi-Samuel who was injured in the last qualifying window is also in the roster made public on Saturday.\n\nThe Super Eagles will face Gabon in the first semi-final at the 22,000-capacity Complexe Sportif Prince Héritier Moulay El Hassan on Thursday, while Cameroon take on DR Congo in the other semi-final at the El-Barid Stadium.\n\nChelle’s list features the core of Nigeria’s experienced internationals alongside a few returning and emerging names as the Super Eagles seek redemption after their underwhelming group campaign.\n\nCaptain William Troost-Ekong, striker Victor Osimhen, and first-choice goalkeeper Stanley Nwabali headline the squad, which also includes defender Calvin Bassey and young prospect Benjamin Fredericks.\n\nIn midfield, the experienced duo of Alex Iwobi and Wilfred Ndidi return, alongside Frank Onyeka and Alhassan Yusuf, while Onyedika’s inclusion adds depth and structure to Chelle’s transitional plans.\n\nIn attack, Chelle has gone for a balance of flair and form, with Ademola Lookman, Samuel Chukwueze, Moses Simon, and Osimhen joined by Ejuke, Tolu Arokodare, Jerome Akor Adams, and Olusegun Olakunle — all players capable of offering pace, width, and goal threat in a game of high stakes.\n\nDefender Semi Ajayi is suspended for the semi-final after picking up two yellow cards during the 10-match qualifying series.\n\nThe Hull City man will be available only if Nigeria advances to the final round.\n\nThe players are expected to arrive in Rabat from their respective club bases on Monday, 10 November, ahead of a four-day closed training camp.\n\nThe winner of the Nigeria–Gabon tie will face either Cameroon or DR Congo for a place in the final qualifying phase, where Africa’s representatives for the global tournament will be decided.\n\n24 Super Eagles for 2026 FIFA World Cup Africa Play-Off Tournament\n\nGoalkeepers: Stanley Nwabali (Chippa United, South Africa); Amas Obasogie (Singida Blackstars, Tanzania); Maduka Okoye (Udinese FC, Italy)\n\nDefenders: William Ekong (Al-Kholood, Saudi Arabia); Calvin Bassey (Fulham FC, England); Oluwasemilogo Ajayi (Hull City, England); Bright Osayi-Samuel (Birmingham City, England); Bruno Onyemaechi (Olympiakos, Greece); Chidozie Awaziem (Nantes FC, France); Zaidu Sanusi (FC Porto, Portugal); Benjamin Fredericks (Dender FC, Belgium)\n\nMidfielders: Alex Iwobi (Fulham FC, England); Frank Onyeka (Brentford FC, England); Alhassan Yusuf Abdullahi (New England Revolution, USA); Wilfred Ndidi (Besiktas FC, Turkey); Raphael Onyedika (Club Brugge, Belgium)\n\nForwards: Ademola Lookman (Atalanta BC, Italy); Samuel Chukwueze (Fulham FC, England); Victor Osimhen (Galatasaray FC, Turkey); Moses Simon (Paris FC, France); Chidera Ejuke (Sevilla FC, Spain); Tolu Arokodare (Wolverhampton Wanderers, England); Akor Adams (Sevilla FC, Spain); Olakunle Olusegun (Pari Nizhny Novgorod, Russia).",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/cd368b75-2e2b-4161-b29d-f4eb14968da3.jpg",
    "timestamp": "2025-11-10T16:58:31.359Z"
  },
  {
    "slug": "soludo-extends-olive-branch-1762789847343",
    "headline": "SOLUDO EXTENDS OLIVE BRANCH",
    "kicker": "",
    "summary": "",
    "bodyText": "Governor Chukwuma Charles Soludo has extended an olive branch to his fellow contestants following his sweeping victory in the November 8 Anambra governorship election.\n\nIn a statement, Soludo expressed appreciation to all those who participated in the race, including Nicholas Ukachukwu, Paul Chukwuma, George Moghalu, and others, acknowledging their shared commitment to the development of Anambra State.\n\nHe urged his opponents and their supporters to put political differences aside and join hands in advancing the state’s common goals — improved infrastructure, job creation, and enhanced community security.\n\nSoludo reaffirmed his pledge to run an inclusive and transparent government that listens to all voices, including dissenting ones.\n\nHe called on the people of Anambra to unite behind a collective vision of progress, saying his renewed mandate is an opportunity to build a stronger, more prosperous state for all.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/902d1345-1b1f-4094-90b9-35c2841ad466.webp",
    "timestamp": "2025-11-10T15:50:47.343Z"
  },
  {
    "slug": "soludo-re-elected-sweeps-all-21-lgas-in-anambra-poll-1762784068633",
    "headline": "SOLUDO RE-ELECTED, SWEEPS ALL 21 LGAS IN ANAMBRA POLL",
    "kicker": "",
    "summary": "",
    "bodyText": "Governor Charles Soludo of APGA has been reelected for a second term, winning all 21 local government areas with 422,664 votes.\n\nAPC's Nicholas Ukachukwu came second with 99,445 votes.\n\nTinubu and Nige congratulated Soludo, while LP's Moghalu and ADC's Nwosu rejected the results, alleging vote-buying. \n\nVoter turnout was 21.45%.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/374a433f-ac2b-444a-802d-98c77414a4c0.jpeg",
    "timestamp": "2025-11-10T14:14:28.633Z"
  },
  {
    "slug": "fayose-meets-obasanjo-in-ogun-1762783856804",
    "headline": "Fayose Meets Obasanjo in Ogun",
    "kicker": "",
    "summary": "",
    "bodyText": "A former Governor of Ekiti State, Ayodele Fayose, paid a visit to ex-President Olusegun Obasanjo at his residence in Abeokuta, Ogun State, yesterday, ahead of Fayose’s upcoming 65th birthday on November 15.\n\nPhotos shared on X by the Senior Special Assistant on Public Communication and Social Media to the FCT Minister, Nyesome Wike, Lere Olayinka, captured the two leaders in warm moments, signalling an end to years of public animosity.\n\nThe meeting also comes amid a series of high-profile visits to Fayose in the lead-up to his birthday, including one from former Vice President Yemi Osinbajo on Tuesday.\n\nOsinbajo said he decided to visit Fayose ahead of the celebration because he would not be available on the day of the event.\n\nDuring the visit, both leaders exchanged warm pleasantries and reflected on national issues, with Osinbajo commending Fayose’s courage and consistency in public life.\n\nFayose, in turn, expressed appreciation for the visit, describing it as a mark of respect and friendship across political lines",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/d787fe80-3861-4149-82dc-2919a2a6b7be.jpg",
    "timestamp": "2025-11-10T14:10:56.804Z"
  },
  {
    "slug": "man-dies-after-attempting-to-flee-efcc-raid-in-lekki-1762783647096",
    "headline": "Man Dies After Attempting to Flee EFCC Raid in Lekki",
    "kicker": "",
    "summary": "",
    "bodyText": "A man identified as Endurance Udeke has died after jumping from a four-storey building during a raid conducted by operatives of Nigeria’s Economic and Financial Crimes Commission (EFCC) in the Lekki area of Lagos.\n\nThe EFCC confirmed the incident in a statement issued on Saturday, saying the operation, which took place on 4 November, targeted suspected internet fraudsters residing at Periwinkle Estate, Lekki Phase 1.\n\nAccording to the agency, four suspects were arrested during the sting operation, while Udeke and another resident attempted to escape after learning of the EFCC’s presence.\n\nThe second individual survived after receiving treatment and has since been stabilised, according to EFCC officials.\n\nThe anti-graft agency stressed that its operatives had no physical contact with Udeke before the incident, describing his action as tragic and unnecessary.\n\nThe agency added that the case has been handed over to the police for further investigation into the circumstances surrounding Udeke’s death.\n\nThe EFCC urged the public to remain calm and cooperate during its lawful operations, insisting that its raids are conducted in accordance with due process.\n\nThe incident comes amid growing scrutiny of EFCC operations following several controversial raids in recent months.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/b6d2f418-2a7f-4aa1-940f-73065f6e5d65.webp",
    "timestamp": "2025-11-10T14:07:27.096Z"
  },
  {
    "slug": "at17-conversation-regina-daniels-ned-nwoko-1762774448776",
    "headline": "#At17 Conversation: Regina Daniels & Ned Nwoko",
    "kicker": "",
    "summary": "",
    "bodyText": "Following up with the trending #At17 discussion, Regina Daniels has stated that she was married at 17 and challenged Ned Nwoko to address allegations about her past, including claims around drug use.\n\nNed has responded, describing the viral video involving Regina’s family, where thugs\nwere allegedly sent to intimidate her — as a “Nollywood script.”\n\nBeyond the headlines, this story touched on deeper issues such as:\n- Age and consent in relationships\n- Power dynamics in marriages\n- How social media fuels narratives and shapes public opinion\n\nIt’s a reminder that celebrity stories often reflect broader societal conversations about\ninfluence, vulnerability, and accountability.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/51634bef-707d-47d8-990c-c85a8987cecb.jpeg",
    "timestamp": "2025-11-10T11:34:08.776Z"
  },
  {
    "slug": "uk-flags-21-nigerian-states-as-high-risk-1762774166090",
    "headline": "UK Flags 21 Nigerian States as High-Risk",
    "kicker": "",
    "summary": "",
    "bodyText": "The UK has updated it's travel advisory, warning citizens against traveling to 21 Nigerian states due to rising insecurity.\n\nThe advisory pointed to kidnapping, violent crime, and intercommunal clashes across regions — from the Northeast and Northwest to parts of the Southeast, the capital territory, and even concerns around crime levels in Lagos.\n\nFor many Nigerians, this is not shocking news — it simply underscores the security realities people face daily. It also raises important questions about governance, stability, and how international perception affects travel, business, and global\nengagement with Nigeria.\n\nThe core message is clear: staying informed and safety-conscious is essential.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/6fa1f400-8ed2-44cc-b4be-98226716506f.jpg",
    "timestamp": "2025-11-10T11:29:26.090Z"
  },
  {
    "slug": "special-adviser-to-the-lagos-state-governor-on-tourism-arts-culture-mr-idris-aregbe-celebrates-birthday-in-lagos-1762700254252",
    "headline": "Special Adviser to the Lagos State Governor on Tourism, Arts & Culture, Mr. Idris Aregbe Celebrates Birthday in Lagos",
    "kicker": "",
    "summary": "",
    "bodyText": "A very happy birthday to Mr. Idris Aregbe the Special Adviser to the Lagos State Governor on Tourism, Arts & Culture, Lagos State.\n\nIn attendance to his birthday celebration yesterday were Nollywood actresses, Ini Edo & Juliet Ibrahim among other dignitaries and personalities.\n\nThe Base Fm team wishes him many more fruitful years.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/a43471e9-0e34-46ab-a6a4-274b2d7f39d6.jpeg",
    "timestamp": "2025-11-09T14:57:34.252Z"
  },
  {
    "slug": "anambra-election-soludo-wins-own-polling-unit-1762633436918",
    "headline": "Anambra Election: Soludo Wins Own Polling Unit",
    "kicker": "",
    "summary": "",
    "bodyText": "Despite BVAS malfunction Governor Charles Soludo of APGA has won his polling unit in the Anambra governorship election, polling 417 votes at Ofiyi Square, Isuofia Ward, Aguata LGA. APC's Nicholas Ukachukwu got 4 votes, and ACCORD's candidate scored 1. Out of 933 registered voters, 430 were accredited, with 422 valid votes.\nVoting was briefly disrupted by a BVAS malfunction, but Soludo's strong local showing reflects solid grassroots support as results collation continues statewide.\nSource: Punch News",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/735ea883-f49f-4ffe-9a9f-3f8a7dde5959.jpeg",
    "timestamp": "2025-11-08T20:23:56.918Z"
  },
  {
    "slug": "burna-boy-davido-ayra-starr-wizkid-make-2026-grammy-nominations-list-1762556467709",
    "headline": "Burna Boy, Davido, Ayra Starr, Wizkid make 2026 Grammy Nominations List",
    "kicker": "",
    "summary": "The 2026 Grammy nominations revealed last night, with artists, albums, and songs competing for honours at the 68th annual ceremony.",
    "bodyText": "Burna Boy received two nominations, Best African Music Performance for “Love” and Best Global Music Album for “No Sign of Weakness,” making him the highest-nominated African artist this year.\n\nOther Nigerian stars on the list include Davido, Omah Lay, Ayra Starr, and Wizkid, alongside continental heavyweights such as Angélique Kidjo (Benin), Eddy Kenzo (Uganda), Tyla (South Africa), and Youssou N’Dour (Senegal).\n\nSee the full list of nominees below:\nAlbum of the Year\nBad Bunny – DeBÍ TiRAR MáS FOToS\nJustin Bieber – Swag\nSabrina Carpenter – Man’s Best Friend\nClipse – Let God Sort Em Out\nLady Gaga – Mayhem\nKendrick Lamar – GNX\nLeon Thomas – Mutt\nTyler, the Creator – Chromakopia\n\nRecord of the Year\nBad Bunny – “DtMF”\nSabrina Carpenter – “Manchild”\nDoechii – “Anxiety”\nBillie Eilish – “Wildflower”\nLady Gaga – “Abracadabra”\nKendrick Lamar with SZA – “Luther”\nChappell Roan – “The Subway”\nRosé and Bruno Mars – “APT.”\n\nSong of the Year\nLady Gaga – “Abracadabra”\nDoechii – “Anxiety”\nRosé and Bruno Mars – “APT.”\n“DtMF” – Bad Bunny\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden” (from KPop Demon Hunters)\nKendrick Lamar with SZA – “Luther”\nSabrina Carpenter – “Manchild”\nBillie Eilish – “Wildflower”\n\nBest African Music Performance\nBurna Boy – “Love”\nDavido Featuring Omah Lay – “With You”\nEddy Kenzo & Mehran Matin – “Hope & Love”\nAyra Starr featuring Wizkid – “Gimme Dat”\nTyla – “Push 2 Start”\n\nBest Global Music Performance\nBad Bunny – “EoO”\nCiro Hurtado – “Cantando en el Camino”\nAngélique Kidjo – “Jerusalema”\nYeisy Rojas – “Inmigrante Y Que?”\nShakti – “Shrini’s Dream” (Live)\nAnoushka Shankar featuring Alam Khan & Sarathy Korwar – “Daybreak”\n\nBest New Artist\nOlivia Dean\nKATSEYE\nThe Marias\nAddison Rae\nSombr\nLeon Thomas\nAlex Warren\nLola Young\n\nSongwriter of the Year, Non-Classical\nAmy Allen\nEdgar Barrera\nJessie Jo Dillon\nTobias Jesso Jr.\nLaura Veltz\n\nProducer of the Year, Non-Classical\nDan Auerbach\nCirkut\nDijon\nBlake Mills\nSounwave\n\nBest Pop Solo Performance\nJustin Bieber – “Daisies”\nSabrina Carpenter – “Manchild”\nLady Gaga – “Disease”\nChappell Roan – “The Subway”\nLola Young – “Messy”\n\nBest Pop Vocal Album\nJustin Bieber – Swag\nSabrina Carpenter – Man’s Best Friend\nMiley Cyrus – Something Beautiful\nLady Gaga – Mayhem\nTeddy Swims – I’ve Tried Everything But Therapy (Part 2)\n\nBest Pop Duo/Group Performance\nCynthia Erivo & Ariana Grande – “Defying Gravity”\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden”\nKATSEYE – “Gabriela”\nRosé and Bruno Mars – “APT.”\nSZA with Kendrick Lamar – “30 for 30”\n\nBest Dance Pop Recording\nSelena Gomez & benny blanco – “Bluest Flame”\nLady Gaga – “Abracadabra”\nZara Larsson – “Midnight Sun”\nTate McRae – “Just Keep Watching”\nPinkPantheress – “Illegal”\n\nBest Traditional Pop Vocal Album\nLaila Biali – Wintersongs\nJennifer Hudson – The Gift Of Love\nElton John & Brandi Carlile – Who Believes In Angels?\nLady Gaga – Harlequin\nLaufey – A Matter Of Time\nBarbra Streisand – The Secret Of Life: Partners, Volume 2\n\nBest Dance Electronic Album\nFKA twigs – Eusexua\nFred again.. – Ten Days\nPinkPantheress – Fancy That\nRüfüs Du Sol – Inhale / Exhale\nSkrillex – Fuck U Skrillex You Think Ur Andy Warhol But Ur Not!! <3\n\nBest Dance/Electronic Recording\nDisclosure & Anderson .Paak – “No Cap”\nFred again.., Skepta, & PlaqueBoyMax – “Victory Lap”\nKaytranada – “Space Invader”\nSkrillex – “Voltage”\nTame Impala – “End of Summer”\n\nBest Rock Album\nDeftones – Private Music\nHaim – I Quit\nLinkin Park – From Zero\nTurnstile – Never Enough\nYungblud – Idols\n\nBest Rock Song\nNine Inch Nails – “As Alive As You Need Me To Be”\nSleep Token – “Caramel\nHayley Williams – “Glum”\nTurnstile – “Never Enough”\nYungblud – “Zombie”\n\nBest Metal Performance\nDream Theater – “Night Terror”\nGhost – “Lachryma”\nSleep Token – “Emergence”\nSpiritbox – “Soft Spine”\nTurnstile – “Birds”\n\nBest Rock Performance\nAmyl and The Sniffers – “U Should Not Be Doing That”\nLinkin Park – “The Emptiness Machine”\nTurnstile – “Never Enough”\nHayley Williams – “Mirtazapine”\nYungblud featuring Nuno Bettencourt, Frank Bello, Adam Wakeman, II – “Changes” (Live From Villa Park, Back To The Beginning)\n\nBest Alternative Music Performance\nBon Iver – “Everything Is Peaceful Love”\nThe Cure – “Alone”\nTurnstile – “Seein’ Stars”\nWet Leg – “Mangetout”\nHayley Williams – “Parachute”\n\nBest Alternative Music Album\nBon Iver – SABLE, fABLE\nThe Cure – Songs Of A Lost World\nTyler, The Creator – Don’t Tap the Glass\nWet Leg – Moisturizer\nHayley Williams – Ego Death At A Bachelorette Party\n\nBest R&B Album\nGivēon – Beloved\nCoco Jones – Why Not More?\nLedisi – The Crown\nTeyana Taylor – Escape Room\nLeon Thomas – Mutt\n\nBest R&B Song\nKehlani – “Folded”\nSummer Walker – “Heart Of A Woman”\nChris Brown Featuring Bryson Tiller – “It Depends”\nDurand Bernarr – “Overqualified”\nLeon Thomas – “Yes It Is”\n\nBest R&B Performance\nJustin Bieber – “Yukon”\nChris Brown Featuring Bryson Tiller – “It Depends”\nKehlani – “Folded”\nLeon Thomas – “Mutt” (Live From NPR’s Tiny Desk)\nSummer Walker – “Heart Of A Woman”\n\nBest Traditional R&B Performance\nDurand Bernarr – “Here We Are”\nLalah Hathaway – “Uptown”\nLedisi – “Love You Too”\nSZA – “Crybaby”\nLeon Thomas – “Vibes Don’t Lie”\n\nBest Progressive R&B Album\nDurand Bernarr – Bloom\nBilal – Adjust Brightness\nDestin Conrad – Love on Digital\nFlo – Access All Areas\nTerrace Martin & Kenyon Dixon – Come As You Are\n\nBest Spoken Word Poetry Album\nQueen Sheba – A Hurricane in Heels: healed people don’t act like that (partially recorded live @City Winery & other places)\nMarc Marcel – Black Shaman\nOmari Hardwick & Anthony Hamilton – Pages\nSaul Williams, Carlos Niño & Friends – Saul Williams meets Carlos Niño & Friends At Treepeople\nMad Skillz – Words For Days Vol. 1\n\nBest Rap Album\nClipse – Let God Sort Em Out\nGloRilla – Glorious\nJID – God Does Like Ugly\nKendrick Lamar – GNX\nTyler, The Creator – Chromakopia\n\nBest Rap Song\nDoechii – “Anxiety”\nClipse featuring John Legend and Voices of Fire – “The Birds Don’t Sing”\nTyler, The Creator featuring GloRilla, Sexyy Red, and Lil Wayne – “Sticky”\nGloRilla – “TGIF”\nKendrick Lamar featuring Lefty Gunplay – “TV Off”\n\nBest Melodic Rap Performance\nFridayy featuring Meek Mill – “Proud Of Me”\nJID featuring Ty Dolla $ign & 6Lack – “Wholeheartedly”\nKendrick Lamar with SZA – “Luther”\nTerrace Martin and Kenyon Dixon featuring Rapsody – “WeMaj”\nPartyNextDoor and Drake – “Somebody Loves Me”\n\nBest Rap Performance\nCardi B – “Outside”\nClipse featuring Kendrick Lamar and Pharrell Williams – “Chains & Whips”\nDoechii – “Anxiety”\nKendrick Lamar featuring Lefty Gunplay – “TV Off”\nTyler, The Creator featuring Teezo Touchdown – “Darling, I”\n\nBest Música Urbana Album\nBad Bunny – DeBÍ TiRAR MáS FOToS\nJ Balvin – Mixteip\nFeid – Ferxxo Vol X: Sagrado\nNicki Nicole – Naiki\nTrueno – Eub Deluxe\nYandel – Sinfónico (En Vivo)\n\nBest Música Mexicana Album (Including Tejano)\nFuerza Regida, Grupo Frontera – Mala Mía\nGrupo Frontera – Y Lo Que Viene\nPaola Jara – Sin Rodeos\nCarín León – Palabra De To’s (Seca)\nBobby Pulido and Friends Una Tuya Y Una Mía – Por La Puerta Grande (En Vivo)\n\nBest Latin Pop Album\nRauw Alejandro – Cosa Nuestra\nAndrés Cepeda – Bogotá (Deluxe)\nKarol G – Tropicoqueta\nNatalia Lafourcade – Cancionera\nAlejandro Sanz – ¿Y ahora qué?\n\nBest Latin Rock or Alternative Album\nAterciopelados – Genes Rebeldes\nAstropical – Astropical\nCa7riel and Paco Amoroso – Papota\nLos Wizzards – Algorhythm\nFito Paez – Novela\n\nBest Tropical Latin Album\nRubén Blades, Roberto Delgado & Orquesta – Fotografías\nGloria Estefan – Raíces\nGrupo Niche – Clásicos 1.0\nAlain Pérez – Bingo\nGilberto Santa Rosa – Debut y Segunda Tanda, Vol. 2\n\nBest Traditional Country Album\nCharley Crockett – Dollar A Day\nLukas Nelson – American Romance\nWillie Nelson – Oh What A Beautiful World\nMargo Price – Hard Headed Woman\nZach Top – Ain’t In It For My Health\n\nBest Contemporary Country Album\nKelsea Ballerini – Patterns\nTyler Childers – Snipe Hunter\nEric Church – Evangeline Vs. The Machine\nJelly Roll – Beautifully Broken\nMiranda Lambert – Postcards From Texas\n\nBest Country Solo Performance\nTyler Childers – “Nose On The Grindstone”\nShaboozey – “Good News”\nChris Stapleton – “Bad As I Used To Be”\nZach Top – “I Never Lie”\nLainey Wilson – “Somewhere Over Laredo”\n\nBest Country Duo/Group Performance\nMiranda Lambert and Chris Stapleton – “A Song To Sing”\nReba McEntire, Miranda Lambert, Lainey Wilson – “Trailblazer”\nMargo Price and Tyler Childers – “Love Me Like You Used To Do”\nShaboozey and Jelly Roll – “Amen”\nGeorge Strait and Chris Stapleton – “Honky Tonk Hall Of Fame”\n\nBest Country Song\nTyler Childers – “Bitin’ List”\nShaboozey – “Good News”\nZach Top – “I Never Lie”\nLainey Wilson – “Somewhere Over Laredo”\nMiranda Lambert and Chris Stapleton – “A Song To Sing”\n\nBest American Roots Performance\nJon Batiste featuring Randy Newman – “Lonely Avenue”\nI’m With Her – “Ancient Light”\nJason Isbell – “Crimson And Clay”\nAlison Krauss and Union Station – “Richmond On The James”\nMavis Staples – “Beautiful Strangers”\n\nBest Americana Performance\nSierra Hull – “Boom”\nMaggie Rose & Grace Potter – “Poison In My Well”\nMavis Staples – “Godspeed”\nMolly Tuttle – “That’s Gonna Leave A Mark”\nJesse Welles – “Horses”\n\n\nBest American Roots Song\nI’m With Her – “Ancient Light”\nJon Batiste – “Big Money”\nJason Isbell – “Foxes In The Snow”\nJesse Welles – “Middle”\nSierra Hull – “Spitfire”\n\nBest Americana Album\nJon Batiste – Big Money\nLarkin Poe – Bloom\nWillie Nelson – Last Leaf On The Tree\nMolly Tuttle – So Long Little Miss Sunshine\nJesse Welles – Middle\n\nBest Bluegrass Album\nMichael Cleveland & Jason Carter – Carter & Cleveland\nSierra Hull – A Tip Toe High Wire\nAlison Krauss & Union Station – Arcadia\nThe Steeldrivers – Outrun\nBilly Strings – Highway Prayers\n\nBest Traditional Blues Album\nBuddy Guy – Ain’t Done With The Blues\nTaj Mahal & Keb’ Mo’ – Room On The Porch\nMaria Muldaur – One Hour Mama: The Blues Of Victoria Spivey\nCharlie Musselwhite – Look Out Highway\nKenny Wayne Shepherd and Bobby Rush – Young Fashioned Ways\n\nBest Contemporary Blues Album\nJoe Bonamassa – Breakthrough\nSamantha Fish – Paper Doll\nEric Gales – A Tribute To LJK\nRobert Randolph – Preacher Kids\nSouthern Avenue – Family\n\nBest Folk Album\nRhiannon Giddens and Justin Robinson – What Did The Blackbird Say To The Crow\nPatty Griffin – Crown Of Roses\nI’m With Her – Wild And Clear And Blue\nJason Isbell – Foxes In The Snow\nJesse Welles – Under The Powerlines (April 24 – September 24)\n\nBest Gospel Performance/Song\nKirk Franklin – “Do It Again”\nTasha Cobbs Leonard, John Legend – “Church”\nJonathan McReynolds & Jamal Roberts – “Still” (Live)\nPastor Mike Jr – “Amen”\nCece Winans featuring Shirley Caesar – “Come Jesus Come”\n\nBest Global Music Album\nSiddhant Bhatia – Sounds Of Kumbha\nBurna Boy – No Sign of Weakness\nYoussou N’Dour – Eclairer le monde – Light the World\nShakti – Mind Explosion (50th Anniversary Tour Live)\nAnoushka Shankar Featuring Alam Khan & Sarathy Korwar – Chapter III: We Return To Light\nCaetano Veloso And Maria Bethânia – Caetano e Bethânia Ao Vivo\n\nBest Musical Theater Album\nBuena Vista Social Club\nDeath Becomes Her\nGypsy\nJust In Time\nMaybe Happy Ending\n\nBest Reggae Album\nLila Iké – Treasure Self Love\nVybz Kartel – Heart & Soul\nKeznamdi – Blxxd & Fyah\nMortimer – From Within\nJesse Royal – No Place Like Home\n\nBest Comedy Album\nBill Burr – Drop Dead Years\nSarah Silverman – PostMortem\nAli Wong – Single Lady\nJamie Foxx – What Had Happened Was…\nNate Bargatze –Your Friend, Nate Bargatze\n\nBest Audio Book, Narration, and Storytelling Recording\nKathy Garver – Elvis, Rocky & Me: The Carol Connors Story\nTrevor Noah – Into The Uncut Grass\nKetanji Brown Jackson – Lovely One: A Memoir\nDalai Lama – Meditations: The Reflections Of His Holiness The Dalai Lama\nFab Morvan – You Know It’s True: The Real Story Of Milli Vanilli\n\nBest Compilation Soundtrack For Visual Media\nTimothée Chalamet – A Complete Unknown\nVarious Artists – F1® The Album\nVarious Artists – KPop Demon Hunters\nVarious Artists – Sinners\nVarious Artists – Wicked\n\nBest Song Written For Visual Media\nNine Inch Nails – “As Alive As You Need Me To Be” (from Tron: Ares)\nHuntr/x (Ejae, Audrey Nuna, Rei Ami) – “Golden” (from KPop Demon Hunters)\nMiles Caton – “I Lied to You” (from Sinners)\nElton John and Brandi Carlile – “Never Too Late” (from Elton John: Never Too Late)\nJayme Lawson – “Pale, Pale Moon” (from Sinners)\nRod Wave – “Sinners” (from Sinners)\n\nBest Score Soundtrack For Visual Media (Includes Film and Television)\nJohn Powell – How to Train Your Dragon\nTheodore Shapiro – Severance: Season 2\nLudwig Göransson – Sinners\nJohn Powell & Stephen Schwartz – Wicked\nKris Bowers – The Wild Robot\n\nBest Music Video\nSade – “Young Lion”\nSabrina Carpenter – “Manchild”\nClipse – “So Be It”\nDoechii – “Anxiety”\nOK Go – “Love”\n\nBest Music Film\nDevo – Devo\nRaye – Live at the Royal Albert Hall\nDiane Warren – Relentless\nJohn Williams – Music by John Williams\nPharrell Williams – Piece by Piece\n\nBest Album Cover\nTyler, The Creator – Chromakopia (Shaun Llewellyn & Luis “Panch” Perez)\nDjo – The Crux (William Wesley II)\nBad Bunny – Debí Tirar Más Fotos (Benito Antonio Martinez Ocasio)\nPerfume Genius – Glory (Cody Critcheloe & Andrew J.S.)\nWet Leg – Moisturizer (Hester Chambers, Ellis Durand, Henry Holmes, Matt de Jong, Jamie-James Medina, Joshua Mobaraki & Rhian Teasdale)",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/7c3ff234-dfff-4d1f-8c6e-f33c3551bddb.jpg",
    "timestamp": "2025-11-07T23:01:07.709Z"
  },
  {
    "slug": "base-fm-new-music-friday-1762555566290",
    "headline": "BASE FM NEW MUSIC FRIDAY",
    "kicker": "",
    "summary": "Your latest hits out today!",
    "bodyText": "Take a look at all the new music out for the first week in November:\n\n- L.A.X Ft Olamide- Belinda\n\n- Johnny Drille - I'm Available\n\n- Poco Lee Ft Mavo, Diamond boy - Enjoyment\n\n- Shine TTW - Loco\n\n- Korede Bello - Numba 1\n\n- Alpha P x Yo x - Location\n\n- Olivetheboy- Spifomita\n\n- Raybekah - Kolobi\n\n- Smur Lee Ft Dj Maphorisa x Focalistic x Chico - Deliver\n\n- Falz - Bounce\n\n- Joshua Baraka Dr Jae5 - Still Young\n\n- Mavins Ft Don Jazzy - Waka",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/3f154708-4411-426b-b2b2-9fb5723a1713.jpeg",
    "timestamp": "2025-11-07T22:46:06.290Z"
  },
  {
    "slug": "meghan-markle-returns-to-acting-1762511610514",
    "headline": "Meghan Markle Returns to Acting",
    "kicker": "",
    "summary": "The Duchess of Sussex, Meghan Markle is returning to acting  as she takes  a small role in an upcoming movie titled \"Close Personal Friends.",
    "bodyText": "The Duchess of Sussex, Meghan Markle is returning to acting  as she takes  a small role in an upcoming movie titled \"Close Personal Friends.\n\nMarkle is reportedly set to play herself in the Amazon MGM Studios project starring Brie Larson, Lily Collins, Jack Quaid and Henry Golding.\n\nShe and her husband Harry  had in   2022 partnered with Netflix to star in the 2022 docuseries \"Meghan & Harry\" .",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/50b8ba0d-90f2-4af1-9ff4-d27e7739332f.jpeg",
    "timestamp": "2025-11-07T10:33:30.514Z"
  },
  {
    "slug": "nafdac-bans-alcoholic-drinks-in-sachets-startig-december-1762511484835",
    "headline": "NAFDAC Bans Alcoholic Drinks in Sachets Startig December",
    "kicker": "",
    "summary": "The Senate has directed  the National Agency for Food and Drug Administration and Control,NAFDAC, to begin the enforcement of  the ban on the production and sale of alcoholic drinks in sachets and small plastic bottles by December 2025.",
    "bodyText": "The Senate has directed  the National Agency for Food and Drug Administration and Control,NAFDAC, to begin the enforcement of  the ban on the production and sale of alcoholic drinks in sachets and small plastic bottles by December 2025.\n\nThe directive followed a motion sponsored by Senator Asuquo Ekpenyong,Cross River South, who expressed concerns over the repeated postponement of the ban despite the rising health and social problems linked to the consumption of cheap alcohol.\n\nEkpenyong argued that NAFDAC had shifted the phase-out date several times, from 2023 to 2024 and later to 2025, due to pressure from manufacturers, waring that indefinite delays  would amount to “a betrayal of public trust and a violation of Nigeria’s commitment to global health standards.”",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2d896920-95e4-4d06-8f33-c2fe77d1f7a7.jpg",
    "timestamp": "2025-11-07T10:31:24.835Z"
  },
  {
    "slug": "nancy-pelosi-announces-she-will-not-seek-re-election-1762511353957",
    "headline": "Nancy Pelosi Announces She Will Not Seek Re-election",
    "kicker": "",
    "summary": "",
    "bodyText": "Former U.S. House Speaker Nancy Pelosi has announced she will not seek re-election at the end of her current tenure.\n\nThe 85-year-old Democrat, who made history as the first woman to serve as Speaker of the House, announced  her decision in a video to her San Francisco constituents, saying she would serve her final term “with a grateful heart.”\n\nPelosi, now in her 19th term, has represented San Francisco for 38 years and led her party in Congress for two decades.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/4689222a-b4c8-4b05-a54c-dddc2012794f.jpeg",
    "timestamp": "2025-11-07T10:29:13.957Z"
  },
  {
    "slug": "president-bola-tinubu-has-sworn-in-two-newly-appointed-ministers-bernard-doro-and-kingsley-ude-1762511221650",
    "headline": "President Bola Tinubu has Sworn in Two Newly Appointed Ministers, Bernard Doro and Kingsley Ude.",
    "kicker": "",
    "summary": "",
    "bodyText": "Doro, from Plateau State, replaces former Minister of Humanitarian Affairs and Poverty Reduction, Nentawe Yilwatda, who recently assumed office as National Chairman of the All Progressives Congress (APC).\n\nWhile Ude, a Senior Advocate of Nigeria (SAN) from Enugu State, replaces  former Minister of Science, Innovation and Technology, Uche Nnaji, who resigned following certificate forgery allegations.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/fb9df721-1318-41a5-a2bd-f21bd67e96fd.jpeg",
    "timestamp": "2025-11-07T10:27:01.650Z"
  },
  {
    "slug": "lagos-fashion-week-wins-earthshot-prize-2025-to-build-a-waste-free-world-1762511112032",
    "headline": "LAGOS FASHION WEEK WINS EARTHSHOT PRIZE 2025 - TO BUILD A WASTE FREE WORLD",
    "kicker": "",
    "summary": "",
    "bodyText": "Lagos Fashion Week has been named the Winner of the 2025 Earthshot Prize to Build a Waste-Free World.\nReceiving the award, founder Omoyemi Akerele shared:\n\"By 2030, with the support of the Earthshot Prize, we will establish the first fully functional Circular Fashion Hub in Lagos. This hub will travel to other African cities powered by culture and craftsmanship transforming textile waste into new materials, new businesses, and sustainable livelihoods.\"\nShe added:\n\"We call on fashion weeks across the Global South to join us in adopting this model to champion local craftsmanship and build a regenerative fashion future that restores both people and the planet.\"",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/118cdb04-8ba5-4774-bec2-b29e8cd68b08.jpeg",
    "timestamp": "2025-11-07T10:25:12.032Z"
  },
  {
    "slug": "the-fisherman-cast-opens-up-on-the-lunchroom-from-deep-sea-dreams-to-deep-personal-grief-1762508194192",
    "headline": "The Fisherman Cast Opens Up on The Lunchroom: From Deep Sea Dreams to Deep Personal Grief",
    "kicker": "",
    "summary": "",
    "bodyText": "It was an emotional and engaging episode of The Lunchroom this week as host GrandPrince Ita sat down with the creative team behind the highly anticipated film, The Fisherman.\nFilmmaker Director Zoe was joined by actors Endurance Grand, Rick Ade Layitar, and William Lamptey for a conversation that delved into the film’s message, the emotional toll of storytelling, and the cultural bond that unites the cast, ending, of course, with the lighthearted Nigeria vs. Ghana Jollof rice debate.\nDirector Zoe clarified that despite its title, The Fisherman is not a story about the sea but about dreams, resilience, and the pursuit of purpose against all odds.\n“Forget the hook and line,” she said. “This film is pure heart, a testament to resilience, the power of a dream, and the enduring human spirit. Every character is fighting for something bigger than themselves.”\nFor Endurance Grand, taking on her first major leading role was both challenging and transformative. She described the process as “intensely demanding but deeply rewarding,” crediting the film for pushing her to discover new emotional depths as an actor.\nHer co-star Rick Ade Layitar shared a deeply personal story that touched everyone in the studio. The actor revealed he was dealing with the loss of his brother when he joined the project, and that the experience became a crucial part of his healing journey.\n“Acting in The Fisherman was therapy for me,” he admitted. “It allowed me to channel my grief into something meaningful and find peace through the character.”\nThe discussion also took a lighter turn when William Lamptey, who is visiting Nigeria for the first time, praised the country’s “overwhelming energy, infectious creativity, and incredible warmth.”\nNaturally, the conversation soon drifted to the long-standing culinary rivalry between Nigeria and Ghana. With Endurance Grand being of both Nigerian and Ghanaian heritage, she found herself hilariously stuck in the middle as her co-stars playfully defended their countries’ versions of Jollof rice.\nWrapping up the conversation, Director Zoe encouraged audiences to experience the story for themselves, describing The Fisherman as a film that will inspire viewers to never give up on their dreams.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/0eab6085-1003-4b57-aad3-ee44c6fd245c.jpeg",
    "timestamp": "2025-11-07T09:36:34.192Z"
  },
  {
    "slug": "omawumi-explores-new-sounds-with-fuji-house-fusion-on-base-sunrise-1762502043410",
    "headline": "Omawumi Explores New Sounds with Fuji-House Fusion on Base Sunrise",
    "kicker": "",
    "summary": "",
    "bodyText": "It was an exciting morning on Base Sunrise with Chacha as award-winning Nigerian singer and songwriter Omawumi joined the show to talk about her latest single, “Temperature,” and the bold, experimental direction her music is taking.\nDuring the lively conversation, Omawumi revealed that “Temperature” is a daring blend of Fuji and House music — a combination rarely heard in the Nigerian soundscape.\nAccording to the singer, the inspiration for the song came from a fan who challenged her to step completely outside her comfort zone and experiment with something unexpected.\n“The creative process was genuinely refreshing and unpredictable,” Omawumi shared. “It felt like I was back in the lab  taking elements I love and seeing how they could fight, dance, and finally blend. The result is something that respects our roots but is impossible to sit still to.”\nThe track, she explained, merges the layered percussion of traditional Fuji music with the vibrant, rhythmic pulse of House creating a sound that’s as energetic as it is culturally grounded.\nBeyond the music, Omawumi used her time on Base FM to speak passionately about unity among female artists in the Nigerian music industry.\n“Growth in this industry, especially for women, depends on us,” she said. “We need to intentionally uplift one another — share knowledge, share stages, and share the spotlight. That genuine support is what drives collective success.”\nWrapping up the conversation, Omawumi teased that “Temperature” marks the beginning of an exciting new chapter in her career. She confirmed that more releases are on the way in January, promising to keep exploring fresh sounds and creative risks.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/78f2452b-a146-4f46-a808-475e8a7da763.jpeg",
    "timestamp": "2025-11-07T07:54:03.410Z"
  },
  {
    "slug": "journalism-under-siege-base-sunrise-marks-international-day-to-end-impunity-for-crimes-against-journalists-1762456125151",
    "headline": "Journalism Under Siege: Base Sunrise Marks International Day to End Impunity for Crimes Against Journalists",
    "kicker": "",
    "summary": "On Base Sunrise with Chacha, veteran journalist Segun James joined the conversation to reflect on the harsh realities of practicing journalism in Nigeria, a country where, as he put it, “the lives of journalists are not valued.”",
    "bodyText": "As the world marked the International Day to End Impunity for Crimes Against Journalists, Segun shared deeply personal experiences that shed light on the dangers, lack of protection, and emotional toll faced by those in the media profession.\nSegun emphasized that the root of the crisis lies in impunity, the consistent failure to hold perpetrators accountable for violence against journalists.\n“The major reason these attacks persist,” he noted, “is because those responsible are never investigated or punished.”\nBoth international and local media watchdogs have long confirmed this disturbing trend: in nearly all cases of journalist killings, harassment, or intimidation in Nigeria, justice is never served. This entrenched culture of impunity, Segun warned, emboldens aggressors and silences truth-tellers.\nBeyond the physical threats, the journalist spoke about the psychological burden of working under constant danger. He described how this climate of fear has created a “chilling effect” where journalists are forced into self-censorship to avoid detention, harm, or even death.\n“When your personal safety is at stake,” he explained, “you begin to question whether reporting the truth is worth the risk. And when that happens, the public suffers—because a less-informed public means a weaker democracy.”\nSegun James also recounted harrowing personal experiences from the field—including witnessing a colleague’s assassination while on duty and facing physical violence after publishing a story about a state governor.\n“The governor called me a ‘terrorist journalist’ just because I wrote the truth,” he recalled. “He didn’t even bother to report me to my organization because he knew the facts were correct.”\nHe went on to reveal that such confrontations have forced him to tone down his reporting and avoid certain assignments, not out of fear of exposure, but simply to stay alive.\nSegun further highlighted the economic struggles many Nigerian journalists face, stressing that poor pay and lack of insurance or institutional protection make an already risky job even more dangerous.\nHost Chacha echoed his sentiments, reminding listeners that journalism is more than a profession; it is a public service.\n“Journalism isn’t just a job,” she said. “It’s a social service that holds power accountable and keeps society informed.” Segun agreed, adding that while the tools of journalism have evolved from fax machines to laptops and mobile phones, the most urgent transformation must happen in education.\n“Not everyone sharing information online is a journalist,” he cautioned. “There’s a thin line between citizen reporting and professional journalism, and that line is fading fast. We need education and regulation to preserve the credibility of the profession.”\nAs the conversation closed, both Segun and Chacha called for stronger laws to protect journalists and hold attackers accountable. Their discussion served as a sobering reminder that without safety, fairness, and freedom for the press, democracy itself remains under threat.\n",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/2f3ff076-1331-4a11-a8f9-954ed3aa04c3.jpg",
    "timestamp": "2025-11-06T19:08:45.151Z"
  },
  {
    "slug": "14-yr-old-british-boy-who-sued-ghanaian-parents-for-sending-him-to-boarding-school-in-ghana-loses-1762445909607",
    "headline": "14-yr-old British Boy Who Sued Ghanaian Parents for Sending Him to Boarding School in Ghana, Loses",
    "kicker": "",
    "summary": "A British court has ruled that a 14-year-old boy who sued his parents after being sent to boarding school in Ghana must remain there until he completes the equivalent of his GCSEs.",
    "bodyText": "A British court has ruled that a 14-year-old boy who sued his parents after being sent to boarding school in Ghana must remain there until he completes the equivalent of his GCSEs.\n\nThe teenager, who cannot be identified for legal reasons, was taken to Ghana in March 2024 under the pretext of visiting a sick relative. However, court documents reveal his parents had planned the move over concerns about his behaviour in London, citing frequent absences from school, unexplained money, and possession of a knife. The boy denies carrying a weapon or being involved in gang activity.\n\nIn a judgment delivered on Tuesday, Mrs Justice Theis of the High Court ruled that the boy should continue his studies in Ghana, despite his wish to return to the United Kingdom. She said: “I am acutely aware that the conclusion I have reached does not accord with [his] wishes and how that will feel for him. [He] has the talent, ability and intelligence to make this work together with his family. It will be difficult but they all have the common aim for [him] to return to live with his family.”\n\nThe decision marks the latest development in a case that began when the boy, feeling “unhappy and homesick”, contacted publicly funded lawyers and filed a case against his parents in February 2025. He initially lost the case after the High Court ruled that returning to the UK would expose him to “greater harm”. However, the Court of Appeal ordered a rehearing in June after Sir Andrew McFarlane, President of the Family Division, found that the earlier ruling contained procedural confusion.\n\nThe boy, who holds both British and Ghanaian citizenship, told the court he felt “like an alien” in Ghana and described his experience as “living in hell”. He said he had struggled to make friends, did not speak Twi, and suffered from social anxiety.\n\nHis solicitor, James Netto of the International Family Law Group, said his client “welcomes” the judge’s decision to provide a “road map” for his eventual return but maintained that “his position remains unchanged: he wants to return home”. Mr Netto added that the case had been “extremely difficult on every level” and that the boy had not wanted to take legal action against his parents but had “no meaningful alternative”.\n\nThe boy’s mother told the court she still feared for her son’s safety if he were to return to the UK prematurely. “It is really hard to be away from him,” she said. “I feared and continue to fear if he were to come back now, that he could end up dead. I know he does not see it like that.”\n\nMrs Justice Theis ordered that the teenager “remain living in Ghana with the aim of setting out a road map and taking the necessary steps for [him] to return here after completing his GCSEs”, adding that his situation “will need to be reviewed nearer the time”.\n\nThe roadmap includes ongoing family therapy funded by the local authority, intended to support the boy’s eventual reintegration into life in the United Kingdom.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/020233b9-1c0d-4d28-bcd1-6af570841471.jpeg",
    "timestamp": "2025-11-06T16:18:29.607Z"
  },
  {
    "slug": "anambra-poll-obi-calls-for-peaceful-election-1762445709535",
    "headline": "Anambra Poll: Obi Calls for Peaceful Election",
    "kicker": "",
    "summary": "The presidential candidate of the Labour Party in the 2023 general elections, Mr Peter Obi, has called on Anambra residents and political candidates to ensure a peaceful and transparent electoral process in the November 8, 2025, governorship election in the state.",
    "bodyText": "Addressing journalists at his residence in Agulu, Anaocha Local Government Area of the state, on Wednesday, Obi urged the residents to turn out in mass and exercise their democratic and civil rights.\n\nThe former Anambra governor urged political actors to respect the rule of law and prioritise the state’s peace and security, stressing that politicians must pursue their interests within the confines of the law.\n\nHe said, “My interest in this Anambra 2025 governorship election is a peaceful process before, during, and after the exercise. I want a peaceful, free and fair election. This election is for Ndi-Anambra, and anyone who wins, wins for the development of the state.\n\n“All the contestants, including the incumbent governor, Prof. Chukwuma Soludo of the All Progressives Grand Alliance, Prince Nicholas Ukachukwu of the All Progressives Congress and my party’s candidate, Chief George Moughalu of the Labour Party, are my friends.\n\n“But I will vote for the candidate of my party, and I urged every other voter-card-carrying resident in Anambra State to go out and vote for the candidate of their choice.”\n\nObi, however, called on the Independent National Electoral Commission and security agencies to uphold their constitutional responsibilities by ensuring neutrality and professionalism during the electoral exercise.\n\nPunch Online had reported that the INEC had declared full readiness for the governorship election slated for Saturday, November 8, 2025, across the 5,718 wards across the state.\n\nThe Chairman of the commission, Prof. Joash Amupitan, during a stakeholders meeting in Awka, said about 24,000 ad hoc staff will be deployed, while about 540 journalists have been accredited to cover the election, adding that the commission is fully committed to the governorship poll in line with its commitment to credible and inclusive elections.\n\nHe said the Commission has been implementing a comprehensive plan of activities covering logistics, technology, training, stakeholder engagement, and security coordination, including the conduct of a mock accreditation exercise, which was conducted across selected polling units in three senatorial districts of the state on Saturday.\n\nAccording to INEC, 16 candidates from 16 political parties are contesting the governorship election to wrest power from the incumbent, Prof. Chukwuma Soludo, who is also seeking reelection under the platform of APGA.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/093a9708-0bbd-4400-9c47-1709b01781f0.webp",
    "timestamp": "2025-11-06T16:15:09.535Z"
  },
  {
    "slug": "fifa-appoints-south-african-referee-tom-abongile-1762443989733",
    "headline": "FIFA Appoints South African referee, Tom Abongile",
    "kicker": "",
    "summary": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.",
    "bodyText": "FIFA has appointed South African referee Tom Abongile to officiate Nigeria’s 2026 World Cup playoff against Gabon on November 13 in Rabat.\n\nHis compatriots Zakhele Siwela and Akhona Makalima will serve as assistant referee and VAR official, with a Beninese assessor overseeing the match. The appointment has sparked outrage in Nigeria, where officials and fans questioned FIFA’s neutrality.\n\nFIFA said the selections were made by its Referees Committee, noting South Africans’ strong experience in major continental competitions.\n\n*The chief executive of Israeli club Maccabi Tel Aviv says it is \"incredibly sad\" away fans have been banned from his side's Europa League match at Aston Villa.\n\nJack Angelides  noted that Politics should never be drawn into football.\n\nLast month, the local Safety Advisory Group - the body responsible for issuing safety certificates for matches - informed Villa that no travelling fans would be allowed to attend the fixture in Birmingham on Thursday after police raised concerns, sparking a major backlash.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/e82fdb64-b9f1-42c2-af30-291eaffc0894.webp",
    "timestamp": "2025-11-06T15:46:29.733Z"
  },
  {
    "slug": "bandits-kill-pastor-abduct-20-worshippers-in-kaduna-community-1761995025934",
    "headline": "BANDITS KILL PASTOR, ABDUCT 20 WORSHIPPERS IN KADUNA COMMUNITY",
    "kicker": "BREAKING",
    "summary": "Armed bandits attacked the Farin Dutse community in Kauru Local Government Area of Kaduna State, killed Rev. Yahaya Kambasiya of the United Church of Christ in Nigeria (HEKAN), and kidnapped more than 20 worshippers. Church leaders are calling for urgent security intervention.",
    "bodyText": "Armed bandits raided the Farin Dutse community in Kauru Local Government Area of Kaduna State and killed a local pastor, Rev. Yahaya Kambasiya, during a night attack that also left more than 20 residents abducted.\n\nRev. Kambasiya was a minister with the United Church of Christ in Nigeria (HEKAN). According to witnesses, the attackers moved into the village shooting, forcing families out of their homes, and targeting members of the church community. He was shot and killed at the scene.\n\nAfter killing the pastor, the gunmen went house to house and took several people, including women and youths, before escaping with them into nearby bush areas.\n\nThe President of HEKAN, Rev. Dr. Amos Kiri, condemned the attack and described it as “an attack on a peaceful worship community.” He called the killing of Rev. Kambasiya “painful and unacceptable,” and demanded immediate action from security agencies to rescue the abducted members and stop repeated raids on Christian communities in that part of Kaduna.\n\nHe also urged authorities at both state and federal level to stop treating these incidents as routine and to treat them as an ongoing emergency affecting worship centres, pastors, and entire families.\n\nResidents of the area say this is not the first time armed groups have entered at night, taken hostages, and left without resistance. Locals say they feel abandoned and unprotected, and that kidnappings for ransom have become a way of life in rural Kaduna.\n\nAs of now, the abducted worshippers are still missing.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/89079af3-addc-4005-9625-c4353d1688e1.jpeg",
    "timestamp": "2025-11-01T11:03:45.934Z"
  },
  {
    "slug": "adekunle-gold-reveals-ongoing-battle-with-sickle-cell-disease-1761994916694",
    "headline": "ADEKUNLE GOLD REVEALS ONGOING BATTLE WITH SICKLE CELL DISEASE",
    "kicker": "HEALTH • MUSIC",
    "summary": "Nigerian singer Adekunle Gold says he is still living with sickle cell disease and still goes through painful “crises,” a condition he’s managed since he was five years old. He urged Nigerians to know their genotype before marriage so they don’t pass the disorder to their children, saying “a lot of people still don’t understand the risk",
    "bodyText": "Adekunle Gold has opened up about his ongoing battle with sickle cell disease, saying he still experiences painful health crises even as an adult.\n\nAccording to him, his first major crisis happened when he was about five years old. He said his mum had to carry him on her back to the hospital in the middle of the night while his dad wasn’t home. He’s been on medication ever since.\n\n“I still have crises,” he said. “When we talk about a crisis, it’s pain in your joints, your legs, and sometimes your stomach. It’s really crazy.” He added that while the attacks are now less frequent than when he was younger, they haven’t fully gone away. He credits better self-care and access to treatment for keeping things under control.The 38-year-old artist also addressed rumours that he did a bone marrow transplant to ‘cure’ it. He denied that and said people on the internet talk “with so much confidence about what they don’t know.”\n\nBeyond talking about his own story, Adekunle Gold used the moment to push awareness. He told Nigerians to take genotype seriously before getting married, because two people with incompatible genotypes can pass sickle cell to their child and lock that child into a lifetime of pain. “Knowing your genotype is very important,” he said. “A lot of people still don’t understand the risks.”\n\n\nHe said he wants to “make more noise” about it, not just as a celebrity moment, but so fewer kids are born into a situation where every fever could become an emergency and every joint pain might mean another night in the hospital.\n\nFor him, this is personal — not PR. He’s lived it.",
    "imageUrl": "https://raw.githubusercontent.com/RomulusGroup/basefm-cms/main/uploads/9027b890-d293-453c-accf-334652e0c617.jpeg",
    "timestamp": "2025-11-01T11:01:56.694Z"
  }
]